koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm320i.h
/*
 * Copyright (C) 2015 Analog Devices Inc.
 * Copyright (C) 2022 Sergey Koshkin <koshkin.sergey@gmail.com>
 * All rights reserved
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

/** @addtogroup Analog Devices Inc.
  * @{
  */

/** @addtogroup ADUCM320I
  * @{
  */

#ifndef ADUCM320I_H_
#define ADUCM320I_H_

#ifndef __NO_MMR_STRUCTS__
// The new style CMSIS structure definitions for MMRs clash with
// the old style defs. If the old style are required for compilation
// then set __NO_MMR_STRUCTS__ to 0x1
#define __NO_MMR_STRUCTS__ 0x0
#endif

#ifdef __cplusplus
extern "C" {
#endif 


/* -------------------------  Interrupt Number Definition  ------------------------ */

typedef enum {
/* -------------------  Cortex-M3 Processor Exceptions Numbers  ------------------- */
  Reset_IRQn                        = -15,  /*!<   1  Reset Vector, invoked on Power up and warm reset */
  NonMaskableInt_IRQn               = -14,  /*!<   2  Non maskable Interrupt, cannot be stopped or preempted */
  HardFault_IRQn                    = -13,  /*!<   3  Hard Fault, all classes of Fault */
  MemoryManagement_IRQn             = -12,  /*!<   4  Memory Management, MPU mismatch, including Access Violation and No Match */
  BusFault_IRQn                     = -11,  /*!<   5  Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory related Fault */
  UsageFault_IRQn                   = -10,  /*!<   6  Usage Fault, i.e. Undef Instruction, Illegal State Transition */
  SVCall_IRQn                       = -5,   /*!<  11  System Service Call via SVC instruction */
  DebugMonitor_IRQn                 = -4,   /*!<  12  Debug Monitor                    */
  PendSV_IRQn                       = -2,   /*!<  14  Pendable request for system service */
  SysTick_IRQn                      = -1,   /*!<  15  System Tick Timer                */
// --------------------------  ADUCM320I Specific Interrupt Numbers  ------------------------------
  WUT_IRQn                          = 0,    /*!<   0  WUT                              */
  EINT0_IRQn                        = 1,    /*!<   1  EINT0                            */
  EINT1_IRQn                        = 2,    /*!<   2  EINT1                            */
  EINT2_IRQn                        = 3,    /*!<   3  EINT2                            */
  EINT3_IRQn                        = 4,    /*!<   4  EINT3                            */
  EINT4_IRQn                        = 5,    /*!<   5  EINT4                            */
  EINT5_IRQn                        = 6,    /*!<   6  EINT5                            */
  EINT6_IRQn                        = 7,    /*!<   7  EINT6                            */
  EINT7_IRQn                        = 8,    /*!<   8  EINT7                            */
  EINT8_IRQn                        = 9,    /*!<   9  EINT8                            */
  WDT_IRQn                          = 10,   /*!<  10  WDT                              */
  LVD0_IRQn                         = 13,   /*!<  13  LVD0                             */
  MDIO_IRQn                         = 14,   /*!<  14  MDIO                             */
  TIMER0_IRQn                       = 15,   /*!<  15  TIMER0                           */
  TIMER1_IRQn                       = 16,   /*!<  16  TIMER1                           */
  FLASH_IRQn                        = 17,   /*!<  17  FLASH                            */
  UART_IRQn                         = 18,   /*!<  18  UART                             */
  SPI0_IRQn                         = 19,   /*!<  19  SPI0                             */
  SPI1_IRQn                         = 20,   /*!<  20  SPI1                             */
  I2C0S_IRQn                        = 21,   /*!<  21  I2C0S                            */
  I2C0M_IRQn                        = 22,   /*!<  22  I2C0M                            */
  PLA0_IRQn                         = 23,   /*!<  23  PLA0                             */
  PLA1_IRQn                         = 24,   /*!<  24  PLA1                             */
  DMA_ERR_IRQn                      = 25,   /*!<  25  DMA_ERR                          */
  DMA_SPI0_TX_IRQn                  = 26,   /*!<  26  DMA_SPI0_TX                      */
  DMA_SPI0_RX_IRQn                  = 27,   /*!<  27  DMA_SPI0_RX                      */
  DMA_SPI1_TX_IRQn                  = 28,   /*!<  28  DMA_SPI1_TX                      */
  DMA_SPI1_RX_IRQn                  = 29,   /*!<  29  DMA_SPI1_RX                      */
  DMA_UART_TX_IRQn                  = 30,   /*!<  30  DMA_UART_TX                      */
  DMA_UART_RX_IRQn                  = 31,   /*!<  31  DMA_UART_RX                      */
  DMA_I2C0S_TX_IRQn                 = 32,   /*!<  32  DMA_I2C0S_TX                     */
  DMA_I2C0S_RX_IRQn                 = 33,   /*!<  33  DMA_I2C0S_RX                     */
  DMA_I2C0M_IRQn                    = 34,   /*!<  34  DMA_I2C0M                        */
  DMA_I2C1S_TX_IRQn                 = 35,   /*!<  35  DMA_I2C1S_TX                     */
  DMA_I2C1S_RX_IRQn                 = 36,   /*!<  36  DMA_I2C1S_RX                     */
  DMA_I2C1M_IRQn                    = 37,   /*!<  37  DMA_I2C1M                        */
  DMA_ADC_IRQn                      = 38,   /*!<  38  DMA_ADC                          */
  DMA_FLASH_IRQn                    = 39,   /*!<  39  DMA_FLASH                        */
  I2C1S_IRQn                        = 44,   /*!<  44  I2C1S                            */
  I2C1M_IRQn                        = 45,   /*!<  45  I2C1M                            */
  PLA2_IRQn                         = 46,   /*!<  46  PLA2                             */
  PLA3_IRQn                         = 47,   /*!<  47  PLA3                             */
  TIMER2_IRQn                       = 48,   /*!<  48  TIMER2                           */
  LVD1_IRQn                         = 49,   /*!<  49  LVD1                             */
  PWM_TRIP_IRQn                     = 50,   /*!<  50  PWM_TRIP                         */
  PWM_PAIR0_IRQn                    = 51,   /*!<  51  PWM_PAIR0                        */
  PWM_PAIR1_IRQn                    = 52,   /*!<  52  PWM_PAIR1                        */
  PWM_PAIR2_IRQn                    = 53,   /*!<  53  PWM_PAIR2                        */
  PWM_PAIR3_IRQn                    = 54    /*!<  54  PWM_PAIR3                        */
} IRQn_Type;


/** @addtogroup Configuration_of_CMSIS
  * @{
  */

/* ================================================================================ */
/* ================      Processor and Core Peripheral Section     ================ */
/* ================================================================================ */

/* ----------------Configuration of the cm3 Processor and Core Peripherals---------------- */

#define __CM3_REV              0x0200       /*!< Cortex-M3 Core Revision          */
#define __MPU_PRESENT             0         /*!< MPU present or not                    */
#define __NVIC_PRIO_BITS          3         /*!< Number of Bits used for Priority Levels */
#define __Vendor_SysTickConfig    0         /*!< Set to 1 if different SysTick Config is used */
/** @} */ /* End of group Configuration_of_CMSIS */


#include <CMSIS/Core/Cortex/core_cm3.h>
#include "system_aducm32x.h"
#include <stdint.h>


/* ================================================================================ */
/* ================       Device Specific Peripheral Section       ================ */
/* ================================================================================ */


/** @addtogroup Device_Peripheral_Registers
  * @{
  */


/* -------------------  Start of section using anonymous unions  ------------------ */
#if defined(__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined(__ICCARM__)
  #pragma language=extended
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__TMS470__)
/* anonymous unions are enabled by default */
#elif defined(__TASKING__)
  #pragma warning 586
#else
  #warning Not supported compiler type
#endif




/* TLD[LOAD] - Load value */
#define TLD_LOAD_MSK                   (0xFFFF << 0  )

/* TVAL[VAL] - Current count */
#define TVAL_VAL_MSK                   (0xFFFF << 0  )

/* TCON[EVENTEN] - Event select */
#define TCON_EVENTEN_MSK               (0x1   << 12 )
#define TCON_EVENTEN                   (0x1   << 12 )
#define TCON_EVENTEN_DIS               (0x0   << 12 ) /* Events will not be captured */
#define TCON_EVENTEN_EN                (0x1   << 12 ) /* Events will be captured  */

/* TCON[EVENT] - Event select range */
#define TCON_EVENT_MSK                 (0xF   << 8  )

/* TCON[RLD] - Reload control */
#define TCON_RLD_MSK                   (0x1   << 7  )
#define TCON_RLD                       (0x1   << 7  )
#define TCON_RLD_EN                    (0x1   << 7  ) /* Resets the up/down counter when TCLRI[0] is set */
#define TCON_RLD_DIS                   (0x0   << 7  ) /* Up/Down counter is only reset on a timeout event */

/* TCON[CLK] - Clock select */
#define TCON_CLK_MSK                   (0x3   << 5  )
#define TCON_CLK_PCLK                  (0x0   << 5  ) /* PCLK.                    */
#define TCON_CLK_HCLK                  (0x1   << 5  ) /* HCLK.                    */
#define TCON_CLK_LFOSC                 (0x2   << 5  ) /* LFOSC. 32 KHz OSC        */
#define TCON_CLK_HFXTAL                (0x3   << 5  ) /* HFXTAL. 16 MHz OSC or XTAL (Dependent on CLKCON0.11) */

/* TCON[ENABLE] - Timer enable */
#define TCON_ENABLE_MSK                (0x1   << 4  )
#define TCON_ENABLE                    (0x1   << 4  )
#define TCON_ENABLE_DIS                (0x0   << 4  ) /* DIS. Timer is disabled (default) */
#define TCON_ENABLE_EN                 (0x1   << 4  ) /* EN. Timer is enabled     */

/* TCON[MOD] - Timer mode */
#define TCON_MOD_MSK                   (0x1   << 3  )
#define TCON_MOD                       (0x1   << 3  )
#define TCON_MOD_FREERUN               (0x0   << 3  ) /* FREERUN.Timer runs in free running mode */
#define TCON_MOD_PERIODIC              (0x1   << 3  ) /* PERIODIC. Timer runs in periodic mode (default) */

