koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm320i.h
/* GPCON[CON3] - p0.3  configuration bits */
#define GPCON_CON3_MSK                 (0x3   << 6  )

/* GPCON[CON2] - p0.2  configuration bits */
#define GPCON_CON2_MSK                 (0x3   << 4  )

/* GPCON[CON1] - p0.1  configuration bits */
#define GPCON_CON1_MSK                 (0x3   << 2  )

/* GPCON[CON0] - p0.0  configuration bits */
#define GPCON_CON0_MSK                 (0x3   << 0  )

/* GPOE[OE7] - Pin output drive enable */
#define GPOE_OE7_MSK                   (0x1   << 7  )
#define GPOE_OE7                       (0x1   << 7  )
#define GPOE_OE7_DIS                   (0x0   << 7  )
#define GPOE_OE7_EN                    (0x1   << 7  )

/* GPOE[OE6] - Pin output drive enable */
#define GPOE_OE6_MSK                   (0x1   << 6  )
#define GPOE_OE6                       (0x1   << 6  )
#define GPOE_OE6_DIS                   (0x0   << 6  )
#define GPOE_OE6_EN                    (0x1   << 6  )

/* GPOE[OE5] - Pin output drive enable */
#define GPOE_OE5_MSK                   (0x1   << 5  )
#define GPOE_OE5                       (0x1   << 5  )
#define GPOE_OE5_DIS                   (0x0   << 5  )
#define GPOE_OE5_EN                    (0x1   << 5  )

/* GPOE[OE4] - Pin output drive enable */
#define GPOE_OE4_MSK                   (0x1   << 4  )
#define GPOE_OE4                       (0x1   << 4  )
#define GPOE_OE4_DIS                   (0x0   << 4  )
#define GPOE_OE4_EN                    (0x1   << 4  )

/* GPOE[OE3] - Pin output drive enable */
#define GPOE_OE3_MSK                   (0x1   << 3  )
#define GPOE_OE3                       (0x1   << 3  )
#define GPOE_OE3_DIS                   (0x0   << 3  )
#define GPOE_OE3_EN                    (0x1   << 3  )

/* GPOE[OE2] - Pin output drive enable */
#define GPOE_OE2_MSK                   (0x1   << 2  )
#define GPOE_OE2                       (0x1   << 2  )
#define GPOE_OE2_DIS                   (0x0   << 2  )
#define GPOE_OE2_EN                    (0x1   << 2  )

/* GPOE[OE1] - Pin output drive enable */
#define GPOE_OE1_MSK                   (0x1   << 1  )
#define GPOE_OE1                       (0x1   << 1  )
#define GPOE_OE1_DIS                   (0x0   << 1  )
#define GPOE_OE1_EN                    (0x1   << 1  )

/* GPOE[OE0] - Pin output drive enable */
#define GPOE_OE0_MSK                   (0x1   << 0  )
#define GPOE_OE0                       (0x1   << 0  )
#define GPOE_OE0_DIS                   (0x0   << 0  )
#define GPOE_OE0_EN                    (0x1   << 0  )

/* GPPUL[PUL7] - Pin Pull up enable */
#define GPPUL_PUL7_MSK                 (0x1   << 7  )
#define GPPUL_PUL7                     (0x1   << 7  )
#define GPPUL_PUL7_DIS                 (0x0   << 7  )
#define GPPUL_PUL7_EN                  (0x1   << 7  )

/* GPPUL[PUL6] - Pin Pull up enable */
#define GPPUL_PUL6_MSK                 (0x1   << 6  )
#define GPPUL_PUL6                     (0x1   << 6  )
#define GPPUL_PUL6_DIS                 (0x0   << 6  )
#define GPPUL_PUL6_EN                  (0x1   << 6  )

/* GPPUL[PUL5] - Pin Pull up enable */
#define GPPUL_PUL5_MSK                 (0x1   << 5  )
#define GPPUL_PUL5                     (0x1   << 5  )
#define GPPUL_PUL5_DIS                 (0x0   << 5  )
#define GPPUL_PUL5_EN                  (0x1   << 5  )

/* GPPUL[PUL4] - Pin Pull up enable */
#define GPPUL_PUL4_MSK                 (0x1   << 4  )
#define GPPUL_PUL4                     (0x1   << 4  )
#define GPPUL_PUL4_DIS                 (0x0   << 4  )
#define GPPUL_PUL4_EN                  (0x1   << 4  )

/* GPPUL[PUL3] - Pin Pull up enable */
#define GPPUL_PUL3_MSK                 (0x1   << 3  )
#define GPPUL_PUL3                     (0x1   << 3  )
#define GPPUL_PUL3_DIS                 (0x0   << 3  )
#define GPPUL_PUL3_EN                  (0x1   << 3  )

/* GPPUL[PUL2] - Pin Pull up enable */
#define GPPUL_PUL2_MSK                 (0x1   << 2  )
#define GPPUL_PUL2                     (0x1   << 2  )
#define GPPUL_PUL2_DIS                 (0x0   << 2  )
#define GPPUL_PUL2_EN                  (0x1   << 2  )

/* GPPUL[PUL1] - Pin Pull up enable */
#define GPPUL_PUL1_MSK                 (0x1   << 1  )
#define GPPUL_PUL1                     (0x1   << 1  )
#define GPPUL_PUL1_DIS                 (0x0   << 1  )
#define GPPUL_PUL1_EN                  (0x1   << 1  )

/* GPPUL[PUL0] - Pin Pull up enable */
#define GPPUL_PUL0_MSK                 (0x1   << 0  )
#define GPPUL_PUL0                     (0x1   << 0  )
#define GPPUL_PUL0_DIS                 (0x0   << 0  )
#define GPPUL_PUL0_EN                  (0x1   << 0  )

/* GPIN[IN7] - Registered data input */
#define GPIN_IN7_MSK                   (0x1   << 7  )
#define GPIN_IN7                       (0x1   << 7  )
#define GPIN_IN7_LOW                   (0x0   << 7  )
#define GPIN_IN7_HIGH                  (0x1   << 7  )

/* GPIN[IN6] - Registered data input */
#define GPIN_IN6_MSK                   (0x1   << 6  )
#define GPIN_IN6                       (0x1   << 6  )
#define GPIN_IN6_LOW                   (0x0   << 6  )
#define GPIN_IN6_HIGH                  (0x1   << 6  )

/* GPIN[IN5] - Registered data input */
#define GPIN_IN5_MSK                   (0x1   << 5  )
#define GPIN_IN5                       (0x1   << 5  )
#define GPIN_IN5_LOW                   (0x0   << 5  )
#define GPIN_IN5_HIGH                  (0x1   << 5  )

/* GPIN[IN4] - Registered data input */
#define GPIN_IN4_MSK                   (0x1   << 4  )
#define GPIN_IN4                       (0x1   << 4  )
#define GPIN_IN4_LOW                   (0x0   << 4  )
#define GPIN_IN4_HIGH                  (0x1   << 4  )

/* GPIN[IN3] - Registered data input */
#define GPIN_IN3_MSK                   (0x1   << 3  )
#define GPIN_IN3                       (0x1   << 3  )
#define GPIN_IN3_LOW                   (0x0   << 3  )
#define GPIN_IN3_HIGH                  (0x1   << 3  )

/* GPIN[IN2] - Registered data input */
#define GPIN_IN2_MSK                   (0x1   << 2  )
#define GPIN_IN2                       (0x1   << 2  )
#define GPIN_IN2_LOW                   (0x0   << 2  )
#define GPIN_IN2_HIGH                  (0x1   << 2  )

/* GPIN[IN1] - Registered data input */
#define GPIN_IN1_MSK                   (0x1   << 1  )
#define GPIN_IN1                       (0x1   << 1  )
#define GPIN_IN1_LOW                   (0x0   << 1  )
#define GPIN_IN1_HIGH                  (0x1   << 1  )

/* GPIN[IN0] - Registered data input */
#define GPIN_IN0_MSK                   (0x1   << 0  )
#define GPIN_IN0                       (0x1   << 0  )
#define GPIN_IN0_LOW                   (0x0   << 0  )
#define GPIN_IN0_HIGH                  (0x1   << 0  )

/* GPOUT[OUT7] - Data out */
#define GPOUT_OUT7_MSK                 (0x1   << 7  )
#define GPOUT_OUT7                     (0x1   << 7  )
#define GPOUT_OUT7_LOW                 (0x0   << 7  )
#define GPOUT_OUT7_HIGH                (0x1   << 7  )

/* GPOUT[OUT6] - Data out */
#define GPOUT_OUT6_MSK                 (0x1   << 6  )
#define GPOUT_OUT6                     (0x1   << 6  )
#define GPOUT_OUT6_LOW                 (0x0   << 6  )
#define GPOUT_OUT6_HIGH                (0x1   << 6  )

/* GPOUT[OUT5] - Data out */
#define GPOUT_OUT5_MSK                 (0x1   << 5  )
#define GPOUT_OUT5                     (0x1   << 5  )
#define GPOUT_OUT5_LOW                 (0x0   << 5  )
#define GPOUT_OUT5_HIGH                (0x1   << 5  )

