koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm320i.h
/* DACCON[PD] - DAC0 power down */
#define DACCON_PD_MSK                  (0x1   << 8  )
#define DACCON_PD                      (0x1   << 8  )

/* DACCON[EN] - DAC0 enable */
#define DACCON_EN_MSK                  (0x1   << 4  )
#define DACCON_EN                      (0x1   << 4  )

/* DACCON[RN] - DAC0 reference selection */
#define DACCON_RN_MSK                  (0x3   << 0  )

/* DACDAT[DAT] - DAC0 data */
#define DACDAT_DAT_MSK                 (0xFFF << 16 )

/* IDACCON[CLRB] - IDAC0 Clear bit */
#define IDACCON_CLRB_MSK               (0x1   << 7  )
#define IDACCON_CLRB                   (0x1   << 7  )

/* IDACCON[SHT_EN] - IDAC0 shutdown enable */
#define IDACCON_SHT_EN_MSK             (0x1   << 6  )
#define IDACCON_SHT_EN                 (0x1   << 6  )

/* IDACCON[BW] - IDAC0 bandwidth */
#define IDACCON_BW_MSK                 (0xF   << 2  )

/* IDACCON[PUL] - IDAC0 pull down */
#define IDACCON_PUL_MSK                (0x1   << 1  )
#define IDACCON_PUL                    (0x1   << 1  )

/* IDACCON[PD] - IDAC0 power down */
#define IDACCON_PD_MSK                 (0x1   << 0  )
#define IDACCON_PD                     (0x1   << 0  )
#define IDACCON_PD_ON                  (0x0   << 0  ) /* Powers IDAC0 up          */
#define IDACCON_PD_OFF                 (0x1   << 0  ) /* Powers IDAC0 down        */

/* IDACDAT[DATH] - IDAC0 high data */
#define IDACDAT_DATH_MSK               (0x7FF << 17 )

/* IDACDAT[DATL] - IDAC0 low data */
#define IDACDAT_DATL_MSK               (0x1F  << 12 )

/* IDACDAT[SYNC] - IDAC0 sync bits */
#define IDACDAT_SYNC_MSK               (0x3F  << 0  )
// ------------------------------------------------------------------------------------------------
// -----                                        TIMER                                        -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief tmr0 (pADI_TMR0)
  */

#if (__NO_MMR_STRUCTS__==0)
typedef struct {                            /*!< pADI_TMR0 Structure                    */
  __IO uint16_t  TLD;                       /*!< 16-bit load value register            */
  __I  uint16_t  RESERVED0;
  __IO uint16_t  TVAL;                      /*!< 16-bit timer value register           */
  __I  uint16_t  RESERVED1;
  __IO uint16_t  TCON;                      /*!< Control register                      */
  __I  uint16_t  RESERVED2;
  __IO uint16_t  TCLRI;                     /*!< Clear interrupt register              */
  __I  uint16_t  RESERVED3;
  __IO uint16_t  TCAP;                      /*!< Capture register                      */
  __I  uint16_t  RESERVED4[5];
  __IO uint16_t  TSTA;                      /*!< Status register                       */
} ADI_TIMER_TypeDef;
#else // (__NO_MMR_STRUCTS__==0)
#define          T0LD                                       (*(volatile unsigned short int *) 0x40000000)
#define          T0VAL                                      (*(volatile unsigned short int *) 0x40000004)
#define          T0CON                                      (*(volatile unsigned short int *) 0x40000008)
#define          T0CLRI                                     (*(volatile unsigned short int *) 0x4000000C)
#define          T0CAP                                      (*(volatile unsigned short int *) 0x40000010)
#define          T0STA                                      (*(volatile unsigned short int *) 0x4000001C)
#endif // (__NO_MMR_STRUCTS__==0)

/* Reset Value for T0LD*/
#define T0LD_RVAL                      0x0 

/* T0LD[LOAD] - Load value */
#define T0LD_LOAD_MSK                  (0xFFFF << 0  )

/* Reset Value for T0VAL*/
#define T0VAL_RVAL                     0x0 

/* T0VAL[VAL] - Current count */
#define T0VAL_VAL_MSK                  (0xFFFF << 0  )

/* Reset Value for T0CON*/
#define T0CON_RVAL                     0xA 

/* T0CON[EVENTEN] - Event select */
#define T0CON_EVENTEN_BBA              (*(volatile unsigned long *) 0x42000130)
#define T0CON_EVENTEN_MSK              (0x1   << 12 )
#define T0CON_EVENTEN                  (0x1   << 12 )
#define T0CON_EVENTEN_DIS              (0x0   << 12 ) /* Events will not be captured */
#define T0CON_EVENTEN_EN               (0x1   << 12 ) /* Events will be captured  */

/* T0CON[EVENT] - Event select range */
#define T0CON_EVENT_MSK                (0xF   << 8  )

/* T0CON[RLD] - Reload control */
#define T0CON_RLD_BBA                  (*(volatile unsigned long *) 0x4200011C)
#define T0CON_RLD_MSK                  (0x1   << 7  )
#define T0CON_RLD                      (0x1   << 7  )
#define T0CON_RLD_EN                   (0x1   << 7  ) /* Resets the up/down counter when TCLRI[0] is set */
#define T0CON_RLD_DIS                  (0x0   << 7  ) /* Up/Down counter is only reset on a timeout event */

/* T0CON[CLK] - Clock select */
#define T0CON_CLK_MSK                  (0x3   << 5  )
#define T0CON_CLK_PCLK                 (0x0   << 5  ) /* PCLK.                    */
#define T0CON_CLK_HCLK                 (0x1   << 5  ) /* HCLK.                    */
#define T0CON_CLK_LFOSC                (0x2   << 5  ) /* LFOSC. 32 KHz OSC        */
#define T0CON_CLK_HFXTAL               (0x3   << 5  ) /* HFXTAL. 16 MHz OSC or XTAL (Dependent on CLKCON0.11) */

/* T0CON[ENABLE] - Timer enable */
#define T0CON_ENABLE_BBA               (*(volatile unsigned long *) 0x42000110)
#define T0CON_ENABLE_MSK               (0x1   << 4  )
#define T0CON_ENABLE                   (0x1   << 4  )
#define T0CON_ENABLE_DIS               (0x0   << 4  ) /* DIS. Timer is disabled (default) */
#define T0CON_ENABLE_EN                (0x1   << 4  ) /* EN. Timer is enabled     */

/* T0CON[MOD] - Timer mode */
#define T0CON_MOD_BBA                  (*(volatile unsigned long *) 0x4200010C)
#define T0CON_MOD_MSK                  (0x1   << 3  )
#define T0CON_MOD                      (0x1   << 3  )
#define T0CON_MOD_FREERUN              (0x0   << 3  ) /* FREERUN.Timer runs in free running mode */
#define T0CON_MOD_PERIODIC             (0x1   << 3  ) /* PERIODIC. Timer runs in periodic mode (default) */

/* T0CON[UP] - Count up */
#define T0CON_UP_BBA                   (*(volatile unsigned long *) 0x42000108)
#define T0CON_UP_MSK                   (0x1   << 2  )
#define T0CON_UP                       (0x1   << 2  )
#define T0CON_UP_DIS                   (0x0   << 2  ) /* DIS. Timer is set to count down (default) */
#define T0CON_UP_EN                    (0x1   << 2  ) /* EN. Timer is set to count up */

/* T0CON[PRE] - Prescaler */
#define T0CON_PRE_MSK                  (0x3   << 0  )
#define T0CON_PRE_DIV1                 (0x0   << 0  ) /* source_clock / [1 or 4]  */
#define T0CON_PRE_DIV16                (0x1   << 0  ) /* source_clock / 16        */
#define T0CON_PRE_DIV256               (0x2   << 0  ) /* source_clock / 256       */
#define T0CON_PRE_DIV32768             (0x3   << 0  ) /* source_clock / 32,768    */

/* Reset Value for T0CLRI*/
#define T0CLRI_RVAL                    0x0 

