koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm320i.h
/* I2C0SCON[IENSRX] - Slave Receive request interrupt enable */
#define I2C0SCON_IENSRX_BBA            (*(volatile unsigned long *) 0x42060524)
#define I2C0SCON_IENSRX_MSK            (0x1   << 9  )
#define I2C0SCON_IENSRX                (0x1   << 9  )
#define I2C0SCON_IENSRX_DIS            (0x0   << 9  )
#define I2C0SCON_IENSRX_EN             (0x1   << 9  )

/* I2C0SCON[IENSTOP] - Stop condition detected interrupt enable */
#define I2C0SCON_IENSTOP_BBA           (*(volatile unsigned long *) 0x42060520)
#define I2C0SCON_IENSTOP_MSK           (0x1   << 8  )
#define I2C0SCON_IENSTOP               (0x1   << 8  )
#define I2C0SCON_IENSTOP_DIS           (0x0   << 8  )
#define I2C0SCON_IENSTOP_EN            (0x1   << 8  )

/* I2C0SCON[NACK] - NACK next communication */
#define I2C0SCON_NACK_BBA              (*(volatile unsigned long *) 0x4206051C)
#define I2C0SCON_NACK_MSK              (0x1   << 7  )
#define I2C0SCON_NACK                  (0x1   << 7  )
#define I2C0SCON_NACK_DIS              (0x0   << 7  )
#define I2C0SCON_NACK_EN               (0x1   << 7  )

/* I2C0SCON[STRETCHSCL] - Stretch SCL enable */
#define I2C0SCON_STRETCHSCL_BBA        (*(volatile unsigned long *) 0x42060518)
#define I2C0SCON_STRETCHSCL_MSK        (0x1   << 6  )
#define I2C0SCON_STRETCHSCL            (0x1   << 6  )
#define I2C0SCON_STRETCHSCL_DIS        (0x0   << 6  )
#define I2C0SCON_STRETCHSCL_EN         (0x1   << 6  )

/* I2C0SCON[EARLYTXR] - Early transmit request mode */
#define I2C0SCON_EARLYTXR_BBA          (*(volatile unsigned long *) 0x42060514)
#define I2C0SCON_EARLYTXR_MSK          (0x1   << 5  )
#define I2C0SCON_EARLYTXR              (0x1   << 5  )
#define I2C0SCON_EARLYTXR_DIS          (0x0   << 5  )
#define I2C0SCON_EARLYTXR_EN           (0x1   << 5  )

/* I2C0SCON[GCSBCLR] - General call status bit clear */
#define I2C0SCON_GCSBCLR_BBA           (*(volatile unsigned long *) 0x42060510)
#define I2C0SCON_GCSBCLR_MSK           (0x1   << 4  )
#define I2C0SCON_GCSBCLR               (0x1   << 4  )
#define I2C0SCON_GCSBCLR_DIS           (0x0   << 4  )
#define I2C0SCON_GCSBCLR_EN            (0x1   << 4  )

/* I2C0SCON[HGCEN] - Hardware general call enable */
#define I2C0SCON_HGCEN_BBA             (*(volatile unsigned long *) 0x4206050C)
#define I2C0SCON_HGCEN_MSK             (0x1   << 3  )
#define I2C0SCON_HGCEN                 (0x1   << 3  )
#define I2C0SCON_HGCEN_DIS             (0x0   << 3  )
#define I2C0SCON_HGCEN_EN              (0x1   << 3  )

/* I2C0SCON[GCEN] - General call enable */
#define I2C0SCON_GCEN_BBA              (*(volatile unsigned long *) 0x42060508)
#define I2C0SCON_GCEN_MSK              (0x1   << 2  )
#define I2C0SCON_GCEN                  (0x1   << 2  )
#define I2C0SCON_GCEN_DIS              (0x0   << 2  )
#define I2C0SCON_GCEN_EN               (0x1   << 2  )

/* I2C0SCON[ADR10EN] - Enabled 10-bit addressing */
#define I2C0SCON_ADR10EN_BBA           (*(volatile unsigned long *) 0x42060504)
#define I2C0SCON_ADR10EN_MSK           (0x1   << 1  )
#define I2C0SCON_ADR10EN               (0x1   << 1  )
#define I2C0SCON_ADR10EN_DIS           (0x0   << 1  )
#define I2C0SCON_ADR10EN_EN            (0x1   << 1  )

/* I2C0SCON[SLVEN] - Slave enable */
#define I2C0SCON_SLVEN_BBA             (*(volatile unsigned long *) 0x42060500)
#define I2C0SCON_SLVEN_MSK             (0x1   << 0  )
#define I2C0SCON_SLVEN                 (0x1   << 0  )
#define I2C0SCON_SLVEN_DIS             (0x0   << 0  )
#define I2C0SCON_SLVEN_EN              (0x1   << 0  )

/* Reset Value for I2C0SSTA*/
#define I2C0SSTA_RVAL                  0x1 

/* I2C0SSTA[START] - Start and matching address */
#define I2C0SSTA_START_BBA             (*(volatile unsigned long *) 0x420605B8)
#define I2C0SSTA_START_MSK             (0x1   << 14 )
#define I2C0SSTA_START                 (0x1   << 14 )
#define I2C0SSTA_START_CLR             (0x0   << 14 )
#define I2C0SSTA_START_SET             (0x1   << 14 )

/* I2C0SSTA[REPSTART] - Repeated start and matching address */
#define I2C0SSTA_REPSTART_BBA          (*(volatile unsigned long *) 0x420605B4)
#define I2C0SSTA_REPSTART_MSK          (0x1   << 13 )
#define I2C0SSTA_REPSTART              (0x1   << 13 )
#define I2C0SSTA_REPSTART_CLR          (0x0   << 13 )
#define I2C0SSTA_REPSTART_SET          (0x1   << 13 )

/* I2C0SSTA[IDMAT] - Device ID matched */
#define I2C0SSTA_IDMAT_MSK             (0x3   << 11 )

/* I2C0SSTA[STOP] - Stop after start and matching address */
#define I2C0SSTA_STOP_BBA              (*(volatile unsigned long *) 0x420605A8)
#define I2C0SSTA_STOP_MSK              (0x1   << 10 )
#define I2C0SSTA_STOP                  (0x1   << 10 )
#define I2C0SSTA_STOP_CLR              (0x0   << 10 )
#define I2C0SSTA_STOP_SET              (0x1   << 10 )

/* I2C0SSTA[GCID] - General ID */
#define I2C0SSTA_GCID_MSK              (0x3   << 8  )

/* I2C0SSTA[GCINT] - General call interrupt */
#define I2C0SSTA_GCINT_BBA             (*(volatile unsigned long *) 0x4206059C)
#define I2C0SSTA_GCINT_MSK             (0x1   << 7  )
#define I2C0SSTA_GCINT                 (0x1   << 7  )
#define I2C0SSTA_GCINT_CLR             (0x0   << 7  )
#define I2C0SSTA_GCINT_SET             (0x1   << 7  )

/* I2C0SSTA[SBUSY] - Slave busy */
#define I2C0SSTA_SBUSY_BBA             (*(volatile unsigned long *) 0x42060598)
#define I2C0SSTA_SBUSY_MSK             (0x1   << 6  )
#define I2C0SSTA_SBUSY                 (0x1   << 6  )
#define I2C0SSTA_SBUSY_CLR             (0x0   << 6  )
#define I2C0SSTA_SBUSY_SET             (0x1   << 6  )

/* I2C0SSTA[NOACK] - Ack not generated by the slave */
#define I2C0SSTA_NOACK_BBA             (*(volatile unsigned long *) 0x42060594)
#define I2C0SSTA_NOACK_MSK             (0x1   << 5  )
#define I2C0SSTA_NOACK                 (0x1   << 5  )
#define I2C0SSTA_NOACK_CLR             (0x0   << 5  )
#define I2C0SSTA_NOACK_SET             (0x1   << 5  )

/* I2C0SSTA[SRXOF] - Slave Receive FIFO overflow */
#define I2C0SSTA_SRXOF_BBA             (*(volatile unsigned long *) 0x42060590)
#define I2C0SSTA_SRXOF_MSK             (0x1   << 4  )
#define I2C0SSTA_SRXOF                 (0x1   << 4  )
#define I2C0SSTA_SRXOF_CLR             (0x0   << 4  )
#define I2C0SSTA_SRXOF_SET             (0x1   << 4  )

/* I2C0SSTA[SRXREQ] - Slave Receive request */
#define I2C0SSTA_SRXREQ_BBA            (*(volatile unsigned long *) 0x4206058C)
#define I2C0SSTA_SRXREQ_MSK            (0x1   << 3  )
#define I2C0SSTA_SRXREQ                (0x1   << 3  )
#define I2C0SSTA_SRXREQ_CLR            (0x0   << 3  )
#define I2C0SSTA_SRXREQ_SET            (0x1   << 3  )

/* I2C0SSTA[STXREQ] - Slave Transmit request */
#define I2C0SSTA_STXREQ_BBA            (*(volatile unsigned long *) 0x42060588)
#define I2C0SSTA_STXREQ_MSK            (0x1   << 2  )
#define I2C0SSTA_STXREQ                (0x1   << 2  )
#define I2C0SSTA_STXREQ_CLR            (0x0   << 2  )
#define I2C0SSTA_STXREQ_SET            (0x1   << 2  )

/* I2C0SSTA[STXUR] - Slave Transmit FIFO underflow */
#define I2C0SSTA_STXUR_BBA             (*(volatile unsigned long *) 0x42060584)
#define I2C0SSTA_STXUR_MSK             (0x1   << 1  )
#define I2C0SSTA_STXUR                 (0x1   << 1  )
#define I2C0SSTA_STXUR_CLR             (0x0   << 1  )
#define I2C0SSTA_STXUR_SET             (0x1   << 1  )

/* I2C0SSTA[STXFSEREQ] - Slave Tx FIFO Status or early request */
#define I2C0SSTA_STXFSEREQ_BBA         (*(volatile unsigned long *) 0x42060580)
#define I2C0SSTA_STXFSEREQ_MSK         (0x1   << 0  )
#define I2C0SSTA_STXFSEREQ             (0x1   << 0  )
#define I2C0SSTA_STXFSEREQ_CLR         (0x0   << 0  )
#define I2C0SSTA_STXFSEREQ_SET         (0x1   << 0  )

/* Reset Value for I2C0SRX*/
#define I2C0SRX_RVAL                   0x0 

/* I2C0SRX[I2CSRX] - Slave receive register */
#define I2C0SRX_I2CSRX_MSK             (0xFF  << 0  )

/* Reset Value for I2C0STX*/
#define I2C0STX_RVAL                   0x0 

