koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm320i.h
/* I2C0STX[I2CSTX] - Slave transmit register */
#define I2C0STX_I2CSTX_MSK             (0xFF  << 0  )

/* Reset Value for I2C0ALT*/
#define I2C0ALT_RVAL                   0x0 

/* I2C0ALT[ALT] - Slave Alt */
#define I2C0ALT_ALT_MSK                (0xFF  << 0  )

/* Reset Value for I2C0ID0*/
#define I2C0ID0_RVAL                   0x0 

/* I2C0ID0[ID0] - Slave device ID 0 */
#define I2C0ID0_ID0_MSK                (0xFF  << 0  )

/* Reset Value for I2C0ID1*/
#define I2C0ID1_RVAL                   0x0 

/* I2C0ID1[ID1] - Slave device ID 1 */
#define I2C0ID1_ID1_MSK                (0xFF  << 0  )

/* Reset Value for I2C0ID2*/
#define I2C0ID2_RVAL                   0x0 

/* I2C0ID2[ID2] - Slave device ID 2 */
#define I2C0ID2_ID2_MSK                (0xFF  << 0  )

/* Reset Value for I2C0ID3*/
#define I2C0ID3_RVAL                   0x0 

/* I2C0ID3[ID3] - Slave device ID 3 */
#define I2C0ID3_ID3_MSK                (0xFF  << 0  )

/* Reset Value for I2C0FSTA*/
#define I2C0FSTA_RVAL                  0x0 

/* I2C0FSTA[MFLUSH] - Flush the master transmit FIFO */
#define I2C0FSTA_MFLUSH_BBA            (*(volatile unsigned long *) 0x420609A4)
#define I2C0FSTA_MFLUSH_MSK            (0x1   << 9  )
#define I2C0FSTA_MFLUSH                (0x1   << 9  )
#define I2C0FSTA_MFLUSH_DIS            (0x0   << 9  ) /* Clearing to 0 has no effect. */
#define I2C0FSTA_MFLUSH_EN             (0x1   << 9  ) /* Set to 1 to flush the master transmit FIFO. The master transmit FIFO will have to flushed if arbitration is lost or a slave responds with a NACK. */

/* I2C0FSTA[SFLUSH] - Flush the slave transmit FIFO */
#define I2C0FSTA_SFLUSH_BBA            (*(volatile unsigned long *) 0x420609A0)
#define I2C0FSTA_SFLUSH_MSK            (0x1   << 8  )
#define I2C0FSTA_SFLUSH                (0x1   << 8  )
#define I2C0FSTA_SFLUSH_DIS            (0x0   << 8  ) /* Clearing to 0 has no effect. */
#define I2C0FSTA_SFLUSH_EN             (0x1   << 8  ) /* Set to 1 to flush the slave transmit FIFO. */

/* I2C0FSTA[MRXFSTA] - Master receive FIFO status */
#define I2C0FSTA_MRXFSTA_MSK           (0x3   << 6  )
#define I2C0FSTA_MRXFSTA_EMPTY         (0x0   << 6  ) /* FIFO empty               */
#define I2C0FSTA_MRXFSTA_ONEBYTE       (0x1   << 6  ) /* 1 bytes in the FIFO      */
#define I2C0FSTA_MRXFSTA_TWOBYTES      (0x2   << 6  ) /* 2 bytes in the FIFO      */

/* I2C0FSTA[MTXFSTA] - Master transmit FIFO status */
#define I2C0FSTA_MTXFSTA_MSK           (0x3   << 4  )
#define I2C0FSTA_MTXFSTA_EMPTY         (0x0   << 4  ) /* FIFO empty               */
#define I2C0FSTA_MTXFSTA_ONEBYTE       (0x1   << 4  ) /* 1 bytes in the FIFO      */
#define I2C0FSTA_MTXFSTA_TWOBYTES      (0x2   << 4  ) /* 2 bytes in the FIFO      */

/* I2C0FSTA[SRXFSTA] - Slave receive FIFO status */
#define I2C0FSTA_SRXFSTA_MSK           (0x3   << 2  )
#define I2C0FSTA_SRXFSTA_EMPTY         (0x0   << 2  ) /* FIFO empty               */
#define I2C0FSTA_SRXFSTA_ONEBYTE       (0x1   << 2  ) /* 1 bytes in the FIFO      */
#define I2C0FSTA_SRXFSTA_TWOBYTES      (0x2   << 2  ) /* 2 bytes in the FIFO      */

/* I2C0FSTA[STXFSTA] - Slave transmit FIFO status */
#define I2C0FSTA_STXFSTA_MSK           (0x3   << 0  )
#define I2C0FSTA_STXFSTA_EMPTY         (0x0   << 0  ) /* FIFO empty               */
#define I2C0FSTA_STXFSTA_ONEBYTE       (0x1   << 0  ) /* 1 bytes in the FIFO      */
#define I2C0FSTA_STXFSTA_TWOBYTES      (0x2   << 0  ) /* 2 bytes in the FIFO      */

/* Reset Value for I2C0SHCON*/
#define I2C0SHCON_RVAL                 0x0 

/* I2C0SHCON[RESET] - Reset START STOP detect circuit */
#define I2C0SHCON_RESET_BBA            (*(volatile unsigned long *) 0x42060A00)
#define I2C0SHCON_RESET_MSK            (0x1   << 0  )
#define I2C0SHCON_RESET                (0x1   << 0  )
#define I2C0SHCON_RESET_DIS            (0x0   << 0  )
#define I2C0SHCON_RESET_EN             (0x1   << 0  )

/* Reset Value for I2C0ASSCL*/
#define I2C0ASSCL_RVAL                 0x0 

/* I2C0ASSCL[SSRTSTA] - stretch timeout for slave */
#define I2C0ASSCL_SSRTSTA_BBA          (*(volatile unsigned long *) 0x42060B24)
#define I2C0ASSCL_SSRTSTA_MSK          (0x1   << 9  )
#define I2C0ASSCL_SSRTSTA              (0x1   << 9  )
#define I2C0ASSCL_SSRTSTA_DIS          (0x0   << 9  )
#define I2C0ASSCL_SSRTSTA_EN           (0x1   << 9  )

/* I2C0ASSCL[MSRTSTA] - stretch timeout for master */
#define I2C0ASSCL_MSRTSTA_BBA          (*(volatile unsigned long *) 0x42060B20)
#define I2C0ASSCL_MSRTSTA_MSK          (0x1   << 8  )
#define I2C0ASSCL_MSRTSTA              (0x1   << 8  )
#define I2C0ASSCL_MSRTSTA_DIS          (0x0   << 8  )
#define I2C0ASSCL_MSRTSTA_EN           (0x1   << 8  )

/* I2C0ASSCL[SSTRCON] - automatic stretch mode for slave */
#define I2C0ASSCL_SSTRCON_MSK          (0xF   << 4  )

/* I2C0ASSCL[MSTRCON] - automatic stretch mode for master */
#define I2C0ASSCL_MSTRCON_MSK          (0xF   << 0  )
#if (__NO_MMR_STRUCTS__==1)

#define          I2C1MCON                                   (*(volatile unsigned short int *) 0x40003400)
#define          I2C1MSTA                                   (*(volatile unsigned short int *) 0x40003404)
#define          I2C1MRX                                    (*(volatile unsigned short int *) 0x40003408)
#define          I2C1MTX                                    (*(volatile unsigned short int *) 0x4000340C)
#define          I2C1MRXCNT                                 (*(volatile unsigned short int *) 0x40003410)
#define          I2C1MCRXCNT                                (*(volatile unsigned short int *) 0x40003414)
#define          I2C1ADR0                                   (*(volatile unsigned short int *) 0x40003418)
#define          I2C1ADR1                                   (*(volatile unsigned short int *) 0x4000341C)
#define          I2C1DIV                                    (*(volatile unsigned short int *) 0x40003424)
#define          I2C1SCON                                   (*(volatile unsigned short int *) 0x40003428)
#define          I2C1SSTA                                   (*(volatile unsigned short int *) 0x4000342C)
#define          I2C1SRX                                    (*(volatile unsigned short int *) 0x40003430)
#define          I2C1STX                                    (*(volatile unsigned short int *) 0x40003434)
#define          I2C1ALT                                    (*(volatile unsigned short int *) 0x40003438)
#define          I2C1ID0                                    (*(volatile unsigned short int *) 0x4000343C)
#define          I2C1ID1                                    (*(volatile unsigned short int *) 0x40003440)
#define          I2C1ID2                                    (*(volatile unsigned short int *) 0x40003444)
#define          I2C1ID3                                    (*(volatile unsigned short int *) 0x40003448)
#define          I2C1FSTA                                   (*(volatile unsigned short int *) 0x4000344C)
#define          I2C1SHCON                                  (*(volatile unsigned short int *) 0x40003450)
#define          I2C1ASSCL                                  (*(volatile unsigned short int *) 0x40003458)
#endif // (__NO_MMR_STRUCTS__==1)

/* Reset Value for I2C1MCON*/
#define I2C1MCON_RVAL                  0x0 

