koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm320i.h
/* I2C1MCON[PRESTOP_BUS_CLR] - Prestop Bus-Clear */
#define I2C1MCON_PRESTOP_BUS_CLR_BBA   (*(volatile unsigned long *) 0x42068034)
#define I2C1MCON_PRESTOP_BUS_CLR_MSK   (0x1   << 13 )
#define I2C1MCON_PRESTOP_BUS_CLR       (0x1   << 13 )
#define I2C1MCON_PRESTOP_BUS_CLR_DIS   (0x0   << 13 )
#define I2C1MCON_PRESTOP_BUS_CLR_EN    (0x1   << 13 )

/* I2C1MCON[BUS_CLR_EN] - Bus-Clear Enable */
#define I2C1MCON_BUS_CLR_EN_BBA        (*(volatile unsigned long *) 0x42068030)
#define I2C1MCON_BUS_CLR_EN_MSK        (0x1   << 12 )
#define I2C1MCON_BUS_CLR_EN            (0x1   << 12 )
#define I2C1MCON_BUS_CLR_EN_DIS        (0x0   << 12 )
#define I2C1MCON_BUS_CLR_EN_EN         (0x1   << 12 )

/* I2C1MCON[MTXDMA] - Enable master Tx DMA request */
#define I2C1MCON_MTXDMA_BBA            (*(volatile unsigned long *) 0x4206802C)
#define I2C1MCON_MTXDMA_MSK            (0x1   << 11 )
#define I2C1MCON_MTXDMA                (0x1   << 11 )
#define I2C1MCON_MTXDMA_DIS            (0x0   << 11 ) /* Disable DMA mode         */
#define I2C1MCON_MTXDMA_EN             (0x1   << 11 ) /* Enable I2C master DMA Tx requests. */

/* I2C1MCON[MRXDMA] - Enable master Rx DMA request */
#define I2C1MCON_MRXDMA_BBA            (*(volatile unsigned long *) 0x42068028)
#define I2C1MCON_MRXDMA_MSK            (0x1   << 10 )
#define I2C1MCON_MRXDMA                (0x1   << 10 )
#define I2C1MCON_MRXDMA_DIS            (0x0   << 10 ) /* Disable DMA mode         */
#define I2C1MCON_MRXDMA_EN             (0x1   << 10 ) /* Enable I2C master DMA Rx requests. */

/* I2C1MCON[MXMITDEC] - Decrement master TX FIFO status when a byte has been transmitted */
#define I2C1MCON_MXMITDEC_BBA          (*(volatile unsigned long *) 0x42068024)
#define I2C1MCON_MXMITDEC_MSK          (0x1   << 9  )
#define I2C1MCON_MXMITDEC              (0x1   << 9  )
#define I2C1MCON_MXMITDEC_DIS          (0x0   << 9  )
#define I2C1MCON_MXMITDEC_EN           (0x1   << 9  )

/* I2C1MCON[IENCMP] - Transaction completed (or stop detected) interrupt enable */
#define I2C1MCON_IENCMP_BBA            (*(volatile unsigned long *) 0x42068020)
#define I2C1MCON_IENCMP_MSK            (0x1   << 8  )
#define I2C1MCON_IENCMP                (0x1   << 8  )
#define I2C1MCON_IENCMP_DIS            (0x0   << 8  ) /* An interrupt is not generated when a STOP is detected. */
#define I2C1MCON_IENCMP_EN             (0x1   << 8  ) /* An interrupt is generated when a STOP is detected. */

/* I2C1MCON[IENACK] - ACK not received interrupt enable */
#define I2C1MCON_IENACK_BBA            (*(volatile unsigned long *) 0x4206801C)
#define I2C1MCON_IENACK_MSK            (0x1   << 7  )
#define I2C1MCON_IENACK                (0x1   << 7  )
#define I2C1MCON_IENACK_DIS            (0x0   << 7  ) /* ACK not received interrupt disable */
#define I2C1MCON_IENACK_EN             (0x1   << 7  ) /* ACK not received interrupt enable */

/* I2C1MCON[IENALOST] - Arbitration lost interrupt enable */
#define I2C1MCON_IENALOST_BBA          (*(volatile unsigned long *) 0x42068018)
#define I2C1MCON_IENALOST_MSK          (0x1   << 6  )
#define I2C1MCON_IENALOST              (0x1   << 6  )
#define I2C1MCON_IENALOST_DIS          (0x0   << 6  ) /* Arbitration lost interrupt disable */
#define I2C1MCON_IENALOST_EN           (0x1   << 6  ) /* Arbitration lost interrupt enable */

/* I2C1MCON[IENMTX] - Transmit request interrupt enable. */
#define I2C1MCON_IENMTX_BBA            (*(volatile unsigned long *) 0x42068014)
#define I2C1MCON_IENMTX_MSK            (0x1   << 5  )
#define I2C1MCON_IENMTX                (0x1   << 5  )
#define I2C1MCON_IENMTX_DIS            (0x0   << 5  ) /* Transmit request interrupt disable */
#define I2C1MCON_IENMTX_EN             (0x1   << 5  ) /* Transmit request interrupt enable */

/* I2C1MCON[IENMRX] - Receive request interrupt enable */
#define I2C1MCON_IENMRX_BBA            (*(volatile unsigned long *) 0x42068010)
#define I2C1MCON_IENMRX_MSK            (0x1   << 4  )
#define I2C1MCON_IENMRX                (0x1   << 4  )
#define I2C1MCON_IENMRX_DIS            (0x0   << 4  ) /* Receive request interrupt disable */
#define I2C1MCON_IENMRX_EN             (0x1   << 4  ) /* Receive request interrupt enable */

/* I2C1MCON[STRETCH] - Stretch SCL enable */
#define I2C1MCON_STRETCH_BBA           (*(volatile unsigned long *) 0x4206800C)
#define I2C1MCON_STRETCH_MSK           (0x1   << 3  )
#define I2C1MCON_STRETCH               (0x1   << 3  )
#define I2C1MCON_STRETCH_DIS           (0x0   << 3  ) /* Disable Clock stretching */
#define I2C1MCON_STRETCH_EN            (0x1   << 3  ) /* Setting this bit tells the device if SCL is 0 hold it at 0;. Or if SCL is 1 then when it next goes to 0 hold it at 0. */

/* I2C1MCON[LOOPBACK] - Internal loopback enable */
#define I2C1MCON_LOOPBACK_BBA          (*(volatile unsigned long *) 0x42068008)
#define I2C1MCON_LOOPBACK_MSK          (0x1   << 2  )
#define I2C1MCON_LOOPBACK              (0x1   << 2  )
#define I2C1MCON_LOOPBACK_DIS          (0x0   << 2  ) /* SCL and SDA out of the device are not muxed onto their corresponding inputs. */
#define I2C1MCON_LOOPBACK_EN           (0x1   << 2  ) /* SCL and SDA out of the device are muxed onto their corresponding inputs. */

/* I2C1MCON[COMPETE] - Start back-off disable */
#define I2C1MCON_COMPETE_BBA           (*(volatile unsigned long *) 0x42068004)
#define I2C1MCON_COMPETE_MSK           (0x1   << 1  )
#define I2C1MCON_COMPETE               (0x1   << 1  )
#define I2C1MCON_COMPETE_DIS           (0x0   << 1  )
#define I2C1MCON_COMPETE_EN            (0x1   << 1  )

/* I2C1MCON[MASEN] - Master enable */
#define I2C1MCON_MASEN_BBA             (*(volatile unsigned long *) 0x42068000)
#define I2C1MCON_MASEN_MSK             (0x1   << 0  )
#define I2C1MCON_MASEN                 (0x1   << 0  )
#define I2C1MCON_MASEN_DIS             (0x0   << 0  ) /* Master is disabled       */
#define I2C1MCON_MASEN_EN              (0x1   << 0  ) /* Master is enabled        */

/* Reset Value for I2C1MSTA*/
#define I2C1MSTA_RVAL                  0x6000 

/* I2C1MSTA[SCL_FILTERED] - State of SCL Line */
#define I2C1MSTA_SCL_FILTERED_BBA      (*(volatile unsigned long *) 0x420680B8)
#define I2C1MSTA_SCL_FILTERED_MSK      (0x1   << 14 )
#define I2C1MSTA_SCL_FILTERED          (0x1   << 14 )
#define I2C1MSTA_SCL_FILTERED_CLR      (0x0   << 14 )
#define I2C1MSTA_SCL_FILTERED_SET      (0x1   << 14 )

/* I2C1MSTA[SDA_FILTERED] - State of SDA Line */
#define I2C1MSTA_SDA_FILTERED_BBA      (*(volatile unsigned long *) 0x420680B4)
#define I2C1MSTA_SDA_FILTERED_MSK      (0x1   << 13 )
#define I2C1MSTA_SDA_FILTERED          (0x1   << 13 )
#define I2C1MSTA_SDA_FILTERED_CLR      (0x0   << 13 )
#define I2C1MSTA_SDA_FILTERED_SET      (0x1   << 13 )

