koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm320i.h
/* COMFBR[DIVM] - Fractional baud rate M divide bits 1 to 3 */
#define COMFBR_DIVM_MSK                (0x3   << 11 )

/* COMFBR[DIVN] - Fractional baud rate N divide bits 0 to 2047. */
#define COMFBR_DIVN_MSK                (0x7FF << 0  )

/* Reset Value for COMDIV*/
#define COMDIV_RVAL                    0x1 

/* COMDIV[DIV] - Baud rate divider */
#define COMDIV_DIV_MSK                 (0xFFFF << 0  )
// ------------------------------------------------------------------------------------------------
// -----                                        MDIO                                        -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief MDIO (pADI_MDIO)
  */

#if (__NO_MMR_STRUCTS__==0)
typedef struct {                            /*!< pADI_MDIO Structure                    */
  __IO uint16_t  MDCON;                     /*!< MDIO block control                    */
  __I  uint16_t  RESERVED0;
  __IO uint16_t  MDFRM;                     /*!< MDIO received frame control information */
  __I  uint16_t  RESERVED1;
  __IO uint16_t  MDRXD;                     /*!< MDIO received data                    */
  __I  uint16_t  RESERVED2;
  __IO uint16_t  MDADR;                     /*!< MDIO received address                 */
  __I  uint16_t  RESERVED3;
  __IO uint16_t  MDTXD;                     /*!< MDIO data for transmission            */
  __I  uint16_t  RESERVED4;
  __IO uint16_t  MDPHY;                     /*!< MDIO PHYADDR software values and selection and DEVADD */
  __I  uint16_t  RESERVED5;
  __IO uint16_t  MDSTA;                     /*!< MDIO progress signaling through frame */
  __I  uint16_t  RESERVED6;
  __IO uint16_t  MDIEN;                     /*!< MDIO interrupt enables                */
  __I  uint16_t  RESERVED7;
  __IO uint16_t  MDPIN;                     /*!< MDIO read PHYADDR pins                */
} ADI_MDIO_TypeDef;
#else // (__NO_MMR_STRUCTS__==0)
#define          MDCON                                      (*(volatile unsigned short int *) 0x40005C00)
#define          MDFRM                                      (*(volatile unsigned short int *) 0x40005C04)
#define          MDRXD                                      (*(volatile unsigned short int *) 0x40005C08)
#define          MDADR                                      (*(volatile unsigned short int *) 0x40005C0C)
#define          MDTXD                                      (*(volatile unsigned short int *) 0x40005C10)
#define          MDPHY                                      (*(volatile unsigned short int *) 0x40005C14)
#define          MDSTA                                      (*(volatile unsigned short int *) 0x40005C18)
#define          MDIEN                                      (*(volatile unsigned short int *) 0x40005C1C)
#define          MDPIN                                      (*(volatile unsigned short int *) 0x40005C20)
#endif // (__NO_MMR_STRUCTS__==0)

/* Reset Value for MDCON*/
#define MDCON_RVAL                     0x0 

/* MDCON[MD_DRV] -  */
#define MDCON_MD_DRV_BBA               (*(volatile unsigned long *) 0x420B8008)
#define MDCON_MD_DRV_MSK               (0x1   << 2  )
#define MDCON_MD_DRV                   (0x1   << 2  )
#define MDCON_MD_DRV_MD_DRV_OD         (0x0   << 2  ) /* MDIO drive open drain.   */
#define MDCON_MD_DRV_MD_DRV_PP         (0x1   << 2  ) /* MDIO drive push-pull.    */

/* MDCON[MD_PHM] -  */
#define MDCON_MD_PHM_BBA               (*(volatile unsigned long *) 0x420B8004)
#define MDCON_MD_PHM_MSK               (0x1   << 1  )
#define MDCON_MD_PHM                   (0x1   << 1  )

/* MDCON[MD_RST] -  */
#define MDCON_MD_RST_BBA               (*(volatile unsigned long *) 0x420B8000)
#define MDCON_MD_RST_MSK               (0x1   << 0  )
#define MDCON_MD_RST                   (0x1   << 0  )
#define MDCON_MD_RST_DIS               (0x0   << 0  )
#define MDCON_MD_RST_EN                (0x1   << 0  )

/* Reset Value for MDFRM*/
#define MDFRM_RVAL                     0x0 

/* MDFRM[MD_DEV] -  */
#define MDFRM_MD_DEV_MSK               (0x1F  << 7  )

/* MDFRM[MD_PHY] -  */
#define MDFRM_MD_PHY_MSK               (0x1F  << 2  )

/* MDFRM[MD_OP] -  */
#define MDFRM_MD_OP_MSK                (0x3   << 0  )
#define MDFRM_MD_OP_MD_OP_ADF          (0x0   << 0  ) /* Address frame.           */
#define MDFRM_MD_OP_MD_OP_WRF          (0x1   << 0  ) /* Write frame.             */
#define MDFRM_MD_OP_MD_OP_INCF         (0x2   << 0  ) /* PostReadIncAdd frame.    */
#define MDFRM_MD_OP_MD_OP_RDF          (0x3   << 0  ) /* Read frame.              */

/* Reset Value for MDRXD*/
#define MDRXD_RVAL                     0x0 

/* MDRXD[MD_RXD] -  */
#define MDRXD_MD_RXD_MSK               (0xFFFF << 0  )

/* Reset Value for MDADR*/
#define MDADR_RVAL                     0x0 

/* MDADR[MD_ADR] -  */
#define MDADR_MD_ADR_MSK               (0xFFFF << 0  )

/* Reset Value for MDTXD*/
#define MDTXD_RVAL                     0x0 

/* MDTXD[MD_TXD] -  */
#define MDTXD_MD_TXD_MSK               (0xFFFF << 0  )

/* Reset Value for MDPHY*/
#define MDPHY_RVAL                     0x400 

/* MDPHY[MD_DEVADD] -  */
#define MDPHY_MD_DEVADD_MSK            (0x1F  << 10 )

/* MDPHY[MD_PHYSEL] -  */
#define MDPHY_MD_PHYSEL_MSK            (0x1F  << 5  )

/* MDPHY[MD_PHYSW] -  */
#define MDPHY_MD_PHYSW_MSK             (0x1F  << 0  )

/* Reset Value for MDSTA*/
#define MDSTA_RVAL                     0x0 

/* MDSTA[MD_PHYN] -  */
#define MDSTA_MD_PHYN_BBA              (*(volatile unsigned long *) 0x420B831C)
#define MDSTA_MD_PHYN_MSK              (0x1   << 7  )
#define MDSTA_MD_PHYN                  (0x1   << 7  )
#define MDSTA_MD_PHYN_DIS              (0x0   << 7  )
#define MDSTA_MD_PHYN_EN               (0x1   << 7  )

/* MDSTA[MD_PHYM] -  */
#define MDSTA_MD_PHYM_BBA              (*(volatile unsigned long *) 0x420B8318)
#define MDSTA_MD_PHYM_MSK              (0x1   << 6  )
#define MDSTA_MD_PHYM                  (0x1   << 6  )
#define MDSTA_MD_PHYM_DIS              (0x0   << 6  )
#define MDSTA_MD_PHYM_EN               (0x1   << 6  )

/* MDSTA[MD_DEVN] -  */
#define MDSTA_MD_DEVN_BBA              (*(volatile unsigned long *) 0x420B8314)
#define MDSTA_MD_DEVN_MSK              (0x1   << 5  )
#define MDSTA_MD_DEVN                  (0x1   << 5  )
#define MDSTA_MD_DEVN_DIS              (0x0   << 5  )
#define MDSTA_MD_DEVN_EN               (0x1   << 5  )

/* MDSTA[MD_DEVM] -  */
#define MDSTA_MD_DEVM_BBA              (*(volatile unsigned long *) 0x420B8310)
#define MDSTA_MD_DEVM_MSK              (0x1   << 4  )
#define MDSTA_MD_DEVM                  (0x1   << 4  )
#define MDSTA_MD_DEVM_DIS              (0x0   << 4  )
#define MDSTA_MD_DEVM_EN               (0x1   << 4  )

/* MDSTA[MD_RDF] -  */
#define MDSTA_MD_RDF_BBA               (*(volatile unsigned long *) 0x420B830C)
#define MDSTA_MD_RDF_MSK               (0x1   << 3  )
#define MDSTA_MD_RDF                   (0x1   << 3  )
#define MDSTA_MD_RDF_DIS               (0x0   << 3  )
#define MDSTA_MD_RDF_EN                (0x1   << 3  )

/* MDSTA[MD_INCF] -  */
#define MDSTA_MD_INCF_BBA              (*(volatile unsigned long *) 0x420B8308)
#define MDSTA_MD_INCF_MSK              (0x1   << 2  )
#define MDSTA_MD_INCF                  (0x1   << 2  )
#define MDSTA_MD_INCF_DIS              (0x0   << 2  )
#define MDSTA_MD_INCF_EN               (0x1   << 2  )

/* MDSTA[MD_ADRF] -  */
#define MDSTA_MD_ADRF_BBA              (*(volatile unsigned long *) 0x420B8304)
#define MDSTA_MD_ADRF_MSK              (0x1   << 1  )
#define MDSTA_MD_ADRF                  (0x1   << 1  )
#define MDSTA_MD_ADRF_DIS              (0x0   << 1  )
#define MDSTA_MD_ADRF_EN               (0x1   << 1  )

/* MDSTA[MD_WRF] -  */
#define MDSTA_MD_WRF_BBA               (*(volatile unsigned long *) 0x420B8300)
#define MDSTA_MD_WRF_MSK               (0x1   << 0  )
#define MDSTA_MD_WRF                   (0x1   << 0  )
#define MDSTA_MD_WRF_DIS               (0x0   << 0  )
#define MDSTA_MD_WRF_EN                (0x1   << 0  )

/* Reset Value for MDIEN*/
#define MDIEN_RVAL                     0x0 

