koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm320i.h
/* MDIEN[MD_PHYNI] -  */
#define MDIEN_MD_PHYNI_BBA             (*(volatile unsigned long *) 0x420B839C)
#define MDIEN_MD_PHYNI_MSK             (0x1   << 7  )
#define MDIEN_MD_PHYNI                 (0x1   << 7  )
#define MDIEN_MD_PHYNI_DIS             (0x0   << 7  )
#define MDIEN_MD_PHYNI_EN              (0x1   << 7  )

/* MDIEN[MD_PHYMI] -  */
#define MDIEN_MD_PHYMI_BBA             (*(volatile unsigned long *) 0x420B8398)
#define MDIEN_MD_PHYMI_MSK             (0x1   << 6  )
#define MDIEN_MD_PHYMI                 (0x1   << 6  )
#define MDIEN_MD_PHYMI_DIS             (0x0   << 6  )
#define MDIEN_MD_PHYMI_EN              (0x1   << 6  )

/* MDIEN[MD_DEVNI] -  */
#define MDIEN_MD_DEVNI_BBA             (*(volatile unsigned long *) 0x420B8394)
#define MDIEN_MD_DEVNI_MSK             (0x1   << 5  )
#define MDIEN_MD_DEVNI                 (0x1   << 5  )
#define MDIEN_MD_DEVNI_DIS             (0x0   << 5  )
#define MDIEN_MD_DEVNI_EN              (0x1   << 5  )

/* MDIEN[MD_DEVMI] -  */
#define MDIEN_MD_DEVMI_BBA             (*(volatile unsigned long *) 0x420B8390)
#define MDIEN_MD_DEVMI_MSK             (0x1   << 4  )
#define MDIEN_MD_DEVMI                 (0x1   << 4  )
#define MDIEN_MD_DEVMI_DIS             (0x0   << 4  )
#define MDIEN_MD_DEVMI_EN              (0x1   << 4  )

/* MDIEN[MD_RDFI] -  */
#define MDIEN_MD_RDFI_BBA              (*(volatile unsigned long *) 0x420B838C)
#define MDIEN_MD_RDFI_MSK              (0x1   << 3  )
#define MDIEN_MD_RDFI                  (0x1   << 3  )
#define MDIEN_MD_RDFI_DIS              (0x0   << 3  )
#define MDIEN_MD_RDFI_EN               (0x1   << 3  )

/* MDIEN[MD_INCFI] -  */
#define MDIEN_MD_INCFI_BBA             (*(volatile unsigned long *) 0x420B8388)
#define MDIEN_MD_INCFI_MSK             (0x1   << 2  )
#define MDIEN_MD_INCFI                 (0x1   << 2  )
#define MDIEN_MD_INCFI_DIS             (0x0   << 2  )
#define MDIEN_MD_INCFI_EN              (0x1   << 2  )

/* MDIEN[MD_ADRI] -  */
#define MDIEN_MD_ADRI_BBA              (*(volatile unsigned long *) 0x420B8384)
#define MDIEN_MD_ADRI_MSK              (0x1   << 1  )
#define MDIEN_MD_ADRI                  (0x1   << 1  )
#define MDIEN_MD_ADRI_DIS              (0x0   << 1  )
#define MDIEN_MD_ADRI_EN               (0x1   << 1  )

/* MDIEN[MD_WRFI] -  */
#define MDIEN_MD_WRFI_BBA              (*(volatile unsigned long *) 0x420B8380)
#define MDIEN_MD_WRFI_MSK              (0x1   << 0  )
#define MDIEN_MD_WRFI                  (0x1   << 0  )
#define MDIEN_MD_WRFI_DIS              (0x0   << 0  )
#define MDIEN_MD_WRFI_EN               (0x1   << 0  )

/* Reset Value for MDPIN*/
#define MDPIN_RVAL                     0x0 

/* MDPIN[MD_PIN] -  */
#define MDPIN_MD_PIN_MSK               (0x1F  << 0  )
// ------------------------------------------------------------------------------------------------
// -----                                        PLA                                        -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief PLA (pADI_PLA)
  */

#if (__NO_MMR_STRUCTS__==0)
typedef struct {                            /*!< pADI_PLA Structure                     */
  __IO uint32_t  PLA_ELEM[32];              /*!< ELEMx Configuration Register          */
  __IO uint16_t  PLA_CLK;                   /*!< PLA Clock Select                      */
  __I  uint16_t  RESERVED0;
  __IO uint16_t  PLA_IRQ0;                  /*!< Interrupt Register for Block 0 and 1  */
  __I  uint16_t  RESERVED1;
  __IO uint16_t  PLA_IRQ1;                  /*!< Interrupt Register for Block 2 and 3  */
  __I  uint16_t  RESERVED2;
  __IO uint16_t  PLA_ADC;                   /*!< ADC Configuration Register            */
  __I  uint16_t  RESERVED3;
  __IO uint16_t  PLA_DIN0;                  /*!< AMBA Bus Data Input for Block 0 and 1 */
  __I  uint16_t  RESERVED4[3];
  __IO uint16_t  PLA_DOUT0;                 /*!< AMBA Bus Data Output for Block 0 and 1 */
  __I  uint16_t  RESERVED5;
  __IO uint16_t  PLA_DOUT1;                 /*!< AMBA Bus Data Output for Block 2 and 3 */
  __I  uint16_t  RESERVED6;
  __IO uint16_t  PLA_LCK;                   /*!< Write lock Register. Can only be set once every reset */
  __I  uint16_t  RESERVED7;
  __IO uint16_t  PLA_PROBE_I2C;             /*!< PLA GPIO INPUT can be switched to probe I2C SCL/SDA */
} ADI_PLA_TypeDef;
#else // (__NO_MMR_STRUCTS__==0)
#define          PLA_ELEM0                                  (*(volatile unsigned short int *) 0x40005800)
#define          PLA_ELEM1                                  (*(volatile unsigned short int *) 0x40005804)
#define          PLA_ELEM2                                  (*(volatile unsigned short int *) 0x40005808)
#define          PLA_ELEM3                                  (*(volatile unsigned short int *) 0x4000580C)
#define          PLA_ELEM4                                  (*(volatile unsigned short int *) 0x40005810)
#define          PLA_ELEM5                                  (*(volatile unsigned short int *) 0x40005814)
#define          PLA_ELEM6                                  (*(volatile unsigned short int *) 0x40005818)
#define          PLA_ELEM7                                  (*(volatile unsigned short int *) 0x4000581C)
#define          PLA_ELEM8                                  (*(volatile unsigned short int *) 0x40005820)
#define          PLA_ELEM9                                  (*(volatile unsigned short int *) 0x40005824)
#define          PLA_ELEM10                                 (*(volatile unsigned short int *) 0x40005828)
#define          PLA_ELEM11                                 (*(volatile unsigned short int *) 0x4000582C)
#define          PLA_ELEM12                                 (*(volatile unsigned short int *) 0x40005830)
#define          PLA_ELEM13                                 (*(volatile unsigned short int *) 0x40005834)
#define          PLA_ELEM14                                 (*(volatile unsigned short int *) 0x40005838)
#define          PLA_ELEM15                                 (*(volatile unsigned short int *) 0x4000583C)
#define          PLA_ELEM16                                 (*(volatile unsigned short int *) 0x40005840)
#define          PLA_ELEM17                                 (*(volatile unsigned short int *) 0x40005844)
#define          PLA_ELEM18                                 (*(volatile unsigned short int *) 0x40005848)
#define          PLA_ELEM19                                 (*(volatile unsigned short int *) 0x4000584C)
#define          PLA_ELEM20                                 (*(volatile unsigned short int *) 0x40005850)
#define          PLA_ELEM21                                 (*(volatile unsigned short int *) 0x40005854)
#define          PLA_ELEM22                                 (*(volatile unsigned short int *) 0x40005858)
#define          PLA_ELEM23                                 (*(volatile unsigned short int *) 0x4000585C)
#define          PLA_ELEM24                                 (*(volatile unsigned short int *) 0x40005860)
#define          PLA_ELEM25                                 (*(volatile unsigned short int *) 0x40005864)
#define          PLA_ELEM26                                 (*(volatile unsigned short int *) 0x40005868)
#define          PLA_ELEM27                                 (*(volatile unsigned short int *) 0x4000586C)
#define          PLA_ELEM28                                 (*(volatile unsigned short int *) 0x40005870)
#define          PLA_ELEM29                                 (*(volatile unsigned short int *) 0x40005874)
#define          PLA_ELEM30                                 (*(volatile unsigned short int *) 0x40005878)
#define          PLA_ELEM31                                 (*(volatile unsigned short int *) 0x4000587C)
#define          PLA_CLK                                    (*(volatile unsigned short int *) 0x40005880)
#define          PLA_IRQ0                                   (*(volatile unsigned short int *) 0x40005884)
#define          PLA_IRQ1                                   (*(volatile unsigned short int *) 0x40005888)
#define          PLA_ADC                                    (*(volatile unsigned short int *) 0x4000588C)
#define          PLA_DIN0                                   (*(volatile unsigned short int *) 0x40005890)
#define          PLA_DOUT0                                  (*(volatile unsigned short int *) 0x40005898)
#define          PLA_DOUT1                                  (*(volatile unsigned short int *) 0x4000589C)
#define          PLA_LCK                                    (*(volatile unsigned short int *) 0x400058A0)
#define          PLA_PROBE_I2C                              (*(volatile unsigned short int *) 0x400058A4)
#endif // (__NO_MMR_STRUCTS__==0)

/* Reset Value for PLA_ELEM*/
#define PLA_ELEM_RVAL                  0x0 

