koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm320i.h
/* PLA_DOUT1[E17] - Output bit from Element 17 */
#define PLA_DOUT1_E17_BBA              (*(volatile unsigned long *) 0x420B1384)
#define PLA_DOUT1_E17_MSK              (0x1   << 1  )
#define PLA_DOUT1_E17                  (0x1   << 1  )
#define PLA_DOUT1_E17_CLR              (0x0   << 1  )
#define PLA_DOUT1_E17_SET              (0x1   << 1  )

/* PLA_DOUT1[E16] - Output bit from Element 16 */
#define PLA_DOUT1_E16_BBA              (*(volatile unsigned long *) 0x420B1380)
#define PLA_DOUT1_E16_MSK              (0x1   << 0  )
#define PLA_DOUT1_E16                  (0x1   << 0  )
#define PLA_DOUT1_E16_CLR              (0x0   << 0  )
#define PLA_DOUT1_E16_SET              (0x1   << 0  )

/* Reset Value for PLA_LCK*/
#define PLA_LCK_RVAL                   0x0 

/* PLA_LCK[LOCK] - Set to disable writing to registers */
#define PLA_LCK_LOCK_BBA               (*(volatile unsigned long *) 0x420B1400)
#define PLA_LCK_LOCK_MSK               (0x1   << 0  )
#define PLA_LCK_LOCK                   (0x1   << 0  )
#define PLA_LCK_LOCK_DIS               (0x0   << 0  ) /* Writing to registers allowed */
#define PLA_LCK_LOCK_EN                (0x1   << 0  ) /* Writing to registers disabled */

/* Reset Value for PLA_PROBE_I2C*/
#define PLA_PROBE_I2C_RVAL             0x0 

/* PLA_PROBE_I2C[ELEM3] - Connects either GPIO or I2C as the GPIO input to BLOCK 0 element 3 */
#define PLA_PROBE_I2C_ELEM3_BBA        (*(volatile unsigned long *) 0x420B148C)
#define PLA_PROBE_I2C_ELEM3_MSK        (0x1   << 3  )
#define PLA_PROBE_I2C_ELEM3            (0x1   << 3  )
#define PLA_PROBE_I2C_ELEM3_P0_3       (0x0   << 3  ) /* PLA PROBE GPIO P0.3      */
#define PLA_PROBE_I2C_ELEM3_I2C1_SDA   (0x1   << 3  ) /* PLA PROBE I2C1_SDA       */

/* PLA_PROBE_I2C[ELEM2] - Connects either GPIO or I2C as the GPIO input to BLOCK 0 element 2 */
#define PLA_PROBE_I2C_ELEM2_BBA        (*(volatile unsigned long *) 0x420B1488)
#define PLA_PROBE_I2C_ELEM2_MSK        (0x1   << 2  )
#define PLA_PROBE_I2C_ELEM2            (0x1   << 2  )
#define PLA_PROBE_I2C_ELEM2_P0_2       (0x0   << 2  ) /* PLA PROBE GPIO P0.2      */
#define PLA_PROBE_I2C_ELEM2_I2C1_SCL   (0x1   << 2  ) /* PLA PROBE I2C1_SCL       */

/* PLA_PROBE_I2C[ELEM1] - Connects either GPIO or I2C as the GPIO input to BLOCK 0 element 1 */
#define PLA_PROBE_I2C_ELEM1_BBA        (*(volatile unsigned long *) 0x420B1484)
#define PLA_PROBE_I2C_ELEM1_MSK        (0x1   << 1  )
#define PLA_PROBE_I2C_ELEM1            (0x1   << 1  )
#define PLA_PROBE_I2C_ELEM1_P0_1       (0x0   << 1  ) /* PLA PROBE GPIO P0.1      */
#define PLA_PROBE_I2C_ELEM1_I2C0_SDA   (0x1   << 1  ) /* PLA PROBE I2C0_SDA       */

/* PLA_PROBE_I2C[ELEM0] - Connects either GPIO or I2C as the GPIO input to BLOCK 0 element 0 */
#define PLA_PROBE_I2C_ELEM0_BBA        (*(volatile unsigned long *) 0x420B1480)
#define PLA_PROBE_I2C_ELEM0_MSK        (0x1   << 0  )
#define PLA_PROBE_I2C_ELEM0            (0x1   << 0  )
#define PLA_PROBE_I2C_ELEM0_P0_0       (0x0   << 0  ) /* PLA PROBE GPIO P0.0      */
#define PLA_PROBE_I2C_ELEM0_I2C0_SCL   (0x1   << 0  ) /* PLA PROBE I2C0_SCL       */
// ------------------------------------------------------------------------------------------------
// -----                                        dma                                        -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief dma (pADI_DMA)
  */

#if (__NO_MMR_STRUCTS__==0)
typedef struct {                            /*!< pADI_DMA Structure                     */
  __IO uint32_t  DMASTA;                    /*!< DMA Status                            */
  __IO uint32_t  DMACFG;                    /*!< DMA Configuration                     */
  __IO uint32_t  DMAPDBPTR;                 /*!< DMA channel primary control data base pointer */
  __IO uint32_t  DMAADBPTR;                 /*!< DMA channel alternate control data base pointer */
  __I  uint32_t  RESERVED0;
  __IO uint32_t  DMASWREQ;                  /*!< DMA channel software request          */
  __I  uint32_t  RESERVED1[2];
  __IO uint32_t  DMARMSKSET;                /*!< DMA channel request mask set          */
  __IO uint32_t  DMARMSKCLR;                /*!< DMA channel request mask clear        */
  __IO uint32_t  DMAENSET;                  /*!< DMA channel enable set                */
  __IO uint32_t  DMAENCLR;                  /*!< DMA channel enable clear              */
  __IO uint32_t  DMAALTSET;                 /*!< DMA channel primary-alternate set     */
  __IO uint32_t  DMAALTCLR;                 /*!< DMA channel primary-alternate clear   */
  __IO uint32_t  DMAPRISET;                 /*!< DMA channel priority set              */
  __IO uint32_t  DMAPRICLR;                 /*!< DMA channel priority clear            */
  __I  uint32_t  RESERVED2[3];
  __IO uint32_t  DMAERRCLR;                 /*!< DMA Per Channel Bus Error             */
  __I  uint32_t  RESERVED3[492];
  __IO uint32_t  DMABSSET;                  /*!< DMA channel bytes swap enable set     */
  __IO uint32_t  DMABSCLR;                  /*!< DMA channel bytes swap enable clear   */
} ADI_DMA_TypeDef;
#else // (__NO_MMR_STRUCTS__==0)
#define          DMASTA                                     (*(volatile unsigned long      *) 0x40010000)
#define          DMACFG                                     (*(volatile unsigned long      *) 0x40010004)
#define          DMAPDBPTR                                  (*(volatile unsigned long      *) 0x40010008)
#define          DMAADBPTR                                  (*(volatile unsigned long      *) 0x4001000C)
#define          DMASWREQ                                   (*(volatile unsigned long      *) 0x40010014)
#define          DMARMSKSET                                 (*(volatile unsigned long      *) 0x40010020)
#define          DMARMSKCLR                                 (*(volatile unsigned long      *) 0x40010024)
#define          DMAENSET                                   (*(volatile unsigned long      *) 0x40010028)
#define          DMAENCLR                                   (*(volatile unsigned long      *) 0x4001002C)
#define          DMAALTSET                                  (*(volatile unsigned long      *) 0x40010030)
#define          DMAALTCLR                                  (*(volatile unsigned long      *) 0x40010034)
#define          DMAPRISET                                  (*(volatile unsigned long      *) 0x40010038)
#define          DMAPRICLR                                  (*(volatile unsigned long      *) 0x4001003C)
#define          DMAERRCLR                                  (*(volatile unsigned long      *) 0x4001004C)
#define          DMABSSET                                   (*(volatile unsigned long      *) 0x40010800)
#define          DMABSCLR                                   (*(volatile unsigned long      *) 0x40010804)
#endif // (__NO_MMR_STRUCTS__==0)

/* Reset Value for DMASTA*/
#define DMASTA_RVAL                    0xF0000 

