koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm320i.h
/* DMASTA[CHNLSM1] - Number of available DMA channels minus 1 */
#define DMASTA_CHNLSM1_MSK             (0x1F  << 16 )

/* DMASTA[STATE] - Current state of DMA controller */
#define DMASTA_STATE_MSK               (0xF   << 4  )

/* DMASTA[MENABLE] - Enable status of the controller */
#define DMASTA_MENABLE_BBA             (*(volatile unsigned long *) 0x42200000)
#define DMASTA_MENABLE_MSK             (0x1   << 0  )
#define DMASTA_MENABLE                 (0x1   << 0  )

/* Reset Value for DMACFG*/
#define DMACFG_RVAL                    0x0 

/* DMACFG[MENABLE] - Controller enable */
#define DMACFG_MENABLE_BBA             (*(volatile unsigned long *) 0x42200080)
#define DMACFG_MENABLE_MSK             (0x1   << 0  )
#define DMACFG_MENABLE                 (0x1   << 0  )

/* Reset Value for DMAPDBPTR*/
#define DMAPDBPTR_RVAL                 0x0 

/* DMAPDBPTR[CTRLBASEPTR] - Pointer to the base address of the primary data structure */
#define DMAPDBPTR_CTRLBASEPTR_MSK      (0xFFFFFFFF << 0  )

/* Reset Value for DMAADBPTR*/
#define DMAADBPTR_RVAL                 0x100 

/* DMAADBPTR[ALTCBPTR] - Base address of the alternate data structure */
#define DMAADBPTR_ALTCBPTR_MSK         (0xFFFFFFFF << 0  )

/* Reset Value for DMASWREQ*/
#define DMASWREQ_RVAL                  0x0 

/* DMASWREQ[CHSWREQ] - Generate software request */
#define DMASWREQ_CHSWREQ_MSK           (0x3FFF << 0  )

/* Reset Value for DMARMSKSET*/
#define DMARMSKSET_RVAL                0x0 

/* DMARMSKSET[CHREQMSET] - Mask requests from DMA channels */
#define DMARMSKSET_CHREQMSET_MSK       (0x3FFF << 0  )

/* Reset Value for DMARMSKCLR*/
#define DMARMSKCLR_RVAL                0x0 

/* DMARMSKCLR[CHREQMCLR] - Clear REQ_MASK_SET bits in DMARMSKSET */
#define DMARMSKCLR_CHREQMCLR_MSK       (0x3FFF << 0  )

/* Reset Value for DMAENSET*/
#define DMAENSET_RVAL                  0x0 

/* DMAENSET[CHENSET] - Enable DMA channels */
#define DMAENSET_CHENSET_MSK           (0x3FFF << 0  )

/* Reset Value for DMAENCLR*/
#define DMAENCLR_RVAL                  0x0 

/* DMAENCLR[CHENCLR] - Disable DMA channels */
#define DMAENCLR_CHENCLR_MSK           (0x3FFF << 0  )

/* Reset Value for DMAALTSET*/
#define DMAALTSET_RVAL                 0x0 

/* DMAALTSET[CHPRIALTSET] - Control struct status / select alt struct */
#define DMAALTSET_CHPRIALTSET_MSK      (0x3FFF << 0  )

/* Reset Value for DMAALTCLR*/
#define DMAALTCLR_RVAL                 0x0 

/* DMAALTCLR[CHPRIALTCLR] - Select primary data struct */
#define DMAALTCLR_CHPRIALTCLR_MSK      (0x3FFF << 0  )

/* Reset Value for DMAPRISET*/
#define DMAPRISET_RVAL                 0x0 

/* DMAPRISET[CHPRISET] - Configure channel for high priority */
#define DMAPRISET_CHPRISET_MSK         (0x3FFF << 0  )

/* Reset Value for DMAPRICLR*/
#define DMAPRICLR_RVAL                 0x0 

/* DMAPRICLR[CHPRICLR] - Configure channel for default priority level */
#define DMAPRICLR_CHPRICLR_MSK         (0x3FFF << 0  )

/* Reset Value for DMAERRCLR*/
#define DMAERRCLR_RVAL                 0x0 

/* DMAERRCLR[ERRCLR] - Bus error status */
#define DMAERRCLR_ERRCLR_MSK           (0x3FFF << 0  )

/* Reset Value for DMABSSET*/
#define DMABSSET_RVAL                  0x0 

/* DMABSSET[CHBSWAPSET] - Byte swap status */
#define DMABSSET_CHBSWAPSET_MSK        (0x3FFF << 0  )

/* Reset Value for DMABSCLR*/
#define DMABSCLR_RVAL                  0x0 

/* DMABSCLR[CHBSWAPCLR] - Disable byte swap */
#define DMABSCLR_CHBSWAPCLR_MSK        (0x3FFF << 0  )
// ------------------------------------------------------------------------------------------------
// -----                                        FEE                                        -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief FEE (pADI_FEE)
  */

#if (__NO_MMR_STRUCTS__==0)
typedef struct {                            /*!< pADI_FEE Structure                     */
  __IO uint32_t  FEESTA;                    /*!< Status register                       */
  __IO uint32_t  FEECON0;                   /*!< Command Control register: interrupt enable register */
  __IO uint32_t  FEECMD;                    /*!< Command register                      */
  __IO uint32_t  FEEFLADR;                  /*!< Flash address key - hole register     */
  __IO uint32_t  FEEFLDATA0;                /*!< Flash Data register: key-hole interface lower 32 bits */
  __IO uint32_t  FEEFLDATA1;                /*!< Flash Data register: key-hole interface upper 32 bits */
  __IO uint32_t  FEEADR0;                   /*!< Lower page address register           */
  __IO uint32_t  FEEADR1;                   /*!< Upper page address register           */
  __IO uint32_t  FEEKEY;                    /*!< Flash Key register.                   */
  __I  uint32_t  RESERVED0;
  __IO uint32_t  FEEPRO0;                   /*!< write protection register for flash0  */
  __IO uint32_t  FEEPRO1;                   /*!< write protection register for flash1  */
  __I  uint32_t  RESERVED1;
  __IO uint32_t  FEESIG;                    /*!< Flash Signature                       */
  __IO uint32_t  FEECON1;                   /*!< User Setup register                   */
  __I  uint32_t  RESERVED2;
  __IO uint32_t  FEEWRADDRA;                /*!< write abort address register          */
  __I  uint32_t  RESERVED3;
  __IO uint32_t  FEEAEN0;                   /*!< Interrupt abort enable register. Interrupt 31 to Interrupt 0. */
  __IO uint32_t  FEEAEN1;                   /*!< Interrupt abort enable register. Interrupt 54 to Interrupt 32. */
  __I  uint32_t  RESERVED4[5];
  __IO uint32_t  FEEECCCONFIG;              /*!< Configurable ECC enable/disable, error response */
  __I  uint32_t  RESERVED5[3];
  __IO uint32_t  FEEECCADDR0;               /*!< Flash 0 ECC Error Address             */
  __IO uint32_t  FEEECCADDR1;               /*!< Flash 1 ECC Error Address             */
  __I  uint32_t  RESERVED6[17];
  __IO uint32_t  CACHESTAT;                 /*!< Cache Status register                 */
  __IO uint32_t  CACHESETUP;                /*!< Cache Setup register                  */
  __IO uint32_t  CACHEKEY;                  /*!< Cache Key register                    */
} ADI_FEE_TypeDef;
#else // (__NO_MMR_STRUCTS__==0)
#define          FEESTA                                     (*(volatile unsigned long      *) 0x40018000)
#define          FEECON0                                    (*(volatile unsigned long      *) 0x40018004)
#define          FEECMD                                     (*(volatile unsigned long      *) 0x40018008)
#define          FEEFLADR                                   (*(volatile unsigned long      *) 0x4001800C)
#define          FEEFLDATA0                                 (*(volatile unsigned long      *) 0x40018010)
#define          FEEFLDATA1                                 (*(volatile unsigned long      *) 0x40018014)
#define          FEEADR0                                    (*(volatile unsigned long      *) 0x40018018)
#define          FEEADR1                                    (*(volatile unsigned long      *) 0x4001801C)
#define          FEEKEY                                     (*(volatile unsigned long      *) 0x40018020)
#define          FEEPRO0                                    (*(volatile unsigned long      *) 0x40018028)
#define          FEEPRO1                                    (*(volatile unsigned long      *) 0x4001802C)
#define          FEESIG                                     (*(volatile unsigned long      *) 0x40018034)
#define          FEECON1                                    (*(volatile unsigned long      *) 0x40018038)
#define          FEEWRADDRA                                 (*(volatile unsigned long      *) 0x40018040)
#define          FEEAEN0                                    (*(volatile unsigned long      *) 0x40018048)
#define          FEEAEN1                                    (*(volatile unsigned long      *) 0x4001804C)
#define          FEEECCCONFIG                               (*(volatile unsigned long      *) 0x40018064)
#define          FEEECCADDR0                                (*(volatile unsigned long      *) 0x40018074)
#define          FEEECCADDR1                                (*(volatile unsigned long      *) 0x40018078)
#define          CACHESTAT                                  (*(volatile unsigned long      *) 0x400180C0)
#define          CACHESETUP                                 (*(volatile unsigned long      *) 0x400180C4)
#define          CACHEKEY                                   (*(volatile unsigned long      *) 0x400180C8)
#endif // (__NO_MMR_STRUCTS__==0)

/* Reset Value for FEESTA*/
#define FEESTA_RVAL                    0x0 

/* FEESTA[INIT] - Initialization upload in progress. */
#define FEESTA_INIT_BBA                (*(volatile unsigned long *) 0x42300038)
#define FEESTA_INIT_MSK                (0x1   << 14 )
#define FEESTA_INIT                    (0x1   << 14 )
#define FEESTA_INIT_CLR                (0x0   << 14 )
#define FEESTA_INIT_SET                (0x1   << 14 )

/* FEESTA[SIGNERR] - Information space signature check on reset error. */
#define FEESTA_SIGNERR_BBA             (*(volatile unsigned long *) 0x42300034)
#define FEESTA_SIGNERR_MSK             (0x1   << 13 )
#define FEESTA_SIGNERR                 (0x1   << 13 )
#define FEESTA_SIGNERR_CLR             (0x0   << 13 )
#define FEESTA_SIGNERR_SET             (0x1   << 13 )

