koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm320i.h
/* GP0CON[CON7] - p0.7  configuration bits */
#define GP0CON_CON7_MSK                (0x3   << 14 )
#define GP0CON_CON7_GPIO               (0x0   << 14 ) /* GPIO                     */
#define GP0CON_CON7_I2C1SDA            (0x1   << 14 ) /* I2C1 SDA                 */
#define GP0CON_CON7_PLAO3              (0x3   << 14 ) /* PLAO[3]                  */

/* GP0CON[CON6] - p0.6  configuration bits */
#define GP0CON_CON6_MSK                (0x3   << 12 )
#define GP0CON_CON6_GPIO               (0x0   << 12 ) /* GPIO                     */
#define GP0CON_CON6_I2C1SCL            (0x1   << 12 ) /* I2C1 SCL                 */
#define GP0CON_CON6_PLAO2              (0x3   << 12 ) /* PLAO[2]                  */

/* GP0CON[CON5] - p0.5  configuration bits */
#define GP0CON_CON5_MSK                (0x3   << 10 )
#define GP0CON_CON5_GPIO               (0x0   << 10 ) /* GPIO                     */
#define GP0CON_CON5_I2C0SDA            (0x1   << 10 ) /* I2C0 SDA                 */
#define GP0CON_CON5_PLAO1              (0x3   << 10 ) /* PLAO[1]                  */

/* GP0CON[CON4] - p0.4  configuration bits */
#define GP0CON_CON4_MSK                (0x3   << 8  )
#define GP0CON_CON4_GPIO               (0x0   << 8  ) /* GPIO                     */
#define GP0CON_CON4_I2CSCL             (0x1   << 8  ) /* I2C0 SCL                 */
#define GP0CON_CON4_PLAO0              (0x3   << 8  ) /* PLAO[0]                  */

/* GP0CON[CON3] - p0.3  configuration bits */
#define GP0CON_CON3_MSK                (0x3   << 6  )
#define GP0CON_CON3_GPIOIRQ0           (0x0   << 6  ) /* GPIO/IRQ0                */
#define GP0CON_CON3_SPI0CS             (0x1   << 6  ) /* SPI0 CS                  */
#define GP0CON_CON3_PLACLK0            (0x2   << 6  ) /* PLA CLK0                 */
#define GP0CON_CON3_PLAI3              (0x3   << 6  ) /* PLAI[3]                  */

/* GP0CON[CON2] - p0.2  configuration bits */
#define GP0CON_CON2_MSK                (0x3   << 4  )
#define GP0CON_CON2_GPIO               (0x0   << 4  ) /* GPIO                     */
#define GP0CON_CON2_SPI0MOSI           (0x1   << 4  ) /* SPI0 MOSI                */
#define GP0CON_CON2_PLAI2              (0x3   << 4  ) /* PLAI[2]                  */

/* GP0CON[CON1] - p0.1  configuration bits */
#define GP0CON_CON1_MSK                (0x3   << 2  )
#define GP0CON_CON1_GPIO               (0x0   << 2  ) /* GPIO                     */
#define GP0CON_CON1_SIP0MISO           (0x1   << 2  ) /* SPI0 MISO                */
#define GP0CON_CON1_PLAI1              (0x3   << 2  ) /* PLAI[1]                  */

/* GP0CON[CON0] - p0.0  configuration bits */
#define GP0CON_CON0_MSK                (0x3   << 0  )
#define GP0CON_CON0_GPIO               (0x0   << 0  ) /* GPIO                     */
#define GP0CON_CON0_SPI0SCLK           (0x1   << 0  ) /* SPI0 SCLK                */
#define GP0CON_CON0_PLAI0              (0x3   << 0  ) /* PLAI[0]                  */

/* Reset Value for GP0OE*/
#define GP0OE_RVAL                     0x0 

/* GP0OE[OE7] - Pin output drive enable */
#define GP0OE_OE7_BBA                  (*(volatile unsigned long *) 0x4240009C)
#define GP0OE_OE7_MSK                  (0x1   << 7  )
#define GP0OE_OE7                      (0x1   << 7  )
#define GP0OE_OE7_DIS                  (0x0   << 7  )
#define GP0OE_OE7_EN                   (0x1   << 7  )

/* GP0OE[OE6] - Pin output drive enable */
#define GP0OE_OE6_BBA                  (*(volatile unsigned long *) 0x42400098)
#define GP0OE_OE6_MSK                  (0x1   << 6  )
#define GP0OE_OE6                      (0x1   << 6  )
#define GP0OE_OE6_DIS                  (0x0   << 6  )
#define GP0OE_OE6_EN                   (0x1   << 6  )

/* GP0OE[OE5] - Pin output drive enable */
#define GP0OE_OE5_BBA                  (*(volatile unsigned long *) 0x42400094)
#define GP0OE_OE5_MSK                  (0x1   << 5  )
#define GP0OE_OE5                      (0x1   << 5  )
#define GP0OE_OE5_DIS                  (0x0   << 5  )
#define GP0OE_OE5_EN                   (0x1   << 5  )

/* GP0OE[OE4] - Pin output drive enable */
#define GP0OE_OE4_BBA                  (*(volatile unsigned long *) 0x42400090)
#define GP0OE_OE4_MSK                  (0x1   << 4  )
#define GP0OE_OE4                      (0x1   << 4  )
#define GP0OE_OE4_DIS                  (0x0   << 4  )
#define GP0OE_OE4_EN                   (0x1   << 4  )

/* GP0OE[OE3] - Pin output drive enable */
#define GP0OE_OE3_BBA                  (*(volatile unsigned long *) 0x4240008C)
#define GP0OE_OE3_MSK                  (0x1   << 3  )
#define GP0OE_OE3                      (0x1   << 3  )
#define GP0OE_OE3_DIS                  (0x0   << 3  )
#define GP0OE_OE3_EN                   (0x1   << 3  )

/* GP0OE[OE2] - Pin output drive enable */
#define GP0OE_OE2_BBA                  (*(volatile unsigned long *) 0x42400088)
#define GP0OE_OE2_MSK                  (0x1   << 2  )
#define GP0OE_OE2                      (0x1   << 2  )
#define GP0OE_OE2_DIS                  (0x0   << 2  )
#define GP0OE_OE2_EN                   (0x1   << 2  )

/* GP0OE[OE1] - Pin output drive enable */
#define GP0OE_OE1_BBA                  (*(volatile unsigned long *) 0x42400084)
#define GP0OE_OE1_MSK                  (0x1   << 1  )
#define GP0OE_OE1                      (0x1   << 1  )
#define GP0OE_OE1_DIS                  (0x0   << 1  )
#define GP0OE_OE1_EN                   (0x1   << 1  )

/* GP0OE[OE0] - Pin output drive enable */
#define GP0OE_OE0_BBA                  (*(volatile unsigned long *) 0x42400080)
#define GP0OE_OE0_MSK                  (0x1   << 0  )
#define GP0OE_OE0                      (0x1   << 0  )
#define GP0OE_OE0_DIS                  (0x0   << 0  )
#define GP0OE_OE0_EN                   (0x1   << 0  )

/* Reset Value for GP0PUL*/
#define GP0PUL_RVAL                    0x0 

/* GP0PUL[PUL7] - Pin Pull up enable */
#define GP0PUL_PUL7_BBA                (*(volatile unsigned long *) 0x4240011C)
#define GP0PUL_PUL7_MSK                (0x1   << 7  )
#define GP0PUL_PUL7                    (0x1   << 7  )
#define GP0PUL_PUL7_DIS                (0x0   << 7  )
#define GP0PUL_PUL7_EN                 (0x1   << 7  )

/* GP0PUL[PUL6] - Pin Pull up enable */
#define GP0PUL_PUL6_BBA                (*(volatile unsigned long *) 0x42400118)
#define GP0PUL_PUL6_MSK                (0x1   << 6  )
#define GP0PUL_PUL6                    (0x1   << 6  )
#define GP0PUL_PUL6_DIS                (0x0   << 6  )
#define GP0PUL_PUL6_EN                 (0x1   << 6  )

/* GP0PUL[PUL5] - Pin Pull up enable */
#define GP0PUL_PUL5_BBA                (*(volatile unsigned long *) 0x42400114)
#define GP0PUL_PUL5_MSK                (0x1   << 5  )
#define GP0PUL_PUL5                    (0x1   << 5  )
#define GP0PUL_PUL5_DIS                (0x0   << 5  )
#define GP0PUL_PUL5_EN                 (0x1   << 5  )

/* GP0PUL[PUL4] - Pin Pull up enable */
#define GP0PUL_PUL4_BBA                (*(volatile unsigned long *) 0x42400110)
#define GP0PUL_PUL4_MSK                (0x1   << 4  )
#define GP0PUL_PUL4                    (0x1   << 4  )
#define GP0PUL_PUL4_DIS                (0x0   << 4  )
#define GP0PUL_PUL4_EN                 (0x1   << 4  )

