koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm320i.h
/* GP0PUL[PUL3] - Pin Pull up enable */
#define GP0PUL_PUL3_BBA                (*(volatile unsigned long *) 0x4240010C)
#define GP0PUL_PUL3_MSK                (0x1   << 3  )
#define GP0PUL_PUL3                    (0x1   << 3  )
#define GP0PUL_PUL3_DIS                (0x0   << 3  )
#define GP0PUL_PUL3_EN                 (0x1   << 3  )

/* GP0PUL[PUL2] - Pin Pull up enable */
#define GP0PUL_PUL2_BBA                (*(volatile unsigned long *) 0x42400108)
#define GP0PUL_PUL2_MSK                (0x1   << 2  )
#define GP0PUL_PUL2                    (0x1   << 2  )
#define GP0PUL_PUL2_DIS                (0x0   << 2  )
#define GP0PUL_PUL2_EN                 (0x1   << 2  )

/* GP0PUL[PUL1] - Pin Pull up enable */
#define GP0PUL_PUL1_BBA                (*(volatile unsigned long *) 0x42400104)
#define GP0PUL_PUL1_MSK                (0x1   << 1  )
#define GP0PUL_PUL1                    (0x1   << 1  )
#define GP0PUL_PUL1_DIS                (0x0   << 1  )
#define GP0PUL_PUL1_EN                 (0x1   << 1  )

/* GP0PUL[PUL0] - Pin Pull up enable */
#define GP0PUL_PUL0_BBA                (*(volatile unsigned long *) 0x42400100)
#define GP0PUL_PUL0_MSK                (0x1   << 0  )
#define GP0PUL_PUL0                    (0x1   << 0  )
#define GP0PUL_PUL0_DIS                (0x0   << 0  )
#define GP0PUL_PUL0_EN                 (0x1   << 0  )

/* Reset Value for GP0IE*/
#define GP0IE_RVAL                     0x0 

/* GP0IE[IEN7] - Input path enable */
#define GP0IE_IEN7_BBA                 (*(volatile unsigned long *) 0x4240019C)
#define GP0IE_IEN7_MSK                 (0x1   << 7  )
#define GP0IE_IEN7                     (0x1   << 7  )
#define GP0IE_IEN7_DIS                 (0x0   << 7  )
#define GP0IE_IEN7_EN                  (0x1   << 7  )

/* GP0IE[IEN6] - Input path enable */
#define GP0IE_IEN6_BBA                 (*(volatile unsigned long *) 0x42400198)
#define GP0IE_IEN6_MSK                 (0x1   << 6  )
#define GP0IE_IEN6                     (0x1   << 6  )
#define GP0IE_IEN6_DIS                 (0x0   << 6  )
#define GP0IE_IEN6_EN                  (0x1   << 6  )

/* GP0IE[IEN5] - Input path enable */
#define GP0IE_IEN5_BBA                 (*(volatile unsigned long *) 0x42400194)
#define GP0IE_IEN5_MSK                 (0x1   << 5  )
#define GP0IE_IEN5                     (0x1   << 5  )
#define GP0IE_IEN5_DIS                 (0x0   << 5  )
#define GP0IE_IEN5_EN                  (0x1   << 5  )

/* GP0IE[IEN4] - Input path enable */
#define GP0IE_IEN4_BBA                 (*(volatile unsigned long *) 0x42400190)
#define GP0IE_IEN4_MSK                 (0x1   << 4  )
#define GP0IE_IEN4                     (0x1   << 4  )
#define GP0IE_IEN4_DIS                 (0x0   << 4  )
#define GP0IE_IEN4_EN                  (0x1   << 4  )

/* GP0IE[IEN3] - Input path enable */
#define GP0IE_IEN3_BBA                 (*(volatile unsigned long *) 0x4240018C)
#define GP0IE_IEN3_MSK                 (0x1   << 3  )
#define GP0IE_IEN3                     (0x1   << 3  )
#define GP0IE_IEN3_DIS                 (0x0   << 3  )
#define GP0IE_IEN3_EN                  (0x1   << 3  )

/* GP0IE[IEN2] - Input path enable */
#define GP0IE_IEN2_BBA                 (*(volatile unsigned long *) 0x42400188)
#define GP0IE_IEN2_MSK                 (0x1   << 2  )
#define GP0IE_IEN2                     (0x1   << 2  )
#define GP0IE_IEN2_DIS                 (0x0   << 2  )
#define GP0IE_IEN2_EN                  (0x1   << 2  )

/* GP0IE[IEN1] - Input path enable */
#define GP0IE_IEN1_BBA                 (*(volatile unsigned long *) 0x42400184)
#define GP0IE_IEN1_MSK                 (0x1   << 1  )
#define GP0IE_IEN1                     (0x1   << 1  )
#define GP0IE_IEN1_DIS                 (0x0   << 1  )
#define GP0IE_IEN1_EN                  (0x1   << 1  )

/* GP0IE[IEN0] - Input path enable */
#define GP0IE_IEN0_BBA                 (*(volatile unsigned long *) 0x42400180)
#define GP0IE_IEN0_MSK                 (0x1   << 0  )
#define GP0IE_IEN0                     (0x1   << 0  )
#define GP0IE_IEN0_DIS                 (0x0   << 0  )
#define GP0IE_IEN0_EN                  (0x1   << 0  )

/* Reset Value for GP0IN*/
#define GP0IN_RVAL                     0x0 

/* GP0IN[IN7] - Registered data input */
#define GP0IN_IN7_BBA                  (*(volatile unsigned long *) 0x4240021C)
#define GP0IN_IN7_MSK                  (0x1   << 7  )
#define GP0IN_IN7                      (0x1   << 7  )
#define GP0IN_IN7_LOW                  (0x0   << 7  )
#define GP0IN_IN7_HIGH                 (0x1   << 7  )

/* GP0IN[IN6] - Registered data input */
#define GP0IN_IN6_BBA                  (*(volatile unsigned long *) 0x42400218)
#define GP0IN_IN6_MSK                  (0x1   << 6  )
#define GP0IN_IN6                      (0x1   << 6  )
#define GP0IN_IN6_LOW                  (0x0   << 6  )
#define GP0IN_IN6_HIGH                 (0x1   << 6  )

/* GP0IN[IN5] - Registered data input */
#define GP0IN_IN5_BBA                  (*(volatile unsigned long *) 0x42400214)
#define GP0IN_IN5_MSK                  (0x1   << 5  )
#define GP0IN_IN5                      (0x1   << 5  )
#define GP0IN_IN5_LOW                  (0x0   << 5  )
#define GP0IN_IN5_HIGH                 (0x1   << 5  )

/* GP0IN[IN4] - Registered data input */
#define GP0IN_IN4_BBA                  (*(volatile unsigned long *) 0x42400210)
#define GP0IN_IN4_MSK                  (0x1   << 4  )
#define GP0IN_IN4                      (0x1   << 4  )
#define GP0IN_IN4_LOW                  (0x0   << 4  )
#define GP0IN_IN4_HIGH                 (0x1   << 4  )

/* GP0IN[IN3] - Registered data input */
#define GP0IN_IN3_BBA                  (*(volatile unsigned long *) 0x4240020C)
#define GP0IN_IN3_MSK                  (0x1   << 3  )
#define GP0IN_IN3                      (0x1   << 3  )
#define GP0IN_IN3_LOW                  (0x0   << 3  )
#define GP0IN_IN3_HIGH                 (0x1   << 3  )

/* GP0IN[IN2] - Registered data input */
#define GP0IN_IN2_BBA                  (*(volatile unsigned long *) 0x42400208)
#define GP0IN_IN2_MSK                  (0x1   << 2  )
#define GP0IN_IN2                      (0x1   << 2  )
#define GP0IN_IN2_LOW                  (0x0   << 2  )
#define GP0IN_IN2_HIGH                 (0x1   << 2  )

/* GP0IN[IN1] - Registered data input */
#define GP0IN_IN1_BBA                  (*(volatile unsigned long *) 0x42400204)
#define GP0IN_IN1_MSK                  (0x1   << 1  )
#define GP0IN_IN1                      (0x1   << 1  )
#define GP0IN_IN1_LOW                  (0x0   << 1  )
#define GP0IN_IN1_HIGH                 (0x1   << 1  )

/* GP0IN[IN0] - Registered data input */
#define GP0IN_IN0_BBA                  (*(volatile unsigned long *) 0x42400200)
#define GP0IN_IN0_MSK                  (0x1   << 0  )
#define GP0IN_IN0                      (0x1   << 0  )
#define GP0IN_IN0_LOW                  (0x0   << 0  )
#define GP0IN_IN0_HIGH                 (0x1   << 0  )

/* Reset Value for GP0OUT*/
#define GP0OUT_RVAL                    0x0 

/* GP0OUT[OUT7] - Data out */
#define GP0OUT_OUT7_BBA                (*(volatile unsigned long *) 0x4240029C)
#define GP0OUT_OUT7_MSK                (0x1   << 7  )
#define GP0OUT_OUT7                    (0x1   << 7  )
#define GP0OUT_OUT7_LOW                (0x0   << 7  )
#define GP0OUT_OUT7_HIGH               (0x1   << 7  )

