koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm320i.h
/* GP0OUT[OUT6] - Data out */
#define GP0OUT_OUT6_BBA                (*(volatile unsigned long *) 0x42400298)
#define GP0OUT_OUT6_MSK                (0x1   << 6  )
#define GP0OUT_OUT6                    (0x1   << 6  )
#define GP0OUT_OUT6_LOW                (0x0   << 6  )
#define GP0OUT_OUT6_HIGH               (0x1   << 6  )

/* GP0OUT[OUT5] - Data out */
#define GP0OUT_OUT5_BBA                (*(volatile unsigned long *) 0x42400294)
#define GP0OUT_OUT5_MSK                (0x1   << 5  )
#define GP0OUT_OUT5                    (0x1   << 5  )
#define GP0OUT_OUT5_LOW                (0x0   << 5  )
#define GP0OUT_OUT5_HIGH               (0x1   << 5  )

/* GP0OUT[OUT4] - Data out */
#define GP0OUT_OUT4_BBA                (*(volatile unsigned long *) 0x42400290)
#define GP0OUT_OUT4_MSK                (0x1   << 4  )
#define GP0OUT_OUT4                    (0x1   << 4  )
#define GP0OUT_OUT4_LOW                (0x0   << 4  )
#define GP0OUT_OUT4_HIGH               (0x1   << 4  )

/* GP0OUT[OUT3] - Data out */
#define GP0OUT_OUT3_BBA                (*(volatile unsigned long *) 0x4240028C)
#define GP0OUT_OUT3_MSK                (0x1   << 3  )
#define GP0OUT_OUT3                    (0x1   << 3  )
#define GP0OUT_OUT3_LOW                (0x0   << 3  )
#define GP0OUT_OUT3_HIGH               (0x1   << 3  )

/* GP0OUT[OUT2] - Data out */
#define GP0OUT_OUT2_BBA                (*(volatile unsigned long *) 0x42400288)
#define GP0OUT_OUT2_MSK                (0x1   << 2  )
#define GP0OUT_OUT2                    (0x1   << 2  )
#define GP0OUT_OUT2_LOW                (0x0   << 2  )
#define GP0OUT_OUT2_HIGH               (0x1   << 2  )

/* GP0OUT[OUT1] - Data out */
#define GP0OUT_OUT1_BBA                (*(volatile unsigned long *) 0x42400284)
#define GP0OUT_OUT1_MSK                (0x1   << 1  )
#define GP0OUT_OUT1                    (0x1   << 1  )
#define GP0OUT_OUT1_LOW                (0x0   << 1  )
#define GP0OUT_OUT1_HIGH               (0x1   << 1  )

/* GP0OUT[OUT0] - Data out */
#define GP0OUT_OUT0_BBA                (*(volatile unsigned long *) 0x42400280)
#define GP0OUT_OUT0_MSK                (0x1   << 0  )
#define GP0OUT_OUT0                    (0x1   << 0  )
#define GP0OUT_OUT0_LOW                (0x0   << 0  )
#define GP0OUT_OUT0_HIGH               (0x1   << 0  )

/* Reset Value for GP0SET*/
#define GP0SET_RVAL                    0x0 

/* GP0SET[SET7] - Set the output high. */
#define GP0SET_SET7_BBA                (*(volatile unsigned long *) 0x4240031C)
#define GP0SET_SET7_MSK                (0x1   << 7  )
#define GP0SET_SET7                    (0x1   << 7  )
#define GP0SET_SET7_SET                (0x1   << 7  )

/* GP0SET[SET6] - Set the output high. */
#define GP0SET_SET6_BBA                (*(volatile unsigned long *) 0x42400318)
#define GP0SET_SET6_MSK                (0x1   << 6  )
#define GP0SET_SET6                    (0x1   << 6  )
#define GP0SET_SET6_SET                (0x1   << 6  )

/* GP0SET[SET5] - Set the output high. */
#define GP0SET_SET5_BBA                (*(volatile unsigned long *) 0x42400314)
#define GP0SET_SET5_MSK                (0x1   << 5  )
#define GP0SET_SET5                    (0x1   << 5  )
#define GP0SET_SET5_SET                (0x1   << 5  )

/* GP0SET[SET4] - Set the output high. */
#define GP0SET_SET4_BBA                (*(volatile unsigned long *) 0x42400310)
#define GP0SET_SET4_MSK                (0x1   << 4  )
#define GP0SET_SET4                    (0x1   << 4  )
#define GP0SET_SET4_SET                (0x1   << 4  )

/* GP0SET[SET3] - Set the output high. */
#define GP0SET_SET3_BBA                (*(volatile unsigned long *) 0x4240030C)
#define GP0SET_SET3_MSK                (0x1   << 3  )
#define GP0SET_SET3                    (0x1   << 3  )
#define GP0SET_SET3_SET                (0x1   << 3  )

/* GP0SET[SET2] - Set the output high. */
#define GP0SET_SET2_BBA                (*(volatile unsigned long *) 0x42400308)
#define GP0SET_SET2_MSK                (0x1   << 2  )
#define GP0SET_SET2                    (0x1   << 2  )
#define GP0SET_SET2_SET                (0x1   << 2  )

/* GP0SET[SET1] - Set the output high. */
#define GP0SET_SET1_BBA                (*(volatile unsigned long *) 0x42400304)
#define GP0SET_SET1_MSK                (0x1   << 1  )
#define GP0SET_SET1                    (0x1   << 1  )
#define GP0SET_SET1_SET                (0x1   << 1  )

/* GP0SET[SET0] - Set the output high. */
#define GP0SET_SET0_BBA                (*(volatile unsigned long *) 0x42400300)
#define GP0SET_SET0_MSK                (0x1   << 0  )
#define GP0SET_SET0                    (0x1   << 0  )
#define GP0SET_SET0_SET                (0x1   << 0  )

/* Reset Value for GP0CLR*/
#define GP0CLR_RVAL                    0x0 

/* GP0CLR[CLR7] - Set the output low. */
#define GP0CLR_CLR7_BBA                (*(volatile unsigned long *) 0x4240039C)
#define GP0CLR_CLR7_MSK                (0x1   << 7  )
#define GP0CLR_CLR7                    (0x1   << 7  )
#define GP0CLR_CLR7_CLR                (0x1   << 7  )

/* GP0CLR[CLR6] - Set the output low. */
#define GP0CLR_CLR6_BBA                (*(volatile unsigned long *) 0x42400398)
#define GP0CLR_CLR6_MSK                (0x1   << 6  )
#define GP0CLR_CLR6                    (0x1   << 6  )
#define GP0CLR_CLR6_CLR                (0x1   << 6  )

/* GP0CLR[CLR5] - Set the output low. */
#define GP0CLR_CLR5_BBA                (*(volatile unsigned long *) 0x42400394)
#define GP0CLR_CLR5_MSK                (0x1   << 5  )
#define GP0CLR_CLR5                    (0x1   << 5  )
#define GP0CLR_CLR5_CLR                (0x1   << 5  )

/* GP0CLR[CLR4] - Set the output low. */
#define GP0CLR_CLR4_BBA                (*(volatile unsigned long *) 0x42400390)
#define GP0CLR_CLR4_MSK                (0x1   << 4  )
#define GP0CLR_CLR4                    (0x1   << 4  )
#define GP0CLR_CLR4_CLR                (0x1   << 4  )

/* GP0CLR[CLR3] - Set the output low. */
#define GP0CLR_CLR3_BBA                (*(volatile unsigned long *) 0x4240038C)
#define GP0CLR_CLR3_MSK                (0x1   << 3  )
#define GP0CLR_CLR3                    (0x1   << 3  )
#define GP0CLR_CLR3_CLR                (0x1   << 3  )

/* GP0CLR[CLR2] - Set the output low. */
#define GP0CLR_CLR2_BBA                (*(volatile unsigned long *) 0x42400388)
#define GP0CLR_CLR2_MSK                (0x1   << 2  )
#define GP0CLR_CLR2                    (0x1   << 2  )
#define GP0CLR_CLR2_CLR                (0x1   << 2  )

