koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm320i.h
/* GP0CLR[CLR1] - Set the output low. */
#define GP0CLR_CLR1_BBA                (*(volatile unsigned long *) 0x42400384)
#define GP0CLR_CLR1_MSK                (0x1   << 1  )
#define GP0CLR_CLR1                    (0x1   << 1  )
#define GP0CLR_CLR1_CLR                (0x1   << 1  )

/* GP0CLR[CLR0] - Set the output low. */
#define GP0CLR_CLR0_BBA                (*(volatile unsigned long *) 0x42400380)
#define GP0CLR_CLR0_MSK                (0x1   << 0  )
#define GP0CLR_CLR0                    (0x1   << 0  )
#define GP0CLR_CLR0_CLR                (0x1   << 0  )

/* Reset Value for GP0TGL*/
#define GP0TGL_RVAL                    0x0 

/* GP0TGL[TGL7] - Toggle the output of the port pin */
#define GP0TGL_TGL7_BBA                (*(volatile unsigned long *) 0x4240041C)
#define GP0TGL_TGL7_MSK                (0x1   << 7  )
#define GP0TGL_TGL7                    (0x1   << 7  )
#define GP0TGL_TGL7_TGL                (0x1   << 7  )

/* GP0TGL[TGL6] - Toggle the output of the port pin */
#define GP0TGL_TGL6_BBA                (*(volatile unsigned long *) 0x42400418)
#define GP0TGL_TGL6_MSK                (0x1   << 6  )
#define GP0TGL_TGL6                    (0x1   << 6  )
#define GP0TGL_TGL6_TGL                (0x1   << 6  )

/* GP0TGL[TGL5] - Toggle the output of the port pin */
#define GP0TGL_TGL5_BBA                (*(volatile unsigned long *) 0x42400414)
#define GP0TGL_TGL5_MSK                (0x1   << 5  )
#define GP0TGL_TGL5                    (0x1   << 5  )
#define GP0TGL_TGL5_TGL                (0x1   << 5  )

/* GP0TGL[TGL4] - Toggle the output of the port pin */
#define GP0TGL_TGL4_BBA                (*(volatile unsigned long *) 0x42400410)
#define GP0TGL_TGL4_MSK                (0x1   << 4  )
#define GP0TGL_TGL4                    (0x1   << 4  )
#define GP0TGL_TGL4_TGL                (0x1   << 4  )

/* GP0TGL[TGL3] - Toggle the output of the port pin */
#define GP0TGL_TGL3_BBA                (*(volatile unsigned long *) 0x4240040C)
#define GP0TGL_TGL3_MSK                (0x1   << 3  )
#define GP0TGL_TGL3                    (0x1   << 3  )
#define GP0TGL_TGL3_TGL                (0x1   << 3  )

/* GP0TGL[TGL2] - Toggle the output of the port pin */
#define GP0TGL_TGL2_BBA                (*(volatile unsigned long *) 0x42400408)
#define GP0TGL_TGL2_MSK                (0x1   << 2  )
#define GP0TGL_TGL2                    (0x1   << 2  )
#define GP0TGL_TGL2_TGL                (0x1   << 2  )

/* GP0TGL[TGL1] - Toggle the output of the port pin */
#define GP0TGL_TGL1_BBA                (*(volatile unsigned long *) 0x42400404)
#define GP0TGL_TGL1_MSK                (0x1   << 1  )
#define GP0TGL_TGL1                    (0x1   << 1  )
#define GP0TGL_TGL1_TGL                (0x1   << 1  )

/* GP0TGL[TGL0] - Toggle the output of the port pin */
#define GP0TGL_TGL0_BBA                (*(volatile unsigned long *) 0x42400400)
#define GP0TGL_TGL0_MSK                (0x1   << 0  )
#define GP0TGL_TGL0                    (0x1   << 0  )
#define GP0TGL_TGL0_TGL                (0x1   << 0  )

/* Reset Value for GP0ODE*/
#define GP0ODE_RVAL                    0x0 

/* GP0ODE[ODE7] - Open drain enable */
#define GP0ODE_ODE7_BBA                (*(volatile unsigned long *) 0x4240049C)
#define GP0ODE_ODE7_MSK                (0x1   << 7  )
#define GP0ODE_ODE7                    (0x1   << 7  )
#define GP0ODE_ODE7_DIS                (0x0   << 7  )
#define GP0ODE_ODE7_EN                 (0x1   << 7  )

/* GP0ODE[ODE6] - Open drain enable */
#define GP0ODE_ODE6_BBA                (*(volatile unsigned long *) 0x42400498)
#define GP0ODE_ODE6_MSK                (0x1   << 6  )
#define GP0ODE_ODE6                    (0x1   << 6  )
#define GP0ODE_ODE6_DIS                (0x0   << 6  )
#define GP0ODE_ODE6_EN                 (0x1   << 6  )

/* GP0ODE[ODE5] - Open drain enable */
#define GP0ODE_ODE5_BBA                (*(volatile unsigned long *) 0x42400494)
#define GP0ODE_ODE5_MSK                (0x1   << 5  )
#define GP0ODE_ODE5                    (0x1   << 5  )
#define GP0ODE_ODE5_DIS                (0x0   << 5  )
#define GP0ODE_ODE5_EN                 (0x1   << 5  )

/* GP0ODE[ODE4] - Open drain enable */
#define GP0ODE_ODE4_BBA                (*(volatile unsigned long *) 0x42400490)
#define GP0ODE_ODE4_MSK                (0x1   << 4  )
#define GP0ODE_ODE4                    (0x1   << 4  )
#define GP0ODE_ODE4_DIS                (0x0   << 4  )
#define GP0ODE_ODE4_EN                 (0x1   << 4  )

/* GP0ODE[ODE3] - Open drain enable */
#define GP0ODE_ODE3_BBA                (*(volatile unsigned long *) 0x4240048C)
#define GP0ODE_ODE3_MSK                (0x1   << 3  )
#define GP0ODE_ODE3                    (0x1   << 3  )
#define GP0ODE_ODE3_DIS                (0x0   << 3  )
#define GP0ODE_ODE3_EN                 (0x1   << 3  )

/* GP0ODE[ODE2] - Open drain enable */
#define GP0ODE_ODE2_BBA                (*(volatile unsigned long *) 0x42400488)
#define GP0ODE_ODE2_MSK                (0x1   << 2  )
#define GP0ODE_ODE2                    (0x1   << 2  )
#define GP0ODE_ODE2_DIS                (0x0   << 2  )
#define GP0ODE_ODE2_EN                 (0x1   << 2  )

/* GP0ODE[ODE1] - Open drain enable */
#define GP0ODE_ODE1_BBA                (*(volatile unsigned long *) 0x42400484)
#define GP0ODE_ODE1_MSK                (0x1   << 1  )
#define GP0ODE_ODE1                    (0x1   << 1  )
#define GP0ODE_ODE1_DIS                (0x0   << 1  )
#define GP0ODE_ODE1_EN                 (0x1   << 1  )

/* GP0ODE[ODE0] - Open drain enable */
#define GP0ODE_ODE0_BBA                (*(volatile unsigned long *) 0x42400480)
#define GP0ODE_ODE0_MSK                (0x1   << 0  )
#define GP0ODE_ODE0                    (0x1   << 0  )
#define GP0ODE_ODE0_DIS                (0x0   << 0  )
#define GP0ODE_ODE0_EN                 (0x1   << 0  )
#if (__NO_MMR_STRUCTS__==1)

#define          GP1CON                                     (*(volatile unsigned short int *) 0x40020040)
#define          GP1OE                                      (*(volatile unsigned char      *) 0x40020044)
#define          GP1PUL                                     (*(volatile unsigned char      *) 0x40020048)
#define          GP1IE                                      (*(volatile unsigned char      *) 0x4002004C)
#define          GP1IN                                      (*(volatile unsigned char      *) 0x40020050)
#define          GP1OUT                                     (*(volatile unsigned char      *) 0x40020054)
#define          GP1SET                                     (*(volatile unsigned char      *) 0x40020058)
#define          GP1CLR                                     (*(volatile unsigned char      *) 0x4002005C)
#define          GP1TGL                                     (*(volatile unsigned char      *) 0x40020060)
#define          GP1ODE                                     (*(volatile unsigned char      *) 0x40020064)
#endif // (__NO_MMR_STRUCTS__==1)

