koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm320i.h
/* GP1PUL[PUL7] - Pin Pull up enable */
#define GP1PUL_PUL7_BBA                (*(volatile unsigned long *) 0x4240091C)
#define GP1PUL_PUL7_MSK                (0x1   << 7  )
#define GP1PUL_PUL7                    (0x1   << 7  )
#define GP1PUL_PUL7_DIS                (0x0   << 7  )
#define GP1PUL_PUL7_EN                 (0x1   << 7  )

/* GP1PUL[PUL6] - Pin Pull up enable */
#define GP1PUL_PUL6_BBA                (*(volatile unsigned long *) 0x42400918)
#define GP1PUL_PUL6_MSK                (0x1   << 6  )
#define GP1PUL_PUL6                    (0x1   << 6  )
#define GP1PUL_PUL6_DIS                (0x0   << 6  )
#define GP1PUL_PUL6_EN                 (0x1   << 6  )

/* GP1PUL[PUL5] - Pin Pull up enable */
#define GP1PUL_PUL5_BBA                (*(volatile unsigned long *) 0x42400914)
#define GP1PUL_PUL5_MSK                (0x1   << 5  )
#define GP1PUL_PUL5                    (0x1   << 5  )
#define GP1PUL_PUL5_DIS                (0x0   << 5  )
#define GP1PUL_PUL5_EN                 (0x1   << 5  )

/* GP1PUL[PUL4] - Pin Pull up enable */
#define GP1PUL_PUL4_BBA                (*(volatile unsigned long *) 0x42400910)
#define GP1PUL_PUL4_MSK                (0x1   << 4  )
#define GP1PUL_PUL4                    (0x1   << 4  )
#define GP1PUL_PUL4_DIS                (0x0   << 4  )
#define GP1PUL_PUL4_EN                 (0x1   << 4  )

/* GP1PUL[PUL3] - Pin Pull up enable */
#define GP1PUL_PUL3_BBA                (*(volatile unsigned long *) 0x4240090C)
#define GP1PUL_PUL3_MSK                (0x1   << 3  )
#define GP1PUL_PUL3                    (0x1   << 3  )
#define GP1PUL_PUL3_DIS                (0x0   << 3  )
#define GP1PUL_PUL3_EN                 (0x1   << 3  )

/* GP1PUL[PUL2] - Pin Pull up enable */
#define GP1PUL_PUL2_BBA                (*(volatile unsigned long *) 0x42400908)
#define GP1PUL_PUL2_MSK                (0x1   << 2  )
#define GP1PUL_PUL2                    (0x1   << 2  )
#define GP1PUL_PUL2_DIS                (0x0   << 2  )
#define GP1PUL_PUL2_EN                 (0x1   << 2  )

/* GP1PUL[PUL1] - Pin Pull up enable */
#define GP1PUL_PUL1_BBA                (*(volatile unsigned long *) 0x42400904)
#define GP1PUL_PUL1_MSK                (0x1   << 1  )
#define GP1PUL_PUL1                    (0x1   << 1  )
#define GP1PUL_PUL1_DIS                (0x0   << 1  )
#define GP1PUL_PUL1_EN                 (0x1   << 1  )

/* GP1PUL[PUL0] - Pin Pull up enable */
#define GP1PUL_PUL0_BBA                (*(volatile unsigned long *) 0x42400900)
#define GP1PUL_PUL0_MSK                (0x1   << 0  )
#define GP1PUL_PUL0                    (0x1   << 0  )
#define GP1PUL_PUL0_DIS                (0x0   << 0  )
#define GP1PUL_PUL0_EN                 (0x1   << 0  )

/* Reset Value for GP1IE*/
#define GP1IE_RVAL                     0x0 

/* GP1IE[IEN7] - Input path enable */
#define GP1IE_IEN7_BBA                 (*(volatile unsigned long *) 0x4240099C)
#define GP1IE_IEN7_MSK                 (0x1   << 7  )
#define GP1IE_IEN7                     (0x1   << 7  )
#define GP1IE_IEN7_DIS                 (0x0   << 7  )
#define GP1IE_IEN7_EN                  (0x1   << 7  )

/* GP1IE[IEN6] - Input path enable */
#define GP1IE_IEN6_BBA                 (*(volatile unsigned long *) 0x42400998)
#define GP1IE_IEN6_MSK                 (0x1   << 6  )
#define GP1IE_IEN6                     (0x1   << 6  )
#define GP1IE_IEN6_DIS                 (0x0   << 6  )
#define GP1IE_IEN6_EN                  (0x1   << 6  )

/* GP1IE[IEN5] - Input path enable */
#define GP1IE_IEN5_BBA                 (*(volatile unsigned long *) 0x42400994)
#define GP1IE_IEN5_MSK                 (0x1   << 5  )
#define GP1IE_IEN5                     (0x1   << 5  )
#define GP1IE_IEN5_DIS                 (0x0   << 5  )
#define GP1IE_IEN5_EN                  (0x1   << 5  )

/* GP1IE[IEN4] - Input path enable */
#define GP1IE_IEN4_BBA                 (*(volatile unsigned long *) 0x42400990)
#define GP1IE_IEN4_MSK                 (0x1   << 4  )
#define GP1IE_IEN4                     (0x1   << 4  )
#define GP1IE_IEN4_DIS                 (0x0   << 4  )
#define GP1IE_IEN4_EN                  (0x1   << 4  )

/* GP1IE[IEN3] - Input path enable */
#define GP1IE_IEN3_BBA                 (*(volatile unsigned long *) 0x4240098C)
#define GP1IE_IEN3_MSK                 (0x1   << 3  )
#define GP1IE_IEN3                     (0x1   << 3  )
#define GP1IE_IEN3_DIS                 (0x0   << 3  )
#define GP1IE_IEN3_EN                  (0x1   << 3  )

/* GP1IE[IEN2] - Input path enable */
#define GP1IE_IEN2_BBA                 (*(volatile unsigned long *) 0x42400988)
#define GP1IE_IEN2_MSK                 (0x1   << 2  )
#define GP1IE_IEN2                     (0x1   << 2  )
#define GP1IE_IEN2_DIS                 (0x0   << 2  )
#define GP1IE_IEN2_EN                  (0x1   << 2  )

/* GP1IE[IEN1] - Input path enable */
#define GP1IE_IEN1_BBA                 (*(volatile unsigned long *) 0x42400984)
#define GP1IE_IEN1_MSK                 (0x1   << 1  )
#define GP1IE_IEN1                     (0x1   << 1  )
#define GP1IE_IEN1_DIS                 (0x0   << 1  )
#define GP1IE_IEN1_EN                  (0x1   << 1  )

/* GP1IE[IEN0] - Input path enable */
#define GP1IE_IEN0_BBA                 (*(volatile unsigned long *) 0x42400980)
#define GP1IE_IEN0_MSK                 (0x1   << 0  )
#define GP1IE_IEN0                     (0x1   << 0  )
#define GP1IE_IEN0_DIS                 (0x0   << 0  )
#define GP1IE_IEN0_EN                  (0x1   << 0  )

/* Reset Value for GP1IN*/
#define GP1IN_RVAL                     0x0 

/* GP1IN[IN7] - Registered data input */
#define GP1IN_IN7_BBA                  (*(volatile unsigned long *) 0x42400A1C)
#define GP1IN_IN7_MSK                  (0x1   << 7  )
#define GP1IN_IN7                      (0x1   << 7  )
#define GP1IN_IN7_LOW                  (0x0   << 7  )
#define GP1IN_IN7_HIGH                 (0x1   << 7  )

/* GP1IN[IN6] - Registered data input */
#define GP1IN_IN6_BBA                  (*(volatile unsigned long *) 0x42400A18)
#define GP1IN_IN6_MSK                  (0x1   << 6  )
#define GP1IN_IN6                      (0x1   << 6  )
#define GP1IN_IN6_LOW                  (0x0   << 6  )
#define GP1IN_IN6_HIGH                 (0x1   << 6  )

/* GP1IN[IN5] - Registered data input */
#define GP1IN_IN5_BBA                  (*(volatile unsigned long *) 0x42400A14)
#define GP1IN_IN5_MSK                  (0x1   << 5  )
#define GP1IN_IN5                      (0x1   << 5  )
#define GP1IN_IN5_LOW                  (0x0   << 5  )
#define GP1IN_IN5_HIGH                 (0x1   << 5  )

/* GP1IN[IN4] - Registered data input */
#define GP1IN_IN4_BBA                  (*(volatile unsigned long *) 0x42400A10)
#define GP1IN_IN4_MSK                  (0x1   << 4  )
#define GP1IN_IN4                      (0x1   << 4  )
#define GP1IN_IN4_LOW                  (0x0   << 4  )
#define GP1IN_IN4_HIGH                 (0x1   << 4  )

/* GP1IN[IN3] - Registered data input */
#define GP1IN_IN3_BBA                  (*(volatile unsigned long *) 0x42400A0C)
#define GP1IN_IN3_MSK                  (0x1   << 3  )
#define GP1IN_IN3                      (0x1   << 3  )
#define GP1IN_IN3_LOW                  (0x0   << 3  )
#define GP1IN_IN3_HIGH                 (0x1   << 3  )

/* GP1IN[IN2] - Registered data input */
#define GP1IN_IN2_BBA                  (*(volatile unsigned long *) 0x42400A08)
#define GP1IN_IN2_MSK                  (0x1   << 2  )
#define GP1IN_IN2                      (0x1   << 2  )
#define GP1IN_IN2_LOW                  (0x0   << 2  )
#define GP1IN_IN2_HIGH                 (0x1   << 2  )

/* GP1IN[IN1] - Registered data input */
#define GP1IN_IN1_BBA                  (*(volatile unsigned long *) 0x42400A04)
#define GP1IN_IN1_MSK                  (0x1   << 1  )
#define GP1IN_IN1                      (0x1   << 1  )
#define GP1IN_IN1_LOW                  (0x0   << 1  )
#define GP1IN_IN1_HIGH                 (0x1   << 1  )

/* GP1IN[IN0] - Registered data input */
#define GP1IN_IN0_BBA                  (*(volatile unsigned long *) 0x42400A00)
#define GP1IN_IN0_MSK                  (0x1   << 0  )
#define GP1IN_IN0                      (0x1   << 0  )
#define GP1IN_IN0_LOW                  (0x0   << 0  )
#define GP1IN_IN0_HIGH                 (0x1   << 0  )

