koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm320i.h
/* GP2CON[CON7] - p2.7  configuration bits */
#define GP2CON_CON7_MSK                (0x3   << 14 )
#define GP2CON_CON7_GPIOIRQ8           (0x0   << 14 ) /* GPIO/IRQ8                */
#define GP2CON_CON7_PLAO11             (0x3   << 14 ) /* PLAO[11]                 */

/* GP2CON[CON6] - p2.6  configuration bits */
#define GP2CON_CON6_MSK                (0x3   << 12 )
#define GP2CON_CON6_GPIOIRQ7           (0x0   << 12 ) /* GPIO/IRQ7                */
#define GP2CON_CON6_PLAO10             (0x3   << 12 ) /* PLAO[10]                 */

/* GP2CON[CON5] - p2.5  configuration bits */
#define GP2CON_CON5_MSK                (0x3   << 10 )
#define GP2CON_CON5_GPIOIRQ6           (0x0   << 10 ) /* GPIO/IRQ6                */
#define GP2CON_CON5_PWM7               (0x2   << 10 ) /* PWM7                     */
#define GP2CON_CON5_PLAO9              (0x3   << 10 ) /* PLAO[9]                  */

/* GP2CON[CON4] - p2.4  configuration bits */
#define GP2CON_CON4_MSK                (0x3   << 8  )
#define GP2CON_CON4_GIPOIRQ5           (0x0   << 8  ) /* GPIO/IRQ5                */
#define GP2CON_CON4_ADCCONVSTIN        (0x1   << 8  ) /* ADC_CONVST input         */
#define GP2CON_CON4_PWM6               (0x2   << 8  ) /* PWM6                     */
#define GP2CON_CON4_PLAO8              (0x3   << 8  ) /* PLAO[8]                  */

/* GP2CON[CON3] - p2.3  configuration bits */
#define GP2CON_CON3_MSK                (0x3   << 6  )
#define GP2CON_CON3_GPIOBM             (0x0   << 6  ) /* GPIO/BM                  */

/* GP2CON[CON2] - p2.2  configuration bits */
#define GP2CON_CON2_MSK                (0x3   << 4  )
#define GP2CON_CON2_GPIOIRQ4           (0x0   << 4  ) /* GPIO/IRQ4                */
#define GP2CON_CON2_EXTCLKOUT          (0x2   << 4  ) /* External Clock output    */
#define GP2CON_CON2_PLAI10             (0x3   << 4  ) /* PLAI[10]                 */

/* GP2CON[CON1] - p2.1  configuration bits */
#define GP2CON_CON1_MSK                (0x3   << 2  )
#define GP2CON_CON1_GPIOIRQ3           (0x0   << 2  ) /* GPIO/IRQ3                */
#define GP2CON_CON1_PWMSYNC            (0x1   << 2  ) /* PWM Sync                 */
#define GP2CON_CON1_PLAI9              (0x3   << 2  ) /* PLAI[9]                  */

/* GP2CON[CON0] - p2.0  configuration bits */
#define GP2CON_CON0_MSK                (0x3   << 0  )
#define GP2CON_CON0_GPIOIRQ2           (0x0   << 0  ) /* GPIO/IRQ2                */
#define GP2CON_CON0_PWMTRIP            (0x1   << 0  ) /* PWM Trip                 */
#define GP2CON_CON0_PLACLK2            (0x2   << 0  ) /* PLA CLK2                 */
#define GP2CON_CON0_PLAI8              (0x3   << 0  ) /* PLAI[8]                  */

/* Reset Value for GP2OE*/
#define GP2OE_RVAL                     0x0 

/* GP2OE[OE7] - Pin Output Drive enable */
#define GP2OE_OE7_BBA                  (*(volatile unsigned long *) 0x4240109C)
#define GP2OE_OE7_MSK                  (0x1   << 7  )
#define GP2OE_OE7                      (0x1   << 7  )
#define GP2OE_OE7_DIS                  (0x0   << 7  )
#define GP2OE_OE7_EN                   (0x1   << 7  )

/* GP2OE[OE6] - Pin Output Drive enable */
#define GP2OE_OE6_BBA                  (*(volatile unsigned long *) 0x42401098)
#define GP2OE_OE6_MSK                  (0x1   << 6  )
#define GP2OE_OE6                      (0x1   << 6  )
#define GP2OE_OE6_DIS                  (0x0   << 6  )
#define GP2OE_OE6_EN                   (0x1   << 6  )

/* GP2OE[OE5] - Pin Output Drive enable */
#define GP2OE_OE5_BBA                  (*(volatile unsigned long *) 0x42401094)
#define GP2OE_OE5_MSK                  (0x1   << 5  )
#define GP2OE_OE5                      (0x1   << 5  )
#define GP2OE_OE5_DIS                  (0x0   << 5  )
#define GP2OE_OE5_EN                   (0x1   << 5  )

/* GP2OE[OE4] - Pin Output Drive enable */
#define GP2OE_OE4_BBA                  (*(volatile unsigned long *) 0x42401090)
#define GP2OE_OE4_MSK                  (0x1   << 4  )
#define GP2OE_OE4                      (0x1   << 4  )
#define GP2OE_OE4_DIS                  (0x0   << 4  )
#define GP2OE_OE4_EN                   (0x1   << 4  )

/* GP2OE[OE3] - Pin Output Drive enable */
#define GP2OE_OE3_BBA                  (*(volatile unsigned long *) 0x4240108C)
#define GP2OE_OE3_MSK                  (0x1   << 3  )
#define GP2OE_OE3                      (0x1   << 3  )
#define GP2OE_OE3_DIS                  (0x0   << 3  )
#define GP2OE_OE3_EN                   (0x1   << 3  )

/* GP2OE[OE2] - Pin Output Drive enable */
#define GP2OE_OE2_BBA                  (*(volatile unsigned long *) 0x42401088)
#define GP2OE_OE2_MSK                  (0x1   << 2  )
#define GP2OE_OE2                      (0x1   << 2  )
#define GP2OE_OE2_DIS                  (0x0   << 2  )
#define GP2OE_OE2_EN                   (0x1   << 2  )

/* GP2OE[OE1] - Pin Output Drive enable */
#define GP2OE_OE1_BBA                  (*(volatile unsigned long *) 0x42401084)
#define GP2OE_OE1_MSK                  (0x1   << 1  )
#define GP2OE_OE1                      (0x1   << 1  )
#define GP2OE_OE1_DIS                  (0x0   << 1  )
#define GP2OE_OE1_EN                   (0x1   << 1  )

/* GP2OE[OE0] - Pin Output Drive enable */
#define GP2OE_OE0_BBA                  (*(volatile unsigned long *) 0x42401080)
#define GP2OE_OE0_MSK                  (0x1   << 0  )
#define GP2OE_OE0                      (0x1   << 0  )
#define GP2OE_OE0_DIS                  (0x0   << 0  )
#define GP2OE_OE0_EN                   (0x1   << 0  )

/* Reset Value for GP2PUL*/
#define GP2PUL_RVAL                    0x0 

/* GP2PUL[PUL7] - Pin Pull up enable */
#define GP2PUL_PUL7_BBA                (*(volatile unsigned long *) 0x4240111C)
#define GP2PUL_PUL7_MSK                (0x1   << 7  )
#define GP2PUL_PUL7                    (0x1   << 7  )
#define GP2PUL_PUL7_DIS                (0x0   << 7  )
#define GP2PUL_PUL7_EN                 (0x1   << 7  )

/* GP2PUL[PUL6] - Pin Pull up enable */
#define GP2PUL_PUL6_BBA                (*(volatile unsigned long *) 0x42401118)
#define GP2PUL_PUL6_MSK                (0x1   << 6  )
#define GP2PUL_PUL6                    (0x1   << 6  )
#define GP2PUL_PUL6_DIS                (0x0   << 6  )
#define GP2PUL_PUL6_EN                 (0x1   << 6  )

/* GP2PUL[PUL5] - Pin Pull up enable */
#define GP2PUL_PUL5_BBA                (*(volatile unsigned long *) 0x42401114)
#define GP2PUL_PUL5_MSK                (0x1   << 5  )
#define GP2PUL_PUL5                    (0x1   << 5  )
#define GP2PUL_PUL5_DIS                (0x0   << 5  )
#define GP2PUL_PUL5_EN                 (0x1   << 5  )

/* GP2PUL[PUL4] - Pin Pull up enable */
#define GP2PUL_PUL4_BBA                (*(volatile unsigned long *) 0x42401110)
#define GP2PUL_PUL4_MSK                (0x1   << 4  )
#define GP2PUL_PUL4                    (0x1   << 4  )
#define GP2PUL_PUL4_DIS                (0x0   << 4  )
#define GP2PUL_PUL4_EN                 (0x1   << 4  )

