koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm320i.h
/* GP2TGL[TGL7] - Toggle the output of the port pin */
#define GP2TGL_TGL7_BBA                (*(volatile unsigned long *) 0x4240141C)
#define GP2TGL_TGL7_MSK                (0x1   << 7  )
#define GP2TGL_TGL7                    (0x1   << 7  )
#define GP2TGL_TGL7_TGL                (0x1   << 7  )

/* GP2TGL[TGL6] - Toggle the output of the port pin */
#define GP2TGL_TGL6_BBA                (*(volatile unsigned long *) 0x42401418)
#define GP2TGL_TGL6_MSK                (0x1   << 6  )
#define GP2TGL_TGL6                    (0x1   << 6  )
#define GP2TGL_TGL6_TGL                (0x1   << 6  )

/* GP2TGL[TGL5] - Toggle the output of the port pin */
#define GP2TGL_TGL5_BBA                (*(volatile unsigned long *) 0x42401414)
#define GP2TGL_TGL5_MSK                (0x1   << 5  )
#define GP2TGL_TGL5                    (0x1   << 5  )
#define GP2TGL_TGL5_TGL                (0x1   << 5  )

/* GP2TGL[TGL4] - Toggle the output of the port pin */
#define GP2TGL_TGL4_BBA                (*(volatile unsigned long *) 0x42401410)
#define GP2TGL_TGL4_MSK                (0x1   << 4  )
#define GP2TGL_TGL4                    (0x1   << 4  )
#define GP2TGL_TGL4_TGL                (0x1   << 4  )

/* GP2TGL[TGL3] - Toggle the output of the port pin */
#define GP2TGL_TGL3_BBA                (*(volatile unsigned long *) 0x4240140C)
#define GP2TGL_TGL3_MSK                (0x1   << 3  )
#define GP2TGL_TGL3                    (0x1   << 3  )
#define GP2TGL_TGL3_TGL                (0x1   << 3  )

/* GP2TGL[TGL2] - Toggle the output of the port pin */
#define GP2TGL_TGL2_BBA                (*(volatile unsigned long *) 0x42401408)
#define GP2TGL_TGL2_MSK                (0x1   << 2  )
#define GP2TGL_TGL2                    (0x1   << 2  )
#define GP2TGL_TGL2_TGL                (0x1   << 2  )

/* GP2TGL[TGL1] - Toggle the output of the port pin */
#define GP2TGL_TGL1_BBA                (*(volatile unsigned long *) 0x42401404)
#define GP2TGL_TGL1_MSK                (0x1   << 1  )
#define GP2TGL_TGL1                    (0x1   << 1  )
#define GP2TGL_TGL1_TGL                (0x1   << 1  )

/* GP2TGL[TGL0] - Toggle the output of the port pin */
#define GP2TGL_TGL0_BBA                (*(volatile unsigned long *) 0x42401400)
#define GP2TGL_TGL0_MSK                (0x1   << 0  )
#define GP2TGL_TGL0                    (0x1   << 0  )
#define GP2TGL_TGL0_TGL                (0x1   << 0  )

/* Reset Value for GP2ODE*/
#define GP2ODE_RVAL                    0x0 

/* GP2ODE[ODE7] - Open drain enable */
#define GP2ODE_ODE7_BBA                (*(volatile unsigned long *) 0x4240149C)
#define GP2ODE_ODE7_MSK                (0x1   << 7  )
#define GP2ODE_ODE7                    (0x1   << 7  )
#define GP2ODE_ODE7_DIS                (0x0   << 7  )
#define GP2ODE_ODE7_EN                 (0x1   << 7  )

/* GP2ODE[ODE6] - Open drain enable */
#define GP2ODE_ODE6_BBA                (*(volatile unsigned long *) 0x42401498)
#define GP2ODE_ODE6_MSK                (0x1   << 6  )
#define GP2ODE_ODE6                    (0x1   << 6  )
#define GP2ODE_ODE6_DIS                (0x0   << 6  )
#define GP2ODE_ODE6_EN                 (0x1   << 6  )

/* GP2ODE[ODE5] - Open drain enable */
#define GP2ODE_ODE5_BBA                (*(volatile unsigned long *) 0x42401494)
#define GP2ODE_ODE5_MSK                (0x1   << 5  )
#define GP2ODE_ODE5                    (0x1   << 5  )
#define GP2ODE_ODE5_DIS                (0x0   << 5  )
#define GP2ODE_ODE5_EN                 (0x1   << 5  )

/* GP2ODE[ODE4] - Open drain enable */
#define GP2ODE_ODE4_BBA                (*(volatile unsigned long *) 0x42401490)
#define GP2ODE_ODE4_MSK                (0x1   << 4  )
#define GP2ODE_ODE4                    (0x1   << 4  )
#define GP2ODE_ODE4_DIS                (0x0   << 4  )
#define GP2ODE_ODE4_EN                 (0x1   << 4  )

/* GP2ODE[ODE3] - Open drain enable */
#define GP2ODE_ODE3_BBA                (*(volatile unsigned long *) 0x4240148C)
#define GP2ODE_ODE3_MSK                (0x1   << 3  )
#define GP2ODE_ODE3                    (0x1   << 3  )
#define GP2ODE_ODE3_DIS                (0x0   << 3  )
#define GP2ODE_ODE3_EN                 (0x1   << 3  )

/* GP2ODE[ODE2] - Open drain enable */
#define GP2ODE_ODE2_BBA                (*(volatile unsigned long *) 0x42401488)
#define GP2ODE_ODE2_MSK                (0x1   << 2  )
#define GP2ODE_ODE2                    (0x1   << 2  )
#define GP2ODE_ODE2_DIS                (0x0   << 2  )
#define GP2ODE_ODE2_EN                 (0x1   << 2  )

/* GP2ODE[ODE1] - Open drain enable */
#define GP2ODE_ODE1_BBA                (*(volatile unsigned long *) 0x42401484)
#define GP2ODE_ODE1_MSK                (0x1   << 1  )
#define GP2ODE_ODE1                    (0x1   << 1  )
#define GP2ODE_ODE1_DIS                (0x0   << 1  )
#define GP2ODE_ODE1_EN                 (0x1   << 1  )

/* GP2ODE[ODE0] - Open drain enable */
#define GP2ODE_ODE0_BBA                (*(volatile unsigned long *) 0x42401480)
#define GP2ODE_ODE0_MSK                (0x1   << 0  )
#define GP2ODE_ODE0                    (0x1   << 0  )
#define GP2ODE_ODE0_DIS                (0x0   << 0  )
#define GP2ODE_ODE0_EN                 (0x1   << 0  )
#if (__NO_MMR_STRUCTS__==1)

#define          GP3CON                                     (*(volatile unsigned short int *) 0x400200C0)
#define          GP3OE                                      (*(volatile unsigned char      *) 0x400200C4)
#define          GP3PUL                                     (*(volatile unsigned char      *) 0x400200C8)
#define          GP3IE                                      (*(volatile unsigned char      *) 0x400200CC)
#define          GP3IN                                      (*(volatile unsigned char      *) 0x400200D0)
#define          GP3OUT                                     (*(volatile unsigned char      *) 0x400200D4)
#define          GP3SET                                     (*(volatile unsigned char      *) 0x400200D8)
#define          GP3CLR                                     (*(volatile unsigned char      *) 0x400200DC)
#define          GP3TGL                                     (*(volatile unsigned char      *) 0x400200E0)
#define          GP3ODE                                     (*(volatile unsigned char      *) 0x400200E4)
#endif // (__NO_MMR_STRUCTS__==1)

/* Reset Value for GP3CON*/
#define GP3CON_RVAL                    0x0 

