koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm320i.h
/* GP4CON[CON6] - p4.6  configuration bits */
#define GP4CON_CON6_MSK                (0x3   << 12 )

/* GP4CON[CON5] - p4.5  configuration bits */
#define GP4CON_CON5_MSK                (0x3   << 10 )

/* GP4CON[CON4] - p4.4  configuration bits */
#define GP4CON_CON4_MSK                (0x3   << 8  )

/* GP4CON[CON3] - p4.3  configuration bits */
#define GP4CON_CON3_MSK                (0x3   << 6  )

/* GP4CON[CON2] - p4.2  configuration bits */
#define GP4CON_CON2_MSK                (0x3   << 4  )

/* GP4CON[CON1] - p4.1  configuration bits */
#define GP4CON_CON1_MSK                (0x3   << 2  )

/* GP4CON[CON0] - p4.0  configuration bits */
#define GP4CON_CON0_MSK                (0x3   << 0  )
#define GP4CON_CON0_GPIO               (0x0   << 0  ) /* GPIO                     */

/* Reset Value for GP4OE*/
#define GP4OE_RVAL                     0x0 

/* GP4OE[OE7] - Pin Output Drive enable */
#define GP4OE_OE7_BBA                  (*(volatile unsigned long *) 0x4240209C)
#define GP4OE_OE7_MSK                  (0x1   << 7  )
#define GP4OE_OE7                      (0x1   << 7  )
#define GP4OE_OE7_DIS                  (0x0   << 7  )
#define GP4OE_OE7_EN                   (0x1   << 7  )

/* GP4OE[OE6] - Pin Output Drive enable */
#define GP4OE_OE6_BBA                  (*(volatile unsigned long *) 0x42402098)
#define GP4OE_OE6_MSK                  (0x1   << 6  )
#define GP4OE_OE6                      (0x1   << 6  )
#define GP4OE_OE6_DIS                  (0x0   << 6  )
#define GP4OE_OE6_EN                   (0x1   << 6  )

/* GP4OE[OE5] - Pin Output Drive enable */
#define GP4OE_OE5_BBA                  (*(volatile unsigned long *) 0x42402094)
#define GP4OE_OE5_MSK                  (0x1   << 5  )
#define GP4OE_OE5                      (0x1   << 5  )
#define GP4OE_OE5_DIS                  (0x0   << 5  )
#define GP4OE_OE5_EN                   (0x1   << 5  )

/* GP4OE[OE4] - Pin Output Drive enable */
#define GP4OE_OE4_BBA                  (*(volatile unsigned long *) 0x42402090)
#define GP4OE_OE4_MSK                  (0x1   << 4  )
#define GP4OE_OE4                      (0x1   << 4  )
#define GP4OE_OE4_DIS                  (0x0   << 4  )
#define GP4OE_OE4_EN                   (0x1   << 4  )

/* GP4OE[OE3] - Pin Output Drive enable */
#define GP4OE_OE3_BBA                  (*(volatile unsigned long *) 0x4240208C)
#define GP4OE_OE3_MSK                  (0x1   << 3  )
#define GP4OE_OE3                      (0x1   << 3  )
#define GP4OE_OE3_DIS                  (0x0   << 3  )
#define GP4OE_OE3_EN                   (0x1   << 3  )

/* GP4OE[OE2] - Pin Output Drive enable */
#define GP4OE_OE2_BBA                  (*(volatile unsigned long *) 0x42402088)
#define GP4OE_OE2_MSK                  (0x1   << 2  )
#define GP4OE_OE2                      (0x1   << 2  )
#define GP4OE_OE2_DIS                  (0x0   << 2  )
#define GP4OE_OE2_EN                   (0x1   << 2  )

/* GP4OE[OE1] - Pin Output Drive enable */
#define GP4OE_OE1_BBA                  (*(volatile unsigned long *) 0x42402084)
#define GP4OE_OE1_MSK                  (0x1   << 1  )
#define GP4OE_OE1                      (0x1   << 1  )
#define GP4OE_OE1_DIS                  (0x0   << 1  )
#define GP4OE_OE1_EN                   (0x1   << 1  )

/* GP4OE[OE0] - Pin Output Drive enable */
#define GP4OE_OE0_BBA                  (*(volatile unsigned long *) 0x42402080)
#define GP4OE_OE0_MSK                  (0x1   << 0  )
#define GP4OE_OE0                      (0x1   << 0  )
#define GP4OE_OE0_DIS                  (0x0   << 0  )
#define GP4OE_OE0_EN                   (0x1   << 0  )

/* Reset Value for GP4PUL*/
#define GP4PUL_RVAL                    0x0 

/* GP4PUL[PUL7] - Pin Pull down enable */
#define GP4PUL_PUL7_BBA                (*(volatile unsigned long *) 0x4240211C)
#define GP4PUL_PUL7_MSK                (0x1   << 7  )
#define GP4PUL_PUL7                    (0x1   << 7  )
#define GP4PUL_PUL7_DIS                (0x0   << 7  )
#define GP4PUL_PUL7_EN                 (0x1   << 7  )

/* GP4PUL[PUL6] - Pin Pull down enable */
#define GP4PUL_PUL6_BBA                (*(volatile unsigned long *) 0x42402118)
#define GP4PUL_PUL6_MSK                (0x1   << 6  )
#define GP4PUL_PUL6                    (0x1   << 6  )
#define GP4PUL_PUL6_DIS                (0x0   << 6  )
#define GP4PUL_PUL6_EN                 (0x1   << 6  )

/* GP4PUL[PUL5] - Pin Pull down enable */
#define GP4PUL_PUL5_BBA                (*(volatile unsigned long *) 0x42402114)
#define GP4PUL_PUL5_MSK                (0x1   << 5  )
#define GP4PUL_PUL5                    (0x1   << 5  )
#define GP4PUL_PUL5_DIS                (0x0   << 5  )
#define GP4PUL_PUL5_EN                 (0x1   << 5  )

/* GP4PUL[PUL4] - Pin Pull down enable */
#define GP4PUL_PUL4_BBA                (*(volatile unsigned long *) 0x42402110)
#define GP4PUL_PUL4_MSK                (0x1   << 4  )
#define GP4PUL_PUL4                    (0x1   << 4  )
#define GP4PUL_PUL4_DIS                (0x0   << 4  )
#define GP4PUL_PUL4_EN                 (0x1   << 4  )

/* GP4PUL[PUL3] - Pin Pull down enable */
#define GP4PUL_PUL3_BBA                (*(volatile unsigned long *) 0x4240210C)
#define GP4PUL_PUL3_MSK                (0x1   << 3  )
#define GP4PUL_PUL3                    (0x1   << 3  )
#define GP4PUL_PUL3_DIS                (0x0   << 3  )
#define GP4PUL_PUL3_EN                 (0x1   << 3  )

/* GP4PUL[PUL2] - Pin Pull down enable */
#define GP4PUL_PUL2_BBA                (*(volatile unsigned long *) 0x42402108)
#define GP4PUL_PUL2_MSK                (0x1   << 2  )
#define GP4PUL_PUL2                    (0x1   << 2  )
#define GP4PUL_PUL2_DIS                (0x0   << 2  )
#define GP4PUL_PUL2_EN                 (0x1   << 2  )

/* GP4PUL[PUL1] - Pin Pull down enable */
#define GP4PUL_PUL1_BBA                (*(volatile unsigned long *) 0x42402104)
#define GP4PUL_PUL1_MSK                (0x1   << 1  )
#define GP4PUL_PUL1                    (0x1   << 1  )
#define GP4PUL_PUL1_DIS                (0x0   << 1  )
#define GP4PUL_PUL1_EN                 (0x1   << 1  )

/* GP4PUL[PUL0] - Pin Pull down enable */
#define GP4PUL_PUL0_BBA                (*(volatile unsigned long *) 0x42402100)
#define GP4PUL_PUL0_MSK                (0x1   << 0  )
#define GP4PUL_PUL0                    (0x1   << 0  )
#define GP4PUL_PUL0_DIS                (0x0   << 0  )
#define GP4PUL_PUL0_EN                 (0x1   << 0  )

/* Reset Value for GP4IE*/
#define GP4IE_RVAL                     0x0 

