koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm320i.h
/* GP4IE[IEN7] - Input path enable */
#define GP4IE_IEN7_BBA                 (*(volatile unsigned long *) 0x4240219C)
#define GP4IE_IEN7_MSK                 (0x1   << 7  )
#define GP4IE_IEN7                     (0x1   << 7  )
#define GP4IE_IEN7_DIS                 (0x0   << 7  )
#define GP4IE_IEN7_EN                  (0x1   << 7  )

/* GP4IE[IEN6] - Input path enable */
#define GP4IE_IEN6_BBA                 (*(volatile unsigned long *) 0x42402198)
#define GP4IE_IEN6_MSK                 (0x1   << 6  )
#define GP4IE_IEN6                     (0x1   << 6  )
#define GP4IE_IEN6_DIS                 (0x0   << 6  )
#define GP4IE_IEN6_EN                  (0x1   << 6  )

/* GP4IE[IEN5] - Input path enable */
#define GP4IE_IEN5_BBA                 (*(volatile unsigned long *) 0x42402194)
#define GP4IE_IEN5_MSK                 (0x1   << 5  )
#define GP4IE_IEN5                     (0x1   << 5  )
#define GP4IE_IEN5_DIS                 (0x0   << 5  )
#define GP4IE_IEN5_EN                  (0x1   << 5  )

/* GP4IE[IEN4] - Input path enable */
#define GP4IE_IEN4_BBA                 (*(volatile unsigned long *) 0x42402190)
#define GP4IE_IEN4_MSK                 (0x1   << 4  )
#define GP4IE_IEN4                     (0x1   << 4  )
#define GP4IE_IEN4_DIS                 (0x0   << 4  )
#define GP4IE_IEN4_EN                  (0x1   << 4  )

/* GP4IE[IEN3] - Input path enable */
#define GP4IE_IEN3_BBA                 (*(volatile unsigned long *) 0x4240218C)
#define GP4IE_IEN3_MSK                 (0x1   << 3  )
#define GP4IE_IEN3                     (0x1   << 3  )
#define GP4IE_IEN3_DIS                 (0x0   << 3  )
#define GP4IE_IEN3_EN                  (0x1   << 3  )

/* GP4IE[IEN2] - Input path enable */
#define GP4IE_IEN2_BBA                 (*(volatile unsigned long *) 0x42402188)
#define GP4IE_IEN2_MSK                 (0x1   << 2  )
#define GP4IE_IEN2                     (0x1   << 2  )
#define GP4IE_IEN2_DIS                 (0x0   << 2  )
#define GP4IE_IEN2_EN                  (0x1   << 2  )

/* GP4IE[IEN1] - Input path enable */
#define GP4IE_IEN1_BBA                 (*(volatile unsigned long *) 0x42402184)
#define GP4IE_IEN1_MSK                 (0x1   << 1  )
#define GP4IE_IEN1                     (0x1   << 1  )
#define GP4IE_IEN1_DIS                 (0x0   << 1  )
#define GP4IE_IEN1_EN                  (0x1   << 1  )

/* GP4IE[IEN0] - Input path enable */
#define GP4IE_IEN0_BBA                 (*(volatile unsigned long *) 0x42402180)
#define GP4IE_IEN0_MSK                 (0x1   << 0  )
#define GP4IE_IEN0                     (0x1   << 0  )
#define GP4IE_IEN0_DIS                 (0x0   << 0  )
#define GP4IE_IEN0_EN                  (0x1   << 0  )

/* Reset Value for GP4IN*/
#define GP4IN_RVAL                     0x0 

/* GP4IN[IN7] - Registered data input */
#define GP4IN_IN7_BBA                  (*(volatile unsigned long *) 0x4240221C)
#define GP4IN_IN7_MSK                  (0x1   << 7  )
#define GP4IN_IN7                      (0x1   << 7  )
#define GP4IN_IN7_LOW                  (0x0   << 7  )
#define GP4IN_IN7_HIGH                 (0x1   << 7  )

/* GP4IN[IN6] - Registered data input */
#define GP4IN_IN6_BBA                  (*(volatile unsigned long *) 0x42402218)
#define GP4IN_IN6_MSK                  (0x1   << 6  )
#define GP4IN_IN6                      (0x1   << 6  )
#define GP4IN_IN6_LOW                  (0x0   << 6  )
#define GP4IN_IN6_HIGH                 (0x1   << 6  )

/* GP4IN[IN5] - Registered data input */
#define GP4IN_IN5_BBA                  (*(volatile unsigned long *) 0x42402214)
#define GP4IN_IN5_MSK                  (0x1   << 5  )
#define GP4IN_IN5                      (0x1   << 5  )
#define GP4IN_IN5_LOW                  (0x0   << 5  )
#define GP4IN_IN5_HIGH                 (0x1   << 5  )

/* GP4IN[IN4] - Registered data input */
#define GP4IN_IN4_BBA                  (*(volatile unsigned long *) 0x42402210)
#define GP4IN_IN4_MSK                  (0x1   << 4  )
#define GP4IN_IN4                      (0x1   << 4  )
#define GP4IN_IN4_LOW                  (0x0   << 4  )
#define GP4IN_IN4_HIGH                 (0x1   << 4  )

/* GP4IN[IN3] - Registered data input */
#define GP4IN_IN3_BBA                  (*(volatile unsigned long *) 0x4240220C)
#define GP4IN_IN3_MSK                  (0x1   << 3  )
#define GP4IN_IN3                      (0x1   << 3  )
#define GP4IN_IN3_LOW                  (0x0   << 3  )
#define GP4IN_IN3_HIGH                 (0x1   << 3  )

/* GP4IN[IN2] - Registered data input */
#define GP4IN_IN2_BBA                  (*(volatile unsigned long *) 0x42402208)
#define GP4IN_IN2_MSK                  (0x1   << 2  )
#define GP4IN_IN2                      (0x1   << 2  )
#define GP4IN_IN2_LOW                  (0x0   << 2  )
#define GP4IN_IN2_HIGH                 (0x1   << 2  )

/* GP4IN[IN1] - Registered data input */
#define GP4IN_IN1_BBA                  (*(volatile unsigned long *) 0x42402204)
#define GP4IN_IN1_MSK                  (0x1   << 1  )
#define GP4IN_IN1                      (0x1   << 1  )
#define GP4IN_IN1_LOW                  (0x0   << 1  )
#define GP4IN_IN1_HIGH                 (0x1   << 1  )

/* GP4IN[IN0] - Registered data input */
#define GP4IN_IN0_BBA                  (*(volatile unsigned long *) 0x42402200)
#define GP4IN_IN0_MSK                  (0x1   << 0  )
#define GP4IN_IN0                      (0x1   << 0  )
#define GP4IN_IN0_LOW                  (0x0   << 0  )
#define GP4IN_IN0_HIGH                 (0x1   << 0  )

/* Reset Value for GP4OUT*/
#define GP4OUT_RVAL                    0x0 

/* GP4OUT[OUT7] - Data out */
#define GP4OUT_OUT7_BBA                (*(volatile unsigned long *) 0x4240229C)
#define GP4OUT_OUT7_MSK                (0x1   << 7  )
#define GP4OUT_OUT7                    (0x1   << 7  )
#define GP4OUT_OUT7_LOW                (0x0   << 7  )
#define GP4OUT_OUT7_HIGH               (0x1   << 7  )

/* GP4OUT[OUT6] - Data out */
#define GP4OUT_OUT6_BBA                (*(volatile unsigned long *) 0x42402298)
#define GP4OUT_OUT6_MSK                (0x1   << 6  )
#define GP4OUT_OUT6                    (0x1   << 6  )
#define GP4OUT_OUT6_LOW                (0x0   << 6  )
#define GP4OUT_OUT6_HIGH               (0x1   << 6  )

/* GP4OUT[OUT5] - Data out */
#define GP4OUT_OUT5_BBA                (*(volatile unsigned long *) 0x42402294)
#define GP4OUT_OUT5_MSK                (0x1   << 5  )
#define GP4OUT_OUT5                    (0x1   << 5  )
#define GP4OUT_OUT5_LOW                (0x0   << 5  )
#define GP4OUT_OUT5_HIGH               (0x1   << 5  )

