koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm320i.h
/* GP4OUT[OUT4] - Data out */
#define GP4OUT_OUT4_BBA                (*(volatile unsigned long *) 0x42402290)
#define GP4OUT_OUT4_MSK                (0x1   << 4  )
#define GP4OUT_OUT4                    (0x1   << 4  )
#define GP4OUT_OUT4_LOW                (0x0   << 4  )
#define GP4OUT_OUT4_HIGH               (0x1   << 4  )

/* GP4OUT[OUT3] - Data out */
#define GP4OUT_OUT3_BBA                (*(volatile unsigned long *) 0x4240228C)
#define GP4OUT_OUT3_MSK                (0x1   << 3  )
#define GP4OUT_OUT3                    (0x1   << 3  )
#define GP4OUT_OUT3_LOW                (0x0   << 3  )
#define GP4OUT_OUT3_HIGH               (0x1   << 3  )

/* GP4OUT[OUT2] - Data out */
#define GP4OUT_OUT2_BBA                (*(volatile unsigned long *) 0x42402288)
#define GP4OUT_OUT2_MSK                (0x1   << 2  )
#define GP4OUT_OUT2                    (0x1   << 2  )
#define GP4OUT_OUT2_LOW                (0x0   << 2  )
#define GP4OUT_OUT2_HIGH               (0x1   << 2  )

/* GP4OUT[OUT1] - Data out */
#define GP4OUT_OUT1_BBA                (*(volatile unsigned long *) 0x42402284)
#define GP4OUT_OUT1_MSK                (0x1   << 1  )
#define GP4OUT_OUT1                    (0x1   << 1  )
#define GP4OUT_OUT1_LOW                (0x0   << 1  )
#define GP4OUT_OUT1_HIGH               (0x1   << 1  )

/* GP4OUT[OUT0] - Data out */
#define GP4OUT_OUT0_BBA                (*(volatile unsigned long *) 0x42402280)
#define GP4OUT_OUT0_MSK                (0x1   << 0  )
#define GP4OUT_OUT0                    (0x1   << 0  )
#define GP4OUT_OUT0_LOW                (0x0   << 0  )
#define GP4OUT_OUT0_HIGH               (0x1   << 0  )

/* Reset Value for GP4SET*/
#define GP4SET_RVAL                    0x0 

/* GP4SET[SET7] - Set the output HIGH for the pin */
#define GP4SET_SET7_BBA                (*(volatile unsigned long *) 0x4240231C)
#define GP4SET_SET7_MSK                (0x1   << 7  )
#define GP4SET_SET7                    (0x1   << 7  )
#define GP4SET_SET7_SET                (0x1   << 7  )

/* GP4SET[SET6] - Set the output HIGH for the pin */
#define GP4SET_SET6_BBA                (*(volatile unsigned long *) 0x42402318)
#define GP4SET_SET6_MSK                (0x1   << 6  )
#define GP4SET_SET6                    (0x1   << 6  )
#define GP4SET_SET6_SET                (0x1   << 6  )

/* GP4SET[SET5] - Set the output HIGH for the pin */
#define GP4SET_SET5_BBA                (*(volatile unsigned long *) 0x42402314)
#define GP4SET_SET5_MSK                (0x1   << 5  )
#define GP4SET_SET5                    (0x1   << 5  )
#define GP4SET_SET5_SET                (0x1   << 5  )

/* GP4SET[SET4] - Set the output HIGH for the pin */
#define GP4SET_SET4_BBA                (*(volatile unsigned long *) 0x42402310)
#define GP4SET_SET4_MSK                (0x1   << 4  )
#define GP4SET_SET4                    (0x1   << 4  )
#define GP4SET_SET4_SET                (0x1   << 4  )

/* GP4SET[SET3] - Set the output HIGH for the pin */
#define GP4SET_SET3_BBA                (*(volatile unsigned long *) 0x4240230C)
#define GP4SET_SET3_MSK                (0x1   << 3  )
#define GP4SET_SET3                    (0x1   << 3  )
#define GP4SET_SET3_SET                (0x1   << 3  )

/* GP4SET[SET2] - Set the output HIGH for the pin */
#define GP4SET_SET2_BBA                (*(volatile unsigned long *) 0x42402308)
#define GP4SET_SET2_MSK                (0x1   << 2  )
#define GP4SET_SET2                    (0x1   << 2  )
#define GP4SET_SET2_SET                (0x1   << 2  )

/* GP4SET[SET1] - Set the output HIGH for the pin */
#define GP4SET_SET1_BBA                (*(volatile unsigned long *) 0x42402304)
#define GP4SET_SET1_MSK                (0x1   << 1  )
#define GP4SET_SET1                    (0x1   << 1  )
#define GP4SET_SET1_SET                (0x1   << 1  )

/* GP4SET[SET0] - Set the output HIGH for the pin */
#define GP4SET_SET0_BBA                (*(volatile unsigned long *) 0x42402300)
#define GP4SET_SET0_MSK                (0x1   << 0  )
#define GP4SET_SET0                    (0x1   << 0  )
#define GP4SET_SET0_SET                (0x1   << 0  )

/* Reset Value for GP4CLR*/
#define GP4CLR_RVAL                    0x0 

/* GP4CLR[CLR7] - Set the output low  for the port pin */
#define GP4CLR_CLR7_BBA                (*(volatile unsigned long *) 0x4240239C)
#define GP4CLR_CLR7_MSK                (0x1   << 7  )
#define GP4CLR_CLR7                    (0x1   << 7  )
#define GP4CLR_CLR7_CLR                (0x1   << 7  )

/* GP4CLR[CLR6] - Set the output low  for the port pin */
#define GP4CLR_CLR6_BBA                (*(volatile unsigned long *) 0x42402398)
#define GP4CLR_CLR6_MSK                (0x1   << 6  )
#define GP4CLR_CLR6                    (0x1   << 6  )
#define GP4CLR_CLR6_CLR                (0x1   << 6  )

/* GP4CLR[CLR5] - Set the output low  for the port pin */
#define GP4CLR_CLR5_BBA                (*(volatile unsigned long *) 0x42402394)
#define GP4CLR_CLR5_MSK                (0x1   << 5  )
#define GP4CLR_CLR5                    (0x1   << 5  )
#define GP4CLR_CLR5_CLR                (0x1   << 5  )

/* GP4CLR[CLR4] - Set the output low  for the port pin */
#define GP4CLR_CLR4_BBA                (*(volatile unsigned long *) 0x42402390)
#define GP4CLR_CLR4_MSK                (0x1   << 4  )
#define GP4CLR_CLR4                    (0x1   << 4  )
#define GP4CLR_CLR4_CLR                (0x1   << 4  )

/* GP4CLR[CLR3] - Set the output low  for the port pin */
#define GP4CLR_CLR3_BBA                (*(volatile unsigned long *) 0x4240238C)
#define GP4CLR_CLR3_MSK                (0x1   << 3  )
#define GP4CLR_CLR3                    (0x1   << 3  )
#define GP4CLR_CLR3_CLR                (0x1   << 3  )

/* GP4CLR[CLR2] - Set the output low  for the port pin */
#define GP4CLR_CLR2_BBA                (*(volatile unsigned long *) 0x42402388)
#define GP4CLR_CLR2_MSK                (0x1   << 2  )
#define GP4CLR_CLR2                    (0x1   << 2  )
#define GP4CLR_CLR2_CLR                (0x1   << 2  )

/* GP4CLR[CLR1] - Set the output low  for the port pin */
#define GP4CLR_CLR1_BBA                (*(volatile unsigned long *) 0x42402384)
#define GP4CLR_CLR1_MSK                (0x1   << 1  )
#define GP4CLR_CLR1                    (0x1   << 1  )
#define GP4CLR_CLR1_CLR                (0x1   << 1  )

/* GP4CLR[CLR0] - Set the output low  for the port pin */
#define GP4CLR_CLR0_BBA                (*(volatile unsigned long *) 0x42402380)
#define GP4CLR_CLR0_MSK                (0x1   << 0  )
#define GP4CLR_CLR0                    (0x1   << 0  )
#define GP4CLR_CLR0_CLR                (0x1   << 0  )

