koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm320i.h
/* GP5CON[CON3] - p5.3  configuration bits */
#define GP5CON_CON3_MSK                (0x3   << 6  )
#define GP5CON_CON3_GPIO               (0x0   << 6  ) /* GPIO                     */
#define GP5CON_CON3_VDAC0              (0x1   << 6  ) /* VDAC0                    */

/* GP5CON[CON2] - p5.2  configuration bits */
#define GP5CON_CON2_MSK                (0x3   << 4  )
#define GP5CON_CON2_GPIO               (0x0   << 4  ) /* GPIO                     */
#define GP5CON_CON2_VDAC7              (0x1   << 4  ) /* VDAC7                    */

/* GP5CON[CON1] - p5.1  configuration bits */
#define GP5CON_CON1_MSK                (0x3   << 2  )
#define GP5CON_CON1_GPIO               (0x0   << 2  ) /* GPIO                     */
#define GP5CON_CON1_VDAC6              (0x1   << 2  ) /* VDAC6                    */

/* GP5CON[CON0] - p5.0  configuration bits */
#define GP5CON_CON0_MSK                (0x3   << 0  )
#define GP5CON_CON0_GPIO               (0x0   << 0  ) /* GPIO                     */
#define GP5CON_CON0_VDAC3              (0x1   << 0  ) /* VDAC3                    */

/* Reset Value for GP5OE*/
#define GP5OE_RVAL                     0x0 

/* GP5OE[OE3] - Pin Output Drive enable */
#define GP5OE_OE3_BBA                  (*(volatile unsigned long *) 0x4240488C)
#define GP5OE_OE3_MSK                  (0x1   << 3  )
#define GP5OE_OE3                      (0x1   << 3  )
#define GP5OE_OE3_DIS                  (0x0   << 3  )
#define GP5OE_OE3_EN                   (0x1   << 3  )

/* GP5OE[OE2] - Pin Output Drive enable */
#define GP5OE_OE2_BBA                  (*(volatile unsigned long *) 0x42404888)
#define GP5OE_OE2_MSK                  (0x1   << 2  )
#define GP5OE_OE2                      (0x1   << 2  )
#define GP5OE_OE2_DIS                  (0x0   << 2  )
#define GP5OE_OE2_EN                   (0x1   << 2  )

/* GP5OE[OE1] - Pin Output Drive enable */
#define GP5OE_OE1_BBA                  (*(volatile unsigned long *) 0x42404884)
#define GP5OE_OE1_MSK                  (0x1   << 1  )
#define GP5OE_OE1                      (0x1   << 1  )
#define GP5OE_OE1_DIS                  (0x0   << 1  )
#define GP5OE_OE1_EN                   (0x1   << 1  )

/* GP5OE[OE0] - Pin Output Drive enable */
#define GP5OE_OE0_BBA                  (*(volatile unsigned long *) 0x42404880)
#define GP5OE_OE0_MSK                  (0x1   << 0  )
#define GP5OE_OE0                      (0x1   << 0  )
#define GP5OE_OE0_DIS                  (0x0   << 0  )
#define GP5OE_OE0_EN                   (0x1   << 0  )

/* Reset Value for GP5PUL*/
#define GP5PUL_RVAL                    0x0 

/* GP5PUL[PUL3] - Pin Pull down enable */
#define GP5PUL_PUL3_BBA                (*(volatile unsigned long *) 0x4240490C)
#define GP5PUL_PUL3_MSK                (0x1   << 3  )
#define GP5PUL_PUL3                    (0x1   << 3  )
#define GP5PUL_PUL3_DIS                (0x0   << 3  )
#define GP5PUL_PUL3_EN                 (0x1   << 3  )

/* GP5PUL[PUL2] - Pin Pull down enable */
#define GP5PUL_PUL2_BBA                (*(volatile unsigned long *) 0x42404908)
#define GP5PUL_PUL2_MSK                (0x1   << 2  )
#define GP5PUL_PUL2                    (0x1   << 2  )
#define GP5PUL_PUL2_DIS                (0x0   << 2  )
#define GP5PUL_PUL2_EN                 (0x1   << 2  )

/* GP5PUL[PUL1] - Pin Pull down enable */
#define GP5PUL_PUL1_BBA                (*(volatile unsigned long *) 0x42404904)
#define GP5PUL_PUL1_MSK                (0x1   << 1  )
#define GP5PUL_PUL1                    (0x1   << 1  )
#define GP5PUL_PUL1_DIS                (0x0   << 1  )
#define GP5PUL_PUL1_EN                 (0x1   << 1  )

/* GP5PUL[PUL0] - Pin Pull down enable */
#define GP5PUL_PUL0_BBA                (*(volatile unsigned long *) 0x42404900)
#define GP5PUL_PUL0_MSK                (0x1   << 0  )
#define GP5PUL_PUL0                    (0x1   << 0  )
#define GP5PUL_PUL0_DIS                (0x0   << 0  )
#define GP5PUL_PUL0_EN                 (0x1   << 0  )

/* Reset Value for GP5IE*/
#define GP5IE_RVAL                     0x0 

/* GP5IE[IEN3] - Input path enable */
#define GP5IE_IEN3_BBA                 (*(volatile unsigned long *) 0x4240498C)
#define GP5IE_IEN3_MSK                 (0x1   << 3  )
#define GP5IE_IEN3                     (0x1   << 3  )
#define GP5IE_IEN3_DIS                 (0x0   << 3  )
#define GP5IE_IEN3_EN                  (0x1   << 3  )

/* GP5IE[IEN2] - Input path enable */
#define GP5IE_IEN2_BBA                 (*(volatile unsigned long *) 0x42404988)
#define GP5IE_IEN2_MSK                 (0x1   << 2  )
#define GP5IE_IEN2                     (0x1   << 2  )
#define GP5IE_IEN2_DIS                 (0x0   << 2  )
#define GP5IE_IEN2_EN                  (0x1   << 2  )

/* GP5IE[IEN1] - Input path enable */
#define GP5IE_IEN1_BBA                 (*(volatile unsigned long *) 0x42404984)
#define GP5IE_IEN1_MSK                 (0x1   << 1  )
#define GP5IE_IEN1                     (0x1   << 1  )
#define GP5IE_IEN1_DIS                 (0x0   << 1  )
#define GP5IE_IEN1_EN                  (0x1   << 1  )

/* GP5IE[IEN0] - Input path enable */
#define GP5IE_IEN0_BBA                 (*(volatile unsigned long *) 0x42404980)
#define GP5IE_IEN0_MSK                 (0x1   << 0  )
#define GP5IE_IEN0                     (0x1   << 0  )
#define GP5IE_IEN0_DIS                 (0x0   << 0  )
#define GP5IE_IEN0_EN                  (0x1   << 0  )

/* Reset Value for GP5IN*/
#define GP5IN_RVAL                     0x0 

/* GP5IN[IN3] - Registered data input */
#define GP5IN_IN3_BBA                  (*(volatile unsigned long *) 0x42404A0C)
#define GP5IN_IN3_MSK                  (0x1   << 3  )
#define GP5IN_IN3                      (0x1   << 3  )
#define GP5IN_IN3_LOW                  (0x0   << 3  )
#define GP5IN_IN3_HIGH                 (0x1   << 3  )

/* GP5IN[IN2] - Registered data input */
#define GP5IN_IN2_BBA                  (*(volatile unsigned long *) 0x42404A08)
#define GP5IN_IN2_MSK                  (0x1   << 2  )
#define GP5IN_IN2                      (0x1   << 2  )
#define GP5IN_IN2_LOW                  (0x0   << 2  )
#define GP5IN_IN2_HIGH                 (0x1   << 2  )

/* GP5IN[IN1] - Registered data input */
#define GP5IN_IN1_BBA                  (*(volatile unsigned long *) 0x42404A04)
#define GP5IN_IN1_MSK                  (0x1   << 1  )
#define GP5IN_IN1                      (0x1   << 1  )
#define GP5IN_IN1_LOW                  (0x0   << 1  )
#define GP5IN_IN1_HIGH                 (0x1   << 1  )

/* GP5IN[IN0] - Registered data input */
#define GP5IN_IN0_BBA                  (*(volatile unsigned long *) 0x42404A00)
#define GP5IN_IN0_MSK                  (0x1   << 0  )
#define GP5IN_IN0                      (0x1   << 0  )
#define GP5IN_IN0_LOW                  (0x0   << 0  )
#define GP5IN_IN0_HIGH                 (0x1   << 0  )

/* Reset Value for GP5OUT*/
#define GP5OUT_RVAL                    0x0 

/* GP5OUT[OUT3] - Data out */
#define GP5OUT_OUT3_BBA                (*(volatile unsigned long *) 0x42404A8C)
#define GP5OUT_OUT3_MSK                (0x1   << 3  )
#define GP5OUT_OUT3                    (0x1   << 3  )
#define GP5OUT_OUT3_LOW                (0x0   << 3  )
#define GP5OUT_OUT3_HIGH               (0x1   << 3  )

/* GP5OUT[OUT2] - Data out */
#define GP5OUT_OUT2_BBA                (*(volatile unsigned long *) 0x42404A88)
#define GP5OUT_OUT2_MSK                (0x1   << 2  )
#define GP5OUT_OUT2                    (0x1   << 2  )
#define GP5OUT_OUT2_LOW                (0x0   << 2  )
#define GP5OUT_OUT2_HIGH               (0x1   << 2  )

/* GP5OUT[OUT1] - Data out */
#define GP5OUT_OUT1_BBA                (*(volatile unsigned long *) 0x42404A84)
#define GP5OUT_OUT1_MSK                (0x1   << 1  )
#define GP5OUT_OUT1                    (0x1   << 1  )
#define GP5OUT_OUT1_LOW                (0x0   << 1  )
#define GP5OUT_OUT1_HIGH               (0x1   << 1  )

