koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm320i.h
/* GP5OUT[OUT0] - Data out */
#define GP5OUT_OUT0_BBA                (*(volatile unsigned long *) 0x42404A80)
#define GP5OUT_OUT0_MSK                (0x1   << 0  )
#define GP5OUT_OUT0                    (0x1   << 0  )
#define GP5OUT_OUT0_LOW                (0x0   << 0  )
#define GP5OUT_OUT0_HIGH               (0x1   << 0  )

/* Reset Value for GP5SET*/
#define GP5SET_RVAL                    0x0 

/* GP5SET[SET3] - Set the output HIGH for the pin */
#define GP5SET_SET3_BBA                (*(volatile unsigned long *) 0x42404B0C)
#define GP5SET_SET3_MSK                (0x1   << 3  )
#define GP5SET_SET3                    (0x1   << 3  )
#define GP5SET_SET3_SET                (0x1   << 3  )

/* GP5SET[SET2] - Set the output HIGH for the pin */
#define GP5SET_SET2_BBA                (*(volatile unsigned long *) 0x42404B08)
#define GP5SET_SET2_MSK                (0x1   << 2  )
#define GP5SET_SET2                    (0x1   << 2  )
#define GP5SET_SET2_SET                (0x1   << 2  )

/* GP5SET[SET1] - Set the output HIGH for the pin */
#define GP5SET_SET1_BBA                (*(volatile unsigned long *) 0x42404B04)
#define GP5SET_SET1_MSK                (0x1   << 1  )
#define GP5SET_SET1                    (0x1   << 1  )
#define GP5SET_SET1_SET                (0x1   << 1  )

/* GP5SET[SET0] - Set the output HIGH for the pin */
#define GP5SET_SET0_BBA                (*(volatile unsigned long *) 0x42404B00)
#define GP5SET_SET0_MSK                (0x1   << 0  )
#define GP5SET_SET0                    (0x1   << 0  )
#define GP5SET_SET0_SET                (0x1   << 0  )

/* Reset Value for GP5CLR*/
#define GP5CLR_RVAL                    0x0 

/* GP5CLR[CLR3] - Set the output low  for the port pin */
#define GP5CLR_CLR3_BBA                (*(volatile unsigned long *) 0x42404B8C)
#define GP5CLR_CLR3_MSK                (0x1   << 3  )
#define GP5CLR_CLR3                    (0x1   << 3  )
#define GP5CLR_CLR3_CLR                (0x1   << 3  )

/* GP5CLR[CLR2] - Set the output low  for the port pin */
#define GP5CLR_CLR2_BBA                (*(volatile unsigned long *) 0x42404B88)
#define GP5CLR_CLR2_MSK                (0x1   << 2  )
#define GP5CLR_CLR2                    (0x1   << 2  )
#define GP5CLR_CLR2_CLR                (0x1   << 2  )

/* GP5CLR[CLR1] - Set the output low  for the port pin */
#define GP5CLR_CLR1_BBA                (*(volatile unsigned long *) 0x42404B84)
#define GP5CLR_CLR1_MSK                (0x1   << 1  )
#define GP5CLR_CLR1                    (0x1   << 1  )
#define GP5CLR_CLR1_CLR                (0x1   << 1  )

/* GP5CLR[CLR0] - Set the output low  for the port pin */
#define GP5CLR_CLR0_BBA                (*(volatile unsigned long *) 0x42404B80)
#define GP5CLR_CLR0_MSK                (0x1   << 0  )
#define GP5CLR_CLR0                    (0x1   << 0  )
#define GP5CLR_CLR0_CLR                (0x1   << 0  )

/* Reset Value for GP5TGL*/
#define GP5TGL_RVAL                    0x0 

/* GP5TGL[TGL3] - Toggle the output of the port pin */
#define GP5TGL_TGL3_BBA                (*(volatile unsigned long *) 0x42404C0C)
#define GP5TGL_TGL3_MSK                (0x1   << 3  )
#define GP5TGL_TGL3                    (0x1   << 3  )
#define GP5TGL_TGL3_TGL                (0x1   << 3  )

/* GP5TGL[TGL2] - Toggle the output of the port pin */
#define GP5TGL_TGL2_BBA                (*(volatile unsigned long *) 0x42404C08)
#define GP5TGL_TGL2_MSK                (0x1   << 2  )
#define GP5TGL_TGL2                    (0x1   << 2  )
#define GP5TGL_TGL2_TGL                (0x1   << 2  )

/* GP5TGL[TGL1] - Toggle the output of the port pin */
#define GP5TGL_TGL1_BBA                (*(volatile unsigned long *) 0x42404C04)
#define GP5TGL_TGL1_MSK                (0x1   << 1  )
#define GP5TGL_TGL1                    (0x1   << 1  )
#define GP5TGL_TGL1_TGL                (0x1   << 1  )

/* GP5TGL[TGL0] - Toggle the output of the port pin */
#define GP5TGL_TGL0_BBA                (*(volatile unsigned long *) 0x42404C00)
#define GP5TGL_TGL0_MSK                (0x1   << 0  )
#define GP5TGL_TGL0                    (0x1   << 0  )
#define GP5TGL_TGL0_TGL                (0x1   << 0  )

/* Reset Value for GP5ODE*/
#define GP5ODE_RVAL                    0x0 

/* GP5ODE[ODE3] - Open drain enable */
#define GP5ODE_ODE3_BBA                (*(volatile unsigned long *) 0x42404C8C)
#define GP5ODE_ODE3_MSK                (0x1   << 3  )
#define GP5ODE_ODE3                    (0x1   << 3  )
#define GP5ODE_ODE3_DIS                (0x0   << 3  )
#define GP5ODE_ODE3_EN                 (0x1   << 3  )

/* GP5ODE[ODE2] - Open drain enable */
#define GP5ODE_ODE2_BBA                (*(volatile unsigned long *) 0x42404C88)
#define GP5ODE_ODE2_MSK                (0x1   << 2  )
#define GP5ODE_ODE2                    (0x1   << 2  )
#define GP5ODE_ODE2_DIS                (0x0   << 2  )
#define GP5ODE_ODE2_EN                 (0x1   << 2  )

/* GP5ODE[ODE1] - Open drain enable */
#define GP5ODE_ODE1_BBA                (*(volatile unsigned long *) 0x42404C84)
#define GP5ODE_ODE1_MSK                (0x1   << 1  )
#define GP5ODE_ODE1                    (0x1   << 1  )
#define GP5ODE_ODE1_DIS                (0x0   << 1  )
#define GP5ODE_ODE1_EN                 (0x1   << 1  )

/* GP5ODE[ODE0] - Open drain enable */
#define GP5ODE_ODE0_BBA                (*(volatile unsigned long *) 0x42404C80)
#define GP5ODE_ODE0_MSK                (0x1   << 0  )
#define GP5ODE_ODE0                    (0x1   << 0  )
#define GP5ODE_ODE0_DIS                (0x0   << 0  )
#define GP5ODE_ODE0_EN                 (0x1   << 0  )
// ------------------------------------------------------------------------------------------------
// -----                                        PWM                                        -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief PWM (pADI_PWM)
  */

#if (__NO_MMR_STRUCTS__==0)
typedef struct {                            /*!< pADI_PWM Structure                     */
  __IO uint16_t  PWMCON0;                   /*!< PWM control register                  */
  __I  uint16_t  RESERVED0;
  __IO uint16_t  PWMCON1;                   /*!< ADC conversion start and trip control register */
  __I  uint16_t  RESERVED1;
  __IO uint16_t  PWMICLR;                   /*!< Hardware trip configuration register  */
  __I  uint16_t  RESERVED2[3];
  __IO uint16_t  PWM0COM0;                  /*!< Compare Register 0 for PWM0 and PWM1  */
  __I  uint16_t  RESERVED3;
  __IO uint16_t  PWM0COM1;                  /*!< Compare Register 1 for PWM0 and PWM1  */
  __I  uint16_t  RESERVED4;
  __IO uint16_t  PWM0COM2;                  /*!< Compare Register 2 for PWM0 and PWM1  */
  __I  uint16_t  RESERVED5;
  __IO uint16_t  PWM0LEN;                   /*!< Period value register for PWM0 and PWM1 */
  __I  uint16_t  RESERVED6;
  __IO uint16_t  PWM1COM0;                  /*!< Compare Register 0 for PWM2 and PWM3  */
  __I  uint16_t  RESERVED7;
  __IO uint16_t  PWM1COM1;                  /*!< Compare Register 1 for PWM2 and PWM3  */
  __I  uint16_t  RESERVED8;
  __IO uint16_t  PWM1COM2;                  /*!< Compare Register 2 for PWM2 and PWM3  */
  __I  uint16_t  RESERVED9;
  __IO uint16_t  PWM1LEN;                   /*!< Period value register for PWM2 and PWM3 */
  __I  uint16_t  RESERVED10;
  __IO uint16_t  PWM2COM0;                  /*!< Compare Register 0 for PWM4 and PWM5  */
  __I  uint16_t  RESERVED11;
  __IO uint16_t  PWM2COM1;                  /*!< Compare Register 1 for PWM4 and PWM5  */
  __I  uint16_t  RESERVED12;
  __IO uint16_t  PWM2COM2;                  /*!< Compare Register 2 for PWM4 and PWM5  */
  __I  uint16_t  RESERVED13;
  __IO uint16_t  PWM2LEN;                   /*!< Period value register for PWM4 and PWM5 */
  __I  uint16_t  RESERVED14;
  __IO uint16_t  PWM3COM0;                  /*!< Compare Register 0 for PWM6 and PWM7  */
  __I  uint16_t  RESERVED15;
  __IO uint16_t  PWM3COM1;                  /*!< Compare Register 1 for PWM6 and PWM7  */
  __I  uint16_t  RESERVED16;
  __IO uint16_t  PWM3COM2;                  /*!< Compare Register 2 for PWM6 and PWM7  */
  __I  uint16_t  RESERVED17;
  __IO uint16_t  PWM3LEN;                   /*!< Period value register for PWM6 and PWM7 */
} ADI_PWM_TypeDef;
#else // (__NO_MMR_STRUCTS__==0)
#define          PWMCON0                                    (*(volatile unsigned short int *) 0x40024000)
#define          PWMCON1                                    (*(volatile unsigned short int *) 0x40024004)
#define          PWMICLR                                    (*(volatile unsigned short int *) 0x40024008)
#define          PWM0COM0                                   (*(volatile unsigned short int *) 0x40024010)
#define          PWM0COM1                                   (*(volatile unsigned short int *) 0x40024014)
#define          PWM0COM2                                   (*(volatile unsigned short int *) 0x40024018)
#define          PWM0LEN                                    (*(volatile unsigned short int *) 0x4002401C)
#define          PWM1COM0                                   (*(volatile unsigned short int *) 0x40024020)
#define          PWM1COM1                                   (*(volatile unsigned short int *) 0x40024024)
#define          PWM1COM2                                   (*(volatile unsigned short int *) 0x40024028)
#define          PWM1LEN                                    (*(volatile unsigned short int *) 0x4002402C)
#define          PWM2COM0                                   (*(volatile unsigned short int *) 0x40024030)
#define          PWM2COM1                                   (*(volatile unsigned short int *) 0x40024034)
#define          PWM2COM2                                   (*(volatile unsigned short int *) 0x40024038)
#define          PWM2LEN                                    (*(volatile unsigned short int *) 0x4002403C)
#define          PWM3COM0                                   (*(volatile unsigned short int *) 0x40024040)
#define          PWM3COM1                                   (*(volatile unsigned short int *) 0x40024044)
#define          PWM3COM2                                   (*(volatile unsigned short int *) 0x40024048)
#define          PWM3LEN                                    (*(volatile unsigned short int *) 0x4002404C)
#endif // (__NO_MMR_STRUCTS__==0)

/* Reset Value for PWMCON0*/
#define PWMCON0_RVAL                   0x12 

/* PWMCON0[SYNC] - Set to enable PWM synchronization from the SYNC pin of the PWM */
#define PWMCON0_SYNC_BBA               (*(volatile unsigned long *) 0x4248003C)
#define PWMCON0_SYNC_MSK               (0x1   << 15 )
#define PWMCON0_SYNC                   (0x1   << 15 )
#define PWMCON0_SYNC_DIS               (0x0   << 15 ) /* Ignore transition from the SYNC pin */
#define PWMCON0_SYNC_EN                (0x1   << 15 ) /* All PWM counters are reset on the next clock cycle after detection of a falling edge from SYNC pin */

