koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm320i.h
/* PWMCON0[PWM7INV] - Set to invert PWM7 output */
#define PWMCON0_PWM7INV_BBA            (*(volatile unsigned long *) 0x42480038)
#define PWMCON0_PWM7INV_MSK            (0x1   << 14 )
#define PWMCON0_PWM7INV                (0x1   << 14 )
#define PWMCON0_PWM7INV_DIS            (0x0   << 14 )
#define PWMCON0_PWM7INV_EN             (0x1   << 14 )

/* PWMCON0[PWM5INV] - Set to invert PWM5 output */
#define PWMCON0_PWM5INV_BBA            (*(volatile unsigned long *) 0x42480034)
#define PWMCON0_PWM5INV_MSK            (0x1   << 13 )
#define PWMCON0_PWM5INV                (0x1   << 13 )
#define PWMCON0_PWM5INV_DIS            (0x0   << 13 )
#define PWMCON0_PWM5INV_EN             (0x1   << 13 )

/* PWMCON0[PWM3INV] - Set to invert PWM3 output */
#define PWMCON0_PWM3INV_BBA            (*(volatile unsigned long *) 0x42480030)
#define PWMCON0_PWM3INV_MSK            (0x1   << 12 )
#define PWMCON0_PWM3INV                (0x1   << 12 )
#define PWMCON0_PWM3INV_DIS            (0x0   << 12 )
#define PWMCON0_PWM3INV_EN             (0x1   << 12 )

/* PWMCON0[PWM1INV] - Set to invert PWM1 output */
#define PWMCON0_PWM1INV_BBA            (*(volatile unsigned long *) 0x4248002C)
#define PWMCON0_PWM1INV_MSK            (0x1   << 11 )
#define PWMCON0_PWM1INV                (0x1   << 11 )
#define PWMCON0_PWM1INV_DIS            (0x0   << 11 )
#define PWMCON0_PWM1INV_EN             (0x1   << 11 )

/* PWMCON0[PWMIEN] - Set to enable interrupts for PWM */
#define PWMCON0_PWMIEN_BBA             (*(volatile unsigned long *) 0x42480028)
#define PWMCON0_PWMIEN_MSK             (0x1   << 10 )
#define PWMCON0_PWMIEN                 (0x1   << 10 )
#define PWMCON0_PWMIEN_DIS             (0x0   << 10 )
#define PWMCON0_PWMIEN_EN              (0x1   << 10 )

/* PWMCON0[ENA] - When HOFF=0 and HMODE=1 this serves as enable for Pair 0 and 1 */
#define PWMCON0_ENA_BBA                (*(volatile unsigned long *) 0x42480024)
#define PWMCON0_ENA_MSK                (0x1   << 9  )
#define PWMCON0_ENA                    (0x1   << 9  )
#define PWMCON0_ENA_DIS                (0x0   << 9  ) /* Disable Pair 0 and 1     */
#define PWMCON0_ENA_EN                 (0x1   << 9  ) /* Enable Pair 0 and 1      */

/* PWMCON0[PWMCMP] - PWM Clock prescaler. Sets HCLK divider. */
#define PWMCON0_PWMCMP_MSK             (0x7   << 6  )
#define PWMCON0_PWMCMP_DIV2            (0x0   << 6  ) /* HCLK/2                   */
#define PWMCON0_PWMCMP_DIV4            (0x1   << 6  ) /* HCLK/4                   */
#define PWMCON0_PWMCMP_DIV8            (0x2   << 6  ) /* HCLK/8                   */
#define PWMCON0_PWMCMP_DIV16           (0x3   << 6  ) /* HCLK/16                  */
#define PWMCON0_PWMCMP_DIV32           (0x4   << 6  ) /* HCLK/32                  */
#define PWMCON0_PWMCMP_DIV64           (0x5   << 6  ) /* HCLK/64                  */
#define PWMCON0_PWMCMP_DIV128          (0x6   << 6  ) /* HCLK/128                 */
#define PWMCON0_PWMCMP_DIV256          (0x7   << 6  ) /* HCLK/256                 */

/* PWMCON0[POINV] - Set to invert PWM outputs for Pair 0 and 1 when PWM is in H-bridge mode */
#define PWMCON0_POINV_BBA              (*(volatile unsigned long *) 0x42480014)
#define PWMCON0_POINV_MSK              (0x1   << 5  )
#define PWMCON0_POINV                  (0x1   << 5  )
#define PWMCON0_POINV_DIS              (0x0   << 5  )
#define PWMCON0_POINV_EN               (0x1   << 5  )

/* PWMCON0[HOFF] - Set to turn off the high-side for Pair 0 and 1 when PWM is in H-bridge mode */
#define PWMCON0_HOFF_BBA               (*(volatile unsigned long *) 0x42480010)
#define PWMCON0_HOFF_MSK               (0x1   << 4  )
#define PWMCON0_HOFF                   (0x1   << 4  )
#define PWMCON0_HOFF_DIS               (0x0   << 4  )
#define PWMCON0_HOFF_EN                (0x1   << 4  )

/* PWMCON0[LCOMP] - Signal to load a new set of compare register values. In standard mode, this bit is cleared when the new values are loaded in the compare registers for all the channels. In H-bridge mode this bit does not get cleared, but the user must write a value of 1 to this bit in order for the compare registers to be loaded */
#define PWMCON0_LCOMP_BBA              (*(volatile unsigned long *) 0x4248000C)
#define PWMCON0_LCOMP_MSK              (0x1   << 3  )
#define PWMCON0_LCOMP                  (0x1   << 3  )
#define PWMCON0_LCOMP_DIS              (0x0   << 3  ) /* Use the values previously store in the compare and length registers */
#define PWMCON0_LCOMP_EN               (0x1   << 3  ) /* Load the internal compare registers with values stored in the PWMxCOMx and PWMxLEN registers */

/* PWMCON0[DIR] - Direction control when PWM is in H-bridge mode */
#define PWMCON0_DIR_BBA                (*(volatile unsigned long *) 0x42480008)
#define PWMCON0_DIR_MSK                (0x1   << 2  )
#define PWMCON0_DIR                    (0x1   << 2  )
#define PWMCON0_DIR_DIS                (0x0   << 2  ) /* PWM2 and PWM3 act as output signals while PWM0 and PWM1 are held low */
#define PWMCON0_DIR_EN                 (0x1   << 2  ) /* PWM0 and PWM1 act as output signals while PWM2 and PWM3 are held low */

/* PWMCON0[HMODE] - Set to enable H-bridge mode */
#define PWMCON0_HMODE_BBA              (*(volatile unsigned long *) 0x42480004)
#define PWMCON0_HMODE_MSK              (0x1   << 1  )
#define PWMCON0_HMODE                  (0x1   << 1  )
#define PWMCON0_HMODE_DIS              (0x0   << 1  )
#define PWMCON0_HMODE_EN               (0x1   << 1  )

/* PWMCON0[PWMEN] - Master enable for PWM */
#define PWMCON0_PWMEN_BBA              (*(volatile unsigned long *) 0x42480000)
#define PWMCON0_PWMEN_MSK              (0x1   << 0  )
#define PWMCON0_PWMEN                  (0x1   << 0  )
#define PWMCON0_PWMEN_DIS              (0x0   << 0  ) /* Disable all PWM outputs  */
#define PWMCON0_PWMEN_EN               (0x1   << 0  ) /* Enable all PWM outputs   */

/* Reset Value for PWMCON1*/
#define PWMCON1_RVAL                   0x0 

/* PWMCON1[TRIP_EN] - Set to enable PWM Trip functionality */
#define PWMCON1_TRIP_EN_BBA            (*(volatile unsigned long *) 0x42480098)
#define PWMCON1_TRIP_EN_MSK            (0x1   << 6  )
#define PWMCON1_TRIP_EN                (0x1   << 6  )
#define PWMCON1_TRIP_EN_DIS            (0x0   << 6  )
#define PWMCON1_TRIP_EN_EN             (0x1   << 6  )

/* Reset Value for PWMICLR*/
#define PWMICLR_RVAL                   0x0 

/* PWMICLR[TRIP] - Write a 1 to clear latched IRQPWMTrip interrupt. Returns 0 on reads. */
#define PWMICLR_TRIP_BBA               (*(volatile unsigned long *) 0x42480110)
#define PWMICLR_TRIP_MSK               (0x1   << 4  )
#define PWMICLR_TRIP                   (0x1   << 4  )
#define PWMICLR_TRIP_DIS               (0x0   << 4  )
#define PWMICLR_TRIP_EN                (0x1   << 4  )

/* PWMICLR[PWM3] - Write a 1 to clear latched IRQPWM3 interrupt. Returns 0 on reads. */
#define PWMICLR_PWM3_BBA               (*(volatile unsigned long *) 0x4248010C)
#define PWMICLR_PWM3_MSK               (0x1   << 3  )
#define PWMICLR_PWM3                   (0x1   << 3  )
#define PWMICLR_PWM3_DIS               (0x0   << 3  )
#define PWMICLR_PWM3_EN                (0x1   << 3  )

/* PWMICLR[PWM2] - Write a 1 to clear latched IRQPWM2 interrupt. Returns 0 on reads. */
#define PWMICLR_PWM2_BBA               (*(volatile unsigned long *) 0x42480108)
#define PWMICLR_PWM2_MSK               (0x1   << 2  )
#define PWMICLR_PWM2                   (0x1   << 2  )
#define PWMICLR_PWM2_DIS               (0x0   << 2  )
#define PWMICLR_PWM2_EN                (0x1   << 2  )

/* PWMICLR[PWM1] - Write a 1 to clear latched IRQPWM1 interrupt. Returns 0 on reads. */
#define PWMICLR_PWM1_BBA               (*(volatile unsigned long *) 0x42480104)
#define PWMICLR_PWM1_MSK               (0x1   << 1  )
#define PWMICLR_PWM1                   (0x1   << 1  )
#define PWMICLR_PWM1_DIS               (0x0   << 1  )
#define PWMICLR_PWM1_EN                (0x1   << 1  )

/* PWMICLR[PWM0] - Write a 1 to clear latched IRQPWM0 interrupt. Returns 0 on reads. */
#define PWMICLR_PWM0_BBA               (*(volatile unsigned long *) 0x42480100)
#define PWMICLR_PWM0_MSK               (0x1   << 0  )
#define PWMICLR_PWM0                   (0x1   << 0  )
#define PWMICLR_PWM0_DIS               (0x0   << 0  )
#define PWMICLR_PWM0_EN                (0x1   << 0  )

