koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm320i.h
/* Reset Value for IBUFCON*/
#define IBUFCON_RVAL                   0xF 

/* IBUFCON[IBUF_CHOP] - CHOPINBUF enable the chop per InBuf separately */
#define IBUFCON_IBUF_CHOP_MSK          (0x3   << 4  )
#define IBUFCON_IBUF_CHOP_OFF          (0x0   << 4  ) /* Chopping disabled on both buffers. */
#define IBUFCON_IBUF_CHOP_NSIDE        (0x1   << 4  ) /* Chopping enabled on N-side only. P-side Disabled. */
#define IBUFCON_IBUF_CHOP_PSIDE        (0x2   << 4  ) /* Chopping enabled on P-side only. N-side Disabled. */
#define IBUFCON_IBUF_CHOP_BOTH         (0x3   << 4  ) /* Chopping enabled on both buffers. */

/* IBUFCON[IBUF_PD] - Power down P/N InBuf separately */
#define IBUFCON_IBUF_PD_MSK            (0x3   << 2  )
#define IBUFCON_IBUF_PD_NONE           (0x0   << 2  ) /* Both sides powered on    */
#define IBUFCON_IBUF_PD_NSIDE          (0x1   << 2  ) /* only N side powered down */
#define IBUFCON_IBUF_PD_PSIDE          (0x2   << 2  ) /* only P side powered down */
#define IBUFCON_IBUF_PD_BOTH           (0x3   << 2  ) /* Both sides powered down  */

/* IBUFCON[IBUF_BYP] - Bypass P/N InBuf seperately */
#define IBUFCON_IBUF_BYP_MSK           (0x3   << 0  )
#define IBUFCON_IBUF_BYP_NONE          (0x0   << 0  ) /* Bypass none sided        */
#define IBUFCON_IBUF_BYP_NSIDE         (0x1   << 0  ) /* N side bypassed          */
#define IBUFCON_IBUF_BYP_PSIDE         (0x2   << 0  ) /* P side bypassed          */
#define IBUFCON_IBUF_BYP_BOTH          (0x3   << 0  ) /* Bypass both              */
// ------------------------------------------------------------------------------------------------
// -----                                        LV                                        -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief LV_MISC (pADI_LV)
  */

#if (__NO_MMR_STRUCTS__==0)
typedef struct {                            /*!< pADI_LV Structure                      */
  __IO uint16_t  LVID;                      /*!< Low voltage die ID                    */
} ADI_LV_TypeDef;
#else // (__NO_MMR_STRUCTS__==0)
#define          LVID                                       (*(volatile unsigned short int *) 0x40082C30)
#endif // (__NO_MMR_STRUCTS__==0)

/* Reset Value for LVID*/
#define LVID_RVAL                      0x71 

/* LVID[LVID] - LVID comes from hardware coded logic */
#define LVID_LVID_MSK                  (0xFFFF << 0  )
// ------------------------------------------------------------------------------------------------
// -----                                        LV_RST                                        -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief LV_MISC (pADI_LV_RST)
  */

#if (__NO_MMR_STRUCTS__==0)
typedef struct {                            /*!< pADI_LV_RST Structure                  */
  __IO uint16_t  LVRST;                     /*!< LV die reset configuration            */
} ADI_LV_RST_TypeDef;
#else // (__NO_MMR_STRUCTS__==0)
#define          LVRST                                      (*(volatile unsigned short int *) 0x40082C34)
#endif // (__NO_MMR_STRUCTS__==0)

/* Reset Value for LVRST*/
#define LVRST_RVAL                     0x0 

/* LVRST[RETAIN] - LV retains status after WDT and software reset */
#define LVRST_RETAIN_BBA               (*(volatile unsigned long *) 0x43058680)
#define LVRST_RETAIN_MSK               (0x1   << 0  )
#define LVRST_RETAIN                   (0x1   << 0  )
#define LVRST_RETAIN_EN                (0x0   << 0  ) /* LV die retains status after watchdog or software reset. */
#define LVRST_RETAIN_DIS               (0x1   << 0  ) /* LV die does not retain status after watchdog or software reset. */
// ------------------------------------------------------------------------------------------------
// -----                                        LV_INT                                        -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief LV_INT (pADI_LV_INT)
  */

#if (__NO_MMR_STRUCTS__==0)
typedef struct {                            /*!< pADI_LV_INT Structure                  */
  __IO uint16_t  INTCLR;                    /*!< Interrupt clear register              */
  __I  uint16_t  RESERVED0;
  __IO uint16_t  INTSEL;                    /*!< Interrupt mask register               */
  __I  uint16_t  RESERVED1;
  __IO uint16_t  INTSTA;                    /*!< Interrupt status register             */
} ADI_LV_INT_TypeDef;
#else // (__NO_MMR_STRUCTS__==0)
#define          INTCLR                                     (*(volatile unsigned short int *) 0x40083004)
#define          INTSEL                                     (*(volatile unsigned short int *) 0x40083008)
#define          INTSTA                                     (*(volatile unsigned short int *) 0x4008300C)
#endif // (__NO_MMR_STRUCTS__==0)

/* Reset Value for INTCLR*/
#define INTCLR_RVAL                    0x0 

/* INTCLR[CLR_WRECC_ERR] - Write 1 to this bit to clear the write ECC error interrupt flag */
#define INTCLR_CLR_WRECC_ERR_BBA       (*(volatile unsigned long *) 0x4306009C)
#define INTCLR_CLR_WRECC_ERR_MSK       (0x1   << 7  )
#define INTCLR_CLR_WRECC_ERR           (0x1   << 7  )
#define INTCLR_CLR_WRECC_ERR_DIS       (0x0   << 7  )
#define INTCLR_CLR_WRECC_ERR_EN        (0x1   << 7  )

/* INTCLR[CLR_RDECC_ERR] - Write 1 to this bit to clear the read ECC error interrupt flag */
#define INTCLR_CLR_RDECC_ERR_BBA       (*(volatile unsigned long *) 0x43060098)
#define INTCLR_CLR_RDECC_ERR_MSK       (0x1   << 6  )
#define INTCLR_CLR_RDECC_ERR           (0x1   << 6  )
#define INTCLR_CLR_RDECC_ERR_DIS       (0x0   << 6  )
#define INTCLR_CLR_RDECC_ERR_EN        (0x1   << 6  )

/* INTCLR[CLR_IDAC_EXTRESLOW] - Write 1 to this bit to clear the IDAC EXTRESLOW interrupt flag */
#define INTCLR_CLR_IDAC_EXTRESLOW_BBA  (*(volatile unsigned long *) 0x43060094)
#define INTCLR_CLR_IDAC_EXTRESLOW_MSK  (0x1   << 5  )
#define INTCLR_CLR_IDAC_EXTRESLOW      (0x1   << 5  )
#define INTCLR_CLR_IDAC_EXTRESLOW_DIS  (0x0   << 5  )
#define INTCLR_CLR_IDAC_EXTRESLOW_EN   (0x1   << 5  )

/* INTCLR[CLR_IDAC_TSHUT] - Write 1 to this bit to clear the IDAC TSHUT interrupt flag */
#define INTCLR_CLR_IDAC_TSHUT_BBA      (*(volatile unsigned long *) 0x43060090)
#define INTCLR_CLR_IDAC_TSHUT_MSK      (0x1   << 4  )
#define INTCLR_CLR_IDAC_TSHUT          (0x1   << 4  )
#define INTCLR_CLR_IDAC_TSHUT_DIS      (0x0   << 4  )
#define INTCLR_CLR_IDAC_TSHUT_EN       (0x1   << 4  )

/* INTCLR[CLR_ACOMP] - Write 1 to this bit to clear the analog compare interrupt flag */
#define INTCLR_CLR_ACOMP_BBA           (*(volatile unsigned long *) 0x4306008C)
#define INTCLR_CLR_ACOMP_MSK           (0x1   << 3  )
#define INTCLR_CLR_ACOMP               (0x1   << 3  )
#define INTCLR_CLR_ACOMP_DIS           (0x0   << 3  )
#define INTCLR_CLR_ACOMP_EN            (0x1   << 3  )

