koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm320i.h
#define          IDAC1DAT                                   (*(volatile unsigned long      *) 0x40086808)
#define          IDAC1CON                                   (*(volatile unsigned char      *) 0x4008680C)
#endif // (__NO_MMR_STRUCTS__==1)

/* Reset Value for IDAC1DAT*/
#define IDAC1DAT_RVAL                  0x0 

/* IDAC1DAT[DATH] - IDAC1 high data */
#define IDAC1DAT_DATH_MSK              (0x7FF << 17 )

/* IDAC1DAT[DATL] - IDAC1 low data */
#define IDAC1DAT_DATL_MSK              (0x1F  << 12 )

/* IDAC1DAT[SYNC] - IDAC1 sync bits */
#define IDAC1DAT_SYNC_MSK              (0x3F  << 0  )

/* Reset Value for IDAC1CON*/
#define IDAC1CON_RVAL                  0x1 

/* IDAC1CON[CLRB] - IDAC1 Clear bit */
#define IDAC1CON_CLRB_BBA              (*(volatile unsigned long *) 0x430D019C)
#define IDAC1CON_CLRB_MSK              (0x1   << 7  )
#define IDAC1CON_CLRB                  (0x1   << 7  )

/* IDAC1CON[SHT_EN] - IDAC1 shutdown enable */
#define IDAC1CON_SHT_EN_BBA            (*(volatile unsigned long *) 0x430D0198)
#define IDAC1CON_SHT_EN_MSK            (0x1   << 6  )
#define IDAC1CON_SHT_EN                (0x1   << 6  )

/* IDAC1CON[BW] - IDAC1 bandwidth */
#define IDAC1CON_BW_MSK                (0xF   << 2  )

/* IDAC1CON[PUL] - IDAC1 pull down */
#define IDAC1CON_PUL_BBA               (*(volatile unsigned long *) 0x430D0184)
#define IDAC1CON_PUL_MSK               (0x1   << 1  )
#define IDAC1CON_PUL                   (0x1   << 1  )

/* IDAC1CON[PD] - IDAC1 power down */
#define IDAC1CON_PD_BBA                (*(volatile unsigned long *) 0x430D0180)
#define IDAC1CON_PD_MSK                (0x1   << 0  )
#define IDAC1CON_PD                    (0x1   << 0  )
#define IDAC1CON_PD_OFF                (0x0   << 0  ) /* Powers IDAC1 up          */
#define IDAC1CON_PD_ON                 (0x1   << 0  ) /* Powers IDAC1 down        */
#if (__NO_MMR_STRUCTS__==1)

#define          IDAC2DAT                                   (*(volatile unsigned long      *) 0x40086810)
#define          IDAC2CON                                   (*(volatile unsigned char      *) 0x40086814)
#endif // (__NO_MMR_STRUCTS__==1)

/* Reset Value for IDAC2DAT*/
#define IDAC2DAT_RVAL                  0x0 

/* IDAC2DAT[DATH] - IDAC2 high data */
#define IDAC2DAT_DATH_MSK              (0x7FF << 17 )

/* IDAC2DAT[DATL] - IDAC2 low data */
#define IDAC2DAT_DATL_MSK              (0x1F  << 12 )

/* IDAC2DAT[SYNC] - IDAC2 sync bits */
#define IDAC2DAT_SYNC_MSK              (0x3F  << 0  )

/* Reset Value for IDAC2CON*/
#define IDAC2CON_RVAL                  0x1 

/* IDAC2CON[CLR] - IDAC2 Clear bit */
#define IDAC2CON_CLR_BBA               (*(volatile unsigned long *) 0x430D029C)
#define IDAC2CON_CLR_MSK               (0x1   << 7  )
#define IDAC2CON_CLR                   (0x1   << 7  )

/* IDAC2CON[SHT_EN] - IDAC2 shutdown enable */
#define IDAC2CON_SHT_EN_BBA            (*(volatile unsigned long *) 0x430D0298)
#define IDAC2CON_SHT_EN_MSK            (0x1   << 6  )
#define IDAC2CON_SHT_EN                (0x1   << 6  )

/* IDAC2CON[BW] - IDAC2 bandwidth */
#define IDAC2CON_BW_MSK                (0xF   << 2  )

/* IDAC2CON[PUL] - IDAC2 pull down */
#define IDAC2CON_PUL_BBA               (*(volatile unsigned long *) 0x430D0284)
#define IDAC2CON_PUL_MSK               (0x1   << 1  )
#define IDAC2CON_PUL                   (0x1   << 1  )

/* IDAC2CON[PD] - IDAC2 power down */
#define IDAC2CON_PD_BBA                (*(volatile unsigned long *) 0x430D0280)
#define IDAC2CON_PD_MSK                (0x1   << 0  )
#define IDAC2CON_PD                    (0x1   << 0  )
#define IDAC2CON_PD_OFF                (0x0   << 0  ) /* Powers IDAC2 up          */
#define IDAC2CON_PD_ON                 (0x1   << 0  ) /* Powers IDAC2 down        */
#if (__NO_MMR_STRUCTS__==1)

#define          IDAC3DAT                                   (*(volatile unsigned long      *) 0x40086818)
#define          IDAC3CON                                   (*(volatile unsigned char      *) 0x4008681C)
#endif // (__NO_MMR_STRUCTS__==1)

/* Reset Value for IDAC3DAT*/
#define IDAC3DAT_RVAL                  0x0 

/* IDAC3DAT[DATH] - IDAC3 high data */
#define IDAC3DAT_DATH_MSK              (0x7FF << 17 )

/* IDAC3DAT[DATL] - IDAC3 low data */
#define IDAC3DAT_DATL_MSK              (0x1F  << 12 )

/* IDAC3DAT[SYNC] - IDAC3 sync bits */
#define IDAC3DAT_SYNC_MSK              (0x3F  << 0  )

/* Reset Value for IDAC3CON*/
#define IDAC3CON_RVAL                  0x1 

/* IDAC3CON[CLR] - IDAC3 Clear bit */
#define IDAC3CON_CLR_BBA               (*(volatile unsigned long *) 0x430D039C)
#define IDAC3CON_CLR_MSK               (0x1   << 7  )
#define IDAC3CON_CLR                   (0x1   << 7  )

/* IDAC3CON[SHT_EN] - IDAC3 shutdown enable */
#define IDAC3CON_SHT_EN_BBA            (*(volatile unsigned long *) 0x430D0398)
#define IDAC3CON_SHT_EN_MSK            (0x1   << 6  )
#define IDAC3CON_SHT_EN                (0x1   << 6  )

/* IDAC3CON[BW] - IDAC3 bandwidth */
#define IDAC3CON_BW_MSK                (0xF   << 2  )

/* IDAC3CON[PUL] - IDAC3 pull down */
#define IDAC3CON_PUL_BBA               (*(volatile unsigned long *) 0x430D0384)
#define IDAC3CON_PUL_MSK               (0x1   << 1  )
#define IDAC3CON_PUL                   (0x1   << 1  )

/* IDAC3CON[PD] - IDAC3 power down */
#define IDAC3CON_PD_BBA                (*(volatile unsigned long *) 0x430D0380)
#define IDAC3CON_PD_MSK                (0x1   << 0  )
#define IDAC3CON_PD                    (0x1   << 0  )
#define IDAC3CON_PD_OFF                (0x0   << 0  ) /* Powers IDAC3 up          */
#define IDAC3CON_PD_ON                 (0x1   << 0  ) /* Powers IDAC3 down        */
// ------------------------------------------------------------------------------------------------
// -----                                        AFE                                        -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief comp_ldo_por_reftop_temp (pADI_AFE)
  */

#if (__NO_MMR_STRUCTS__==0)
typedef struct {                            /*!< pADI_AFE Structure                     */
  __IO uint8_t   AFETEMPC;                  /*!< Temp sensor configuration register    */
  __I  uint8_t   RESERVED0[3];
  __IO uint8_t   AFEREFC;                   /*!< Reference configuration register      */
  __I  uint8_t   RESERVED1[3];
  __IO uint16_t  AFECOMP;                   /*!< Analog comparator configuration register */
} ADI_AFE_TypeDef;
#else // (__NO_MMR_STRUCTS__==0)
#define          AFETEMPC                                   (*(volatile unsigned char      *) 0x40087830)
#define          AFEREFC                                    (*(volatile unsigned char      *) 0x40087834)
#define          AFECOMP                                    (*(volatile unsigned short int *) 0x40087838)
#endif // (__NO_MMR_STRUCTS__==0)

/* Reset Value for AFETEMPC*/
#define AFETEMPC_RVAL                  0x0 

/* AFETEMPC[CHOP] - Temperature sensor chopping enable. */
#define AFETEMPC_CHOP_BBA              (*(volatile unsigned long *) 0x430F0604)
#define AFETEMPC_CHOP_MSK              (0x1   << 1  )
#define AFETEMPC_CHOP                  (0x1   << 1  )
#define AFETEMPC_CHOP_DIS              (0x0   << 1  ) /* Disable chopping mode    */
#define AFETEMPC_CHOP_EN               (0x1   << 1  ) /* Enable chopping mode     */

