koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm320i.h
/* Reset Value for ISER0*/
#define ISER0_RVAL                     0x0 

/* Reset Value for ISER1*/
#define ISER1_RVAL                     0x0 

/* Reset Value for ICER0*/
#define ICER0_RVAL                     0x0 

/* Reset Value for ICER1*/
#define ICER1_RVAL                     0x0 

/* Reset Value for ISPR0*/
#define ISPR0_RVAL                     0x0 

/* Reset Value for ISPR1*/
#define ISPR1_RVAL                     0x0 

/* Reset Value for ICPR0*/
#define ICPR0_RVAL                     0x0 

/* Reset Value for ICPR1*/
#define ICPR1_RVAL                     0x0 

/* Reset Value for IABR0*/
#define IABR0_RVAL                     0x0 

/* Reset Value for IABR1*/
#define IABR1_RVAL                     0x0 

/* Reset Value for IPR0*/
#define IPR0_RVAL                      0x0 

/* Reset Value for IPR1*/
#define IPR1_RVAL                      0x0 

/* Reset Value for IPR2*/
#define IPR2_RVAL                      0x0 

/* Reset Value for IPR3*/
#define IPR3_RVAL                      0x0 

/* Reset Value for IPR4*/
#define IPR4_RVAL                      0x0 

/* Reset Value for IPR5*/
#define IPR5_RVAL                      0x0 

/* Reset Value for IPR6*/
#define IPR6_RVAL                      0x0 

/* Reset Value for IPR7*/
#define IPR7_RVAL                      0x0 

/* Reset Value for IPR8*/
#define IPR8_RVAL                      0x0 

/* Reset Value for IPR9*/
#define IPR9_RVAL                      0x0 

/* Reset Value for IPR10*/
#define IPR10_RVAL                     0x0 

/* Reset Value for IPR11*/
#define IPR11_RVAL                     0x0 

/* Reset Value for IPR12*/
#define IPR12_RVAL                     0x0 

/* Reset Value for IPR13*/
#define IPR13_RVAL                     0x0 

/* Reset Value for CPUID*/
#define CPUID_RVAL                     0x0 

/* Reset Value for ICSR*/
#define ICSR_RVAL                      0x0 

/* Reset Value for VTOR*/
#define VTOR_RVAL                      0x0 

/* Reset Value for AIRCR*/
#define AIRCR_RVAL                     0x0 

/* Reset Value for SCR*/
#define SCR_RVAL                       0x0 

/* SCR[SLEEPDEEP] - deep sleep flag for HIBERNATE mode */
#define SCR_SLEEPDEEP_MSK              (0x1   << 2  )
#define SCR_SLEEPDEEP                  (0x1   << 2  )
#define SCR_SLEEPDEEP_DIS              (0x0   << 2  )
#define SCR_SLEEPDEEP_EN               (0x1   << 2  )

/* SCR[SLEEPONEXIT] - Sleeps the core on exit from an ISR */
#define SCR_SLEEPONEXIT_MSK            (0x1   << 1  )
#define SCR_SLEEPONEXIT                (0x1   << 1  )
#define SCR_SLEEPONEXIT_DIS            (0x0   << 1  )
#define SCR_SLEEPONEXIT_EN             (0x1   << 1  )

/* Reset Value for CCR*/
#define CCR_RVAL                       0x0 

/* Reset Value for SHPR1*/
#define SHPR1_RVAL                     0x0 

/* Reset Value for SHPR2*/
#define SHPR2_RVAL                     0x0 

/* Reset Value for SHPR3*/
#define SHPR3_RVAL                     0x0 

/* Reset Value for SHCRS*/
#define SHCRS_RVAL                     0x0 

/* Reset Value for CFSR*/
#define CFSR_RVAL                      0x0 

/* Reset Value for HFSR*/
#define HFSR_RVAL                      0x0 

/* Reset Value for MMAR*/
#define MMAR_RVAL                      0x0 

/* Reset Value for BFAR*/
#define BFAR_RVAL                      0x0 

/* Reset Value for AFSR*/
#define AFSR_RVAL                      0x0 

/* Reset Value for STIR*/
#define STIR_RVAL                      0x0 


/* --------------------  End of section using anonymous unions  ------------------- */
#if defined(__CC_ARM)
  #pragma pop
#elif defined(__ICCARM__)
  /* leave anonymous unions enabled */
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined(__TASKING__)
  #pragma warning restore
#else
  #warning Not supported compiler type
#endif
/********************************************
** Miscellaneous Definitions               **
*********************************************/

//iEiNr in EiCfg()
#define EXTINT0 0x0 
#define EXTINT1 0x1 
#define EXTINT2 0x2 
#define EXTINT3 0x3 
#define EXTINT4 0x4 
#define EXTINT5 0x5 
#define EXTINT6 0x6 
#define EXTINT7 0x7 
#define EXTINT8 0x8 

//iEnable in EiCfg()
#define INT_DIS 0x0
#define INT_EN  0x1

//iMode in EiCfg() 
#define INT_RISE  0x0
#define INT_FALL  0x1
#define INT_EDGES 0x2
#define INT_HIGH  0x3
#define INT_LOW   0x4

//Bit values.
#define BIT0     1
#define BIT1     2
#define BIT2     4
#define BIT3     8
#define BIT4     0x10
#define BIT5     0x20
#define BIT6     0x40
#define BIT7     0x80


/* ================================================================================ */
/* ================              Peripheral memory map             ================ */
/* ================================================================================ */

#define ADI_TMR0_ADDR                            0x40000000UL
#define ADI_TMR1_ADDR                            0x40000400UL
#define ADI_TMR2_ADDR                            0x40000800UL
#define ADI_ID_ADDR                              0x40002024UL
#define ADI_PWRCTL_ADDR                          0x40002400UL
#define ADI_RESET_ADDR                           0x40002408UL
#define ADI_INTERRUPT_ADDR                       0x40002420UL
#define ADI_WDT_ADDR                             0x40002580UL
#define ADI_WUT_ADDR                             0x40002500UL
#define ADI_I2C0_ADDR                            0x40003000UL
#define ADI_I2C1_ADDR                            0x40003400UL
#define ADI_UART_ADDR                            0x40005000UL
#define ADI_MDIO_ADDR                            0x40005C00UL
#define ADI_PLA_ADDR                             0x40005800UL
#define ADI_DMA_ADDR                             0x40010000UL
#define ADI_FEE_ADDR                             0x40018000UL
#define ADI_GP0_ADDR                             0x40020000UL
#define ADI_GP1_ADDR                             0x40020040UL
#define ADI_GPIO_FIX_ADDR                        0x40020068UL
#define ADI_GP2_ADDR                             0x40020080UL
#define ADI_GP3_ADDR                             0x400200C0UL
#define ADI_GP4_ADDR                             0x40020100UL
#define ADI_GP5_ADDR                             0x40020240UL
#define ADI_PWM_ADDR                             0x40024000UL
#define ADI_CLKCTL_ADDR                          0x40028000UL
#define ADI_dma_ctl_ADDR                         0x40028100UL
#define ADI_SPI0_ADDR                            0x4002C000UL
#define ADI_SPI1_ADDR                            0x40030000UL
#define ADI_ADC_ADDR                             0x40082174UL
#define ADI_VDAC0_ADDR                           0x40082400UL
#define ADI_VDAC1_ADDR                           0x40082404UL
#define ADI_VDAC2_ADDR                           0x40082408UL
#define ADI_VDAC3_ADDR                           0x4008240CUL
#define ADI_VDAC4_ADDR                           0x40082410UL
#define ADI_VDAC5_ADDR                           0x40082414UL
#define ADI_VDAC6_ADDR                           0x40082418UL
#define ADI_VDAC7_ADDR                           0x4008241CUL
#define ADI_InBuf_ADDR                           0x40081400UL
#define ADI_LV_ADDR                              0x40082C30UL
#define ADI_LV_RST_ADDR                          0x40082C34UL
#define ADI_LV_INT_ADDR                          0x40083004UL
#define ADI_IDAC0_ADDR                           0x40086800UL
#define ADI_IDAC1_ADDR                           0x40086808UL
#define ADI_IDAC2_ADDR                           0x40086810UL
#define ADI_IDAC3_ADDR                           0x40086818UL
#define ADI_AFE_ADDR                             0x40087830UL


/* ================================================================================ */
/* ================             Peripheral declaration             ================ */
/* ================================================================================ */

